/**
-- BMS 传送点脚本空白模板 -------------------------------------------------------------------------
传送点 ID： 2
传送点名称： pt_undercover
所在地图ID： 800022200
所在地图名称： 
-- 作者 -------------------------------------------------------------------------------------------
模板：Jessefjxm
---------------------------------------------------------------------------------------------------
 **/

function enter(pi) {
	var cm = ms = rm = qm = im = pi;
	var id = pi.getPortal().getId();
	var name = pi.getPortal().getName();
	pi.playerMessage(5, "这个传送点 [" + id + " : " + name + "] 的脚本尚未修复。脚本位于： 脚本/传送点/pt_undercover.js 【注意】修改完脚本后要在控制台重载才能生效！");
}
