status = -1;
var itemList = Array(

Array(1102476, 50, 1, 3), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 50, 1, 3), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 50, 1, 3), // 诺巴凯伦披风 // (无描述)
Array(1072737, 50, 1, 3), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 50, 1, 3), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 50, 1, 3), // 诺巴凯伦靴 // (无描述)
Array(1072740, 50, 1, 3), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 50, 1, 3), // 诺巴阿尔泰靴 // (无描述)
Array(1102479, 50, 1, 3), // 诺巴利卡昂披风 // (无描述)
Array(1102480, 50, 1, 3), // 诺巴阿尔泰披风 // (无描述)
Array(1132169, 50, 1, 3), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 50, 1, 3), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 50, 1, 3), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 50, 1, 3), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 50, 1, 3), // 诺巴阿尔泰腰带 // (无描述)
Array(1532098, 50, 1, 3), // 法弗纳荣耀炮 - (无描述)
Array(1522094, 50, 1, 3), // 法弗纳双风翼弩 - (无描述)
Array(1492179, 50, 1, 3), // 法弗纳左轮枪 - (无描述)
Array(1482168, 50, 1, 3), // 法弗纳巨狼之爪 - (无描述)
Array(1472214, 50, 1, 3), // 法弗纳危险之手 - (无描述)
Array(1462193, 50, 1, 3), // 法弗纳风翼弩 - (无描述)
Array(1452205, 50, 1, 3), // 法弗纳追风者 - (无描述)
Array(1442223, 50, 1, 3), // 法弗纳半月宽刃斧 - (无描述)
Array(1432167, 50, 1, 3), // 法弗纳贯雷枪 - (无描述)
Array(1422140, 50, 1, 3), // 法弗纳闪电锤 - (无描述)
Array(1412135, 50, 1, 3), // 法弗纳战斗切肉斧 - (无描述)
Array(1402196, 50, 1, 3), // 法弗纳忏悔之剑 - (无描述)
Array(1382208, 50, 1, 3), // 法弗纳魔冠之杖 - (无描述)
Array(1372177, 50, 1, 3), // 法弗纳魔力夺取者 - (无描述)
Array(1362090, 50, 1, 3), // 法弗纳洞察手杖 - (无描述)
Array(1342082, 50, 1, 3), // 法弗纳急速之刃 - (无描述)
Array(1332225, 50, 1, 3), // 法弗纳大马士革剑 - (无描述)
Array(1322203, 50, 1, 3), // 法弗纳戈耳迪锤 - (无描述)
Array(1312153, 50, 1, 3), // 法弗纳双刃切肉斧 - (无描述)
Array(1302275, 50, 1, 3), // 法弗纳银槲之剑 - (无描述)
Array(1242061, 50, 1, 3), // 法弗纳精神之刃 - 鲁塔比斯套装(海盗)专用武器
Array(1242060, 50, 1, 3), // 法弗纳精神之刃 - 鲁塔比斯套装(飞侠)专用武器
Array(1232057, 50, 1, 3), // 法弗纳死亡使者 - (无描述)
Array(1222058, 50, 1, 3), // 法弗纳天使手铳 - (无描述)
Array(1003797, 50, 1, 3), // 高贵战士头盔 - (无描述)
Array(1003798, 50, 1, 3), // 高贵流丹维奇帽 - (无描述)
Array(1003799, 50, 1, 3), // 高贵游侠贝雷帽 - (无描述)
Array(1003800, 50, 1, 3), // 高贵刺客软帽 - (无描述)
Array(1003801, 50, 1, 3), // 高贵流浪者帽 - (无描述)
Array(1042254, 50, 1, 3), // 鹰眼战士盔甲 - (无描述)
Array(1042255, 50, 1, 3), // 鹰眼丹维奇长袍 - (无描述)
Array(1042256, 50, 1, 3), // 鹰眼游侠斗篷 - (无描述)
Array(1042257, 50, 1, 3), // 鹰眼刺客衬衣 - (无描述)
Array(1042258, 50, 1, 3), // 鹰眼流浪者外衣 - (无描述)
Array(1062165, 50, 1, 3), // 魔术师战士短裤 - (无描述)
Array(1062166, 50, 1, 3), // 魔术师丹维奇短裤 - (无描述)
Array(1062167, 50, 1, 3), // 魔术师游侠短裤 - (无描述)
Array(1062168, 50, 1, 3), // 魔术师刺客短裤 - (无描述)
Array(1062169, 50, 1, 3), // 魔术师流浪者短裤 - (无描述)
Array(1212063, 50, 1, 3),// 法弗纳魔力源泉杖 - (无描述)
Array(2040303, 50, 1, 3), // 耳环智力必成卷
Array(2040006, 50, 1, 3), // 头盔防御必成卷
Array(2040007, 50, 1, 3), // 头盔体力必成卷
Array(2040403, 50, 1, 3), // 上衣防御必成卷
Array(2040506, 50, 1, 3), // 全身盔甲敏捷必成卷
Array(2040507, 50, 1, 3), // 全身盔甲防御必成卷
Array(2040603, 50, 1, 3), // 裤裙防御必成卷
Array(2040507, 50, 1, 3), // 全身盔甲防御必成卷
Array(2040603, 50, 1, 3), // 裤裙防御必成卷
Array(2040709, 50, 1, 3), // 鞋子敏捷必成卷
Array(2040710, 50, 1, 3), // 鞋子跳跃必成卷
Array(2040711, 50, 1, 3), // 鞋子速度必成卷
Array(2040806, 50, 1, 3), // 手套敏捷必成卷
Array(2040903, 50, 1, 3), // 盾牌防御必成卷
Array(2040507, 50, 1, 3), // 全身盔甲防御必成卷
Array(2040603, 50, 1, 3), // 裤裙防御必成卷
Array(2041024, 50, 1, 3), // 披风魔法防御必成卷
Array(2041025, 50, 1, 3), // 披风物理防御必成卷
Array(2043003, 50, 1, 3), // 单手剑攻击必成卷
Array(2044019, 50, 1, 3), // 双手剑魔力必成卷
Array(2044019, 50, 1, 3), // 双手剑魔力必成卷
Array(2043103, 50, 1, 3), // 单手斧攻击必成卷
Array(2043203, 50, 1, 3), // 单手钝器攻击必成卷
Array(2043303, 50, 1, 3), // 短剑攻击必成卷
Array(2043703, 50, 1, 3), // 短杖攻击必成卷
Array(2043803, 50, 1, 3), // 长杖攻击必成卷
Array(2044003, 50, 1, 3), // 双手剑攻击必成卷
Array(2044019, 50, 1, 3), // 双手剑魔力必成卷
Array(2044103, 50, 1, 3), // 双手斧攻击必成卷
Array(2040903, 50, 1, 3), // 盾牌防御必成卷
Array(2040903, 50, 1, 3), // 盾牌防御必成卷
Array(2044203, 50, 1, 3), // 双手钝器攻击必成卷
Array(2044303, 50, 1, 3), // 枪攻击必成卷
Array(2044403, 50, 1, 3), // 矛攻击必成卷
Array(2044503, 50, 1, 3), // 弓攻击必成卷
Array(2044603, 50, 1, 3), // 弩攻击必成卷
Array(2044703, 50, 1, 3), // 拳套攻击必成卷
Array(2044815, 50, 1, 3), // 指节攻击必成卷
Array(2044908, 50, 1, 3), // 短枪攻击必成卷
Array(2340000, 50, 1, 3), // 祝福卷轴
Array(2049406, 50, 1, 3), // 特殊潜能附加卷轴
Array(2049303, 50, 1, 3), // 高级装备强化卷轴
Array(3010070, 50, 1, 3), // 巨无霸品克缤
Array(3010073, 50, 1, 3), // baby品克缤
Array(3010073, 50, 1, 3), // baby品克缤
Array(1402014, 50, 1, 3), // 温度计
Array(1003172, 50, 1, 3), // 狮心战斗头盔
Array(1102275, 50, 1, 3), // 狮心战斗披风
Array(1082295, 50, 1, 3), // 狮心战斗护腕
Array(1052314, 50, 1, 3), // 狮心战斗锁子甲
Array(1072485, 50, 1, 3), // 狮心战斗鞋
Array(1003173, 50, 1, 3), // 龙尾法师帽子
Array(1102276, 50, 1, 3), // 龙尾法师披风
Array(1082296, 50, 1, 3), // 龙尾法师手套
Array(1052315, 50, 1, 3), // 龙尾法师长袍
Array(1072486, 50, 1, 3), // 龙尾法师鞋
Array(1003174, 50, 1, 3), // 鹰翼哨兵便帽
Array(1102277, 50, 1, 3), // 鹰翼哨兵披风
Array(1082297, 50, 1, 3), // 鹰翼哨兵手套
Array(1052316, 50, 1, 3), // 鹰翼哨兵服
Array(1072487, 50, 1, 3), // 鹰翼哨兵鞋
Array(1003175, 50, 1, 3), // 渡鸦之魂追踪者帽
Array(1102278, 50, 1, 3), // 渡鸦之魂猎人披风
Array(1082298, 50, 1, 3), // 渡鸦之魂追踪者手套
Array(1052317, 50, 1, 3), // 渡鸦之魂追踪者盔甲
Array(1072488, 50, 1, 3), // 渡鸦之魂追踪者鞋
Array(1003176, 50, 1, 3), // 鲨齿船长帽
Array(1102279, 50, 1, 3), // 鲨齿船长披风
Array(1082299, 50, 1, 3), // 鲨齿船长手套
Array(1052318, 50, 1, 3), // 鲨齿船长外套
Array(1072489, 50, 1, 3), // 鲨齿船长鞋
Array(1432086, 50, 1, 3), // 狮心长枪
Array(1442116, 50, 1, 3), // 狮心长矛
Array(1322096, 50, 1, 3), // 狮心震雷
Array(1422066, 50, 1, 3), // 狮心巨锤
Array(1402095, 50, 1, 3), // 狮心战刀
Array(1412065, 50, 1, 3), // 狮心战斧
Array(1302152, 50, 1, 3), // 狮心弯刀
Array(1312065, 50, 1, 3), // 狮心勇斧
Array(1372084, 50, 1, 3), // 龙尾短杖
Array(1382104, 50, 1, 3), // 龙尾长杖
Array(1452111, 50, 1, 3), // 鹰翼重弓
Array(1462099, 50, 1, 3), // 鹰翼重弩
Array(1332130, 50, 1, 3), // 渡鸦之魂（短刀）
Array(1472122, 50, 1, 3), // 渡鸦之魂
Array(1342036, 50, 1, 3), // 精灵角刀
Array(1492085, 50, 1, 3), // 鲨齿手铳
Array(1532018, 50, 1, 3), // 鲨齿鹰爪
Array(1302016, 50, 1, 3), // 鲨齿火炮
Array(1522018, 50, 1, 3) // 龙翼弩枪
        );
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 60);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "被封印的箱子", notice);
            if (item != -1) {
                im.gainItem(2430640, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.dispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.dispose();
        }
    }
}