/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  @Author 娜娜 
 */

status = -1;
var ScrollList = Array(
//itemid,概率,数量 概率为10表示必暴，每次打开箱子只取一个元素
        Array(2340000, 10, 1), //祝福卷轴
        Array(2049752, 10, 2), //S级潜能卷轴 30%
        Array(2049750, 10, 1),
        Array(5064003, 10, 2), //极真3星装备强化卷轴 80%
        Array(2049137, 10, 5),
        Array(4310018, 10, 100), // 暴君B
        Array(4310018, 5, 300), // 暴君B
        Array(4310018, 7, 200), // 暴君B
        Array(2613000, 5, 1), // 星火单手武器攻击力卷轴 - 为单手武器附加提升攻击力的属性。
        Array(2613001, 10, 1), // 星火单手武器魔法力卷轴 - 为单手武器附加提升魔力的属性。
        Array(2612010, 5, 1), // 星火双手武器攻击力卷轴 - 为双手武器附加提升攻击力的属性。
        Array(2049323, 10, 2), //无损
        Array(2046913, 5, 1), // 宿命正义单手武器攻击力卷轴 100% // 为单手武器增加攻击力属性。
        Array(2046914, 10, 1), // 宿命正义单手武器魔力卷轴 100% // 为单手武器增加魔法攻击力属性。
        Array(2046173, 5, 1), // 宿命正义双手武器攻击力卷轴 100% // 为双手武器增加攻击力属性。
        Array(2046577, 7, 1), // 宿命正义防具力量卷轴 100% // 为防具增加力量属性。
        Array(2046578, 10, 1), // 宿命正义防具智力卷轴 100% // 为防具增加智力属性。
        Array(2046579, 5, 1), // 宿命正义防具敏捷卷轴 100% // 为防具增加敏捷属性。
        Array(2046580, 5, 1), // 宿命正义防具运气卷轴 100% // 为防具增加运气属性。
        Array(2046763, 5, 1), // 宿命正义饰品力量卷轴 100% // 为饰品增加力量属性。
        Array(2046764, 10, 1), // 宿命正义饰品智力卷轴 100% // 为饰品增加智力属性。
        Array(2046765, 10, 1), // 宿命正义饰品敏捷卷轴 100% // 为饰品增加敏捷属性。
        Array(2046766, 10, 1) // 宿命正义饰品运气卷轴 100% // 为饰品增加运气属性。
        );
var specialItem = Array(
        Array(5064300, 10, 10), //卷轴防护卷轴
        Array(5062500, 10, 10), //大师附加神奇魔方
        Array(5062000, 10, 10), //神奇魔方
        Array(5064000, 10, 10), //防爆卷轴
        Array(5064100, 10, 10), //保护卷轴
        Array(5064003, 10, 2), //极真防爆
        Array(5062002, 10, 10) //高级神奇魔方
        );
var ChairList = Array(
//椅子
        Array(3010007, 10, 1), // 粉色海豹靠垫, 1), // 是一款可爱的粉色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010008, 10, 1), // 蓝色海豹靠垫, 1), // 是一款可爱的蓝色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010838, 1, 1), // 冰城堡椅子*1
        Array(3015075, 1, 1), // 大自然
        Array(3010651, 3, 1), // 机器人1
        Array(3010652, 3, 1), // 机器人2
        Array(3010653, 3, 1), // 机器人3
        Array(3010654, 3, 1), // 机器人4
        Array(3010655, 3, 1), // 机器人5
        Array(3010656, 3, 1), // 机器人6
        Array(3015100, 5, 1), // 奥尔卡的布偶兔椅子
        Array(3015137, 5, 1), // 水果椅子
        Array(3010849, 5, 1), // 
        Array(3010018, 5, 1), // 
        Array(3010984, 5, 1), // 
        Array(3010026, 5, 1), // 
        Array(3010035, 5, 1), // 
        Array(3010207, 5, 1), // 
        Array(3010208, 5, 1), // 
        Array(3010211, 5, 1), // 
        Array(3012008, 10, 1), // 稻荷神社椅子
        Array(3010009, 10, 1), // 黑板椅子
        Array(3010010, 10, 1), // 白色海豹靠垫, 1), // 是一款可爱的白色海豹模样的靠垫，靠在上面每10秒钟HP恢复50。
        Array(3010014, 10, 1), // 月亮弯, 1), // 每10秒钟恢复HP&MP30，无法交换&交易.
        Array(3010016, 10, 1), // 黑色海豹靠垫, 1), // 是一款可爱的黑色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010017, 10, 1), // 金色海豹靠垫, 1), // 是一款可爱的金色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。50，MP恢复50。
        Array(3010558, 10, 1), // 泡泡浴椅子, 1), // 让人感觉自己好像变干净了。每10秒HP恢复50，MP恢复50。
        Array(3010559, 10, 1) // 龙蛋, 1), // 裂开的蛋。坐在上面休息时，每10秒HP恢复50，MP恢复50。
        )

var EquipList = Array(
        Array(1102471, 10, 1), // 赫里希安精锐战士披风 // (无描述)
        Array(1102472, 10, 1), // 赫里希安精锐法师披风 // (无描述)
        Array(1102473, 10, 1), // 赫里希安精锐弓箭手披风 // (无描述)
        Array(1102474, 10, 1), // 赫里希安精锐飞侠披风 // (无描述)
        Array(1102475, 10, 1), // 赫里希安精锐海盗披风 // (无描述)
        Array(1072732, 10, 1), // 赫里希安精锐战士靴 // (无描述)
        Array(1072733, 10, 1), // 赫里希安精锐法师靴 // (无描述)
        Array(1072734, 10, 1), // 赫里希安精锐弓箭手靴 // (无描述)
        Array(1072735, 10, 1), // 赫里希安精锐飞侠靴 // (无描述)
        Array(1072736, 10, 1), // 赫里希安精锐海盗靴 // (无描述)
        Array(1132164, 10, 1), // 赫里希安精锐战士腰带 // (无描述)
        Array(1132165, 10, 1), // 赫里希安精锐法师腰带 // (无描述)
        Array(1132166, 10, 1), // 赫里希安精锐弓箭手腰带 // (无描述)
        Array(1132167, 10, 1), // 赫里希安精锐飞侠腰带 // (无描述)
        Array(1132168, 10, 1), // 赫里希安精锐海盗腰带 // (无描述)
        Array(1004422, 10, 1), //埃苏莱布斯核心帽, 10, 1),//(战士)
        Array(1004423, 10, 1), //埃苏莱布斯核心帽, 10, 1),//(法师)
        Array(1004424, 10, 1), //埃苏莱布斯核心帽, 10, 1),//(弓箭手)
        Array(1004425, 10, 1), //埃苏莱布斯核心帽, 10, 1),//(飞侠)
        Array(1004426, 10, 1), //埃苏莱布斯核心帽, 10, 1),//(海盗)
        Array(1102775, 10, 1), //埃苏莱布斯核心披风, 10, 1),//(战士)
        Array(1102794, 10, 1), //埃苏莱布斯核心披风, 10, 1),//(法师)
        Array(1102795, 10, 1), //埃苏莱布斯核心披风, 10, 1),//(弓箭手)
        Array(1102796, 10, 1), //埃苏莱布斯核心披风, 10, 1),//(飞侠)
        Array(1102797, 10, 1), //埃苏莱布斯核心披风, 10, 1),//(海盗)
        Array(1082636, 10, 1), //埃苏莱布斯核心手套, 10, 1),//(战士)
        Array(1082637, 10, 1), //埃苏莱布斯核心手套, 10, 1),//(法师)
        Array(1082638, 10, 1), //埃苏莱布斯核心手套, 10, 1),//(弓箭手)
        Array(1082639, 10, 1), //埃苏莱布斯核心手套, 10, 1),//(飞侠)
        Array(1082640, 10, 1), //埃苏莱布斯核心手套, 10, 1),//(海盗)
        Array(1052882, 10, 1), //埃苏莱布斯核心套服, 10, 1),//(战士)
        Array(1052887, 10, 1), //埃苏莱布斯核心套服, 10, 1),//(法师)
        Array(1052888, 10, 1), //埃苏莱布斯核心套服, 10, 1),//(弓箭手)
        Array(1052889, 10, 1), //埃苏莱布斯核心套服, 10, 1),//(飞侠)
        Array(1052890, 10, 1), //埃苏莱布斯核心套服, 10, 1),//(海盗)
        Array(1073030, 10, 1), //埃苏莱布斯核心鞋, 10, 1),//(战士)
        Array(1073032, 10, 1), //埃苏莱布斯核心鞋, 10, 1),//(法师)
        Array(1073033, 10, 1), //埃苏莱布斯核心鞋, 10, 1),//(弓箭手)
        Array(1073034, 10, 1), //埃苏莱布斯核心鞋, 10, 1),//(飞侠)
        Array(1073035, 10, 1), //埃苏莱布斯核心鞋, 10, 1),//(海盗)
        Array(1212115, 7, 1), //埃苏莱布斯魔力源泉杖, 10, 1),//(夜光法师)
        Array(1222109, 7, 1), //埃苏莱布斯天使手铳, 10, 1),//(天使)
        Array(1232109, 7, 1), //埃苏莱布斯死亡使者, 10, 1),//(复仇者)
        Array(1242116, 7, 1), //埃苏莱布斯精神之刃, 10, 1),//(尖兵)
        Array(1302333, 7, 1), //埃苏莱布斯银槲之剑, 10, 1),//(单手剑)
        Array(1312199, 7, 1), //埃苏莱布斯双刃切肉斧, 10, 1),//(单手斧头)
        Array(1332274, 7, 1), //埃苏莱布斯大马士革剑, 10, 1),//(飞侠短刀)
        Array(1322250, 7, 1), //埃苏莱布斯戈耳迪锤, 10, 1),//(恶魔猎手)
        Array(1342101, 7, 1), //埃苏莱布斯急速之刃, 10, 1),//(双刀副手)
        Array(1362135, 7, 1), //埃苏莱布斯洞察手杖, 10, 1),//(幻影)
        Array(1372222, 7, 1), //埃苏莱布斯魔力夺取者, 10, 1),//(短杖)
        Array(1382259, 7, 1), //埃苏莱布斯魔冠之杖, 10, 1),//(长杖)
        Array(1402251, 7, 1), //埃苏莱布斯忏悔之剑, 10, 1),//(双手剑)
        Array(1412177, 7, 1), //埃苏莱布斯战斗切肉斧, 10, 1),//(双手斧头)
        Array(1422184, 7, 1), //埃苏莱布斯闪电锤, 10, 1),//(双手钝器)
        Array(1432214, 7, 1), //埃苏莱布斯贯雷枪, 10, 1),//(战士 枪 )
        Array(1442268, 7, 1), //埃苏莱布斯半月宽刃斧, 10, 1),//(战士 矛)
        Array(1452252, 7, 1), //埃苏莱布斯追风者, 10, 1),//(弓)
        Array(1462239, 7, 1), //埃苏莱布斯风翼弩, 10, 1),//(弩)
        Array(1472261, 7, 1), //埃苏莱布斯危险之手, 10, 1),//(飞侠拳套)
        Array(1482216, 7, 1), //埃苏莱布斯巨狼之爪, 10, 1),//(海盗指节)
        Array(1492231, 7, 1), //埃苏莱布斯左轮枪, 10, 1),//(海盗手枪)
        Array(1522138, 7, 1), //埃苏莱布斯双风翼弩, 10, 1),//(双弩精灵)
        Array(1532144, 7, 1), //埃苏莱布斯荣耀炮, 10, 1),//(火炮手)
        Array(1532144, 7, 1), //埃苏莱布斯荣耀炮, 10, 1),//(火炮手)
        Array(1102476, 10, 1), // 诺巴西亚戴斯披风 // (无描述)
        Array(1102477, 10, 1), // 诺巴赫尔梅斯披风 // (无描述)
        Array(1102478, 10, 1), // 诺巴凯伦披风 // (无描述)
        Array(1072737, 10, 1), // 诺巴西亚戴斯靴 // (无描述)
        Array(1072738, 10, 1), // 诺巴赫尔梅斯靴 // (无描述)
        Array(1072739, 10, 1), // 诺巴凯伦靴 // (无描述)
        Array(1072740, 10, 1), // 诺巴利卡昂靴 // (无描述)
        Array(1072741, 10, 1), // 诺巴阿尔泰靴 // (无描述)
        Array(1102479, 10, 1), // 诺巴利卡昂披风 // (无描述)
        Array(1102480, 10, 1), // 诺巴阿尔泰披风 // (无描述)
        Array(1132169, 10, 1), // 诺巴西亚戴斯腰带 // (无描述)
        Array(1132170, 10, 1), // 诺巴赫尔梅斯腰带 // (无描述)
        Array(1132171, 10, 1), // 诺巴凯伦腰带 // (无描述)
        Array(1132172, 10, 1), // 诺巴利卡昂腰带 // (无描述)
			    Array(1082695, 10, 1),
                Array(1004809, 10, 1),
                Array(1004808, 10, 1),
                Array(1004811, 10, 1),
                Array(1442274, 10, 1),
                Array(1004810, 10, 1),
                Array(1082697, 10, 1),
                Array(1004812, 10, 1),
                Array(1082696, 10, 1),
                Array(1332279, 10, 1),
                Array(1082699, 10, 1),
                Array(1082698, 10, 1),
                Array(1102944, 10, 1),
                Array(1342104, 10, 1),
                Array(1232113, 10, 1),
                Array(1362140, 10, 1),
                Array(1242122, 10, 1),
                Array(1242121, 10, 1),
                Array(1302343, 10, 1),
                Array(1053065, 10, 1),
                Array(1053064, 10, 1),
                Array(1053067, 10, 1),
                Array(1053066, 10, 1),
                Array(1582023, 10, 1),
                Array(1252098, 10, 1),
                Array(1152200, 10, 1),
                Array(1492235, 10, 1),
                Array(1152198, 10, 1),
                Array(1152199, 10, 1),
                Array(1152196, 10, 1),
                Array(1552119, 10, 1),
                Array(1152197, 10, 1),
                Array(1102943, 10, 1),
                Array(1102942, 10, 1),
                Array(1102941, 10, 1),
                Array(1053063, 10, 1),
                Array(1102940, 10, 1),
                Array(1302219, 10, 1),
                Array(1402259, 10, 1),
                Array(1412181, 10, 1),
                Array(1452257, 10, 1),
                Array(1312203, 10, 1),
                Array(1362063, 10, 1),
                Array(1432218, 10, 1),
                Array(1222113, 10, 1),
                Array(1322255, 10, 1),
                Array(1073159, 10, 1),
                Array(1073158, 10, 1),
                Array(1522143, 10, 1),
                Array(1532150, 10, 1),
                Array(1073161, 10, 1),
                Array(1073160, 10, 1),
                Array(1142505, 10, 1),
                Array(1073162, 10, 1),
                Array(1472265, 10, 1),
                Array(1382265, 10, 1),
                Array(1322156, 10, 1),
                Array(1262039, 10, 1),
                Array(1422189, 10, 1),
                Array(1462243, 10, 1),
                Array(1482221, 10, 1),
                Array(1542117, 10, 1),
                Array(1372228, 10, 1),
                Array(1212120, 10, 1),
		
//=======================贝勒德
        Array(1032221, 10, 1), //
        Array(1032222, 10, 1), //
        Array(1032223, 5, 1), //
        Array(1113073, 10, 1), //
        Array(1113074, 10, 1), //
        Array(1113075, 5, 1), //
        Array(1132244, 10, 1), //
        Array(1132245, 10, 1), //
        Array(1132246, 5, 1), //
//=====================巨匠首
        Array(1113063, 10, 1), // 
        Array(1113067, 10, 1), // 
        Array(1113178, 10, 1), // 
        Array(1152151, 10, 1), // 
        Array(1152149, 10, 1), // 
        Array(1152147, 10, 1), // 
        Array(1152145, 10, 1), // 
        Array(1152143, 10, 1), // 
        Array(1152141, 10, 1), //  
//=====================巨匠武器
        Array(1032200, 10, 1), // 
        Array(1152154, 10, 1), // 
        Array(1113055, 10, 1), // 
        Array(1212077, 10, 1), // 
        Array(1222072, 10, 1), // 
        Array(1232071, 10, 1), // 
        Array(1402204, 10, 1), // 
        Array(1242076, 10, 1), // 
        Array(1302285, 10, 1), // 
        Array(1312162, 10, 1), // 
        Array(1322213, 10, 1), // 
        Array(1332235, 10, 1), // 
        Array(1342084, 10, 1), // 
        Array(1362099, 10, 1), // 
        Array(1372186, 10, 1), // 
        Array(1382220, 10, 1), // 
        Array(1412144, 10, 1), // 
        Array(1422149, 10, 1), // 
        Array(1432176, 10, 1), // 
        Array(1442232, 10, 1), // 
        Array(1452214, 10, 1), // 
        Array(1462202, 10, 1), // 
        Array(1472223, 10, 1), // 
        Array(1482177, 10, 1), // 
        Array(1492188, 10, 1), // 
        Array(1522103, 10, 1), // 
        Array(1532106, 10, 1), // 
        Array(1252058, 10, 1), // 
        Array(1542075, 10, 1), // 
        Array(1552075, 10, 1),
		//200级装备神秘套装
		Array(1082695, 10, 1), // 神秘之影战士手套
                Array(1004809, 10, 1), // 神秘之影法师帽
                Array(1004808, 10, 1), // 神秘之影战士帽
                Array(1004811, 10, 1), // 
                Array(1442274, 10, 1), // 
                Array(1004810, 10, 1), // 
                Array(1082697, 10, 1), // 
                Array(1004812, 10, 1), // 
                Array(1082696, 10, 1), // 
                Array(1332279, 10, 1), // 
                Array(1082699, 10, 1), // 
                Array(1082698, 10, 1), // 
                Array(1102944, 10, 1), // 
                Array(1342104, 10, 1), // 
                Array(1232113, 10, 1), // 
                Array(1362140, 10, 1), // 
                Array(1242122, 10, 1), // 
                Array(1242121, 10, 1), // 
                Array(1302343, 10, 1), // 
                Array(1053065, 10, 1), // 
                Array(1053064, 10, 1), // 
                Array(1053067, 10, 1), // 
                Array(1053066, 10, 1), // 
                Array(1582023, 10, 1), // 
                Array(1252098, 10, 1), // 
                Array(1152200, 10, 1), // 
                Array(1492235, 10, 1), // 
                Array(1152198, 10, 1), // 
                Array(1152199, 10, 1), // 
                Array(1152196, 10, 1), // 
                Array(1552119, 10, 1), // 
                Array(1152197, 10, 1), // 
                Array(1102943, 10, 1), // 
                Array(1102942, 10, 1), // 
                Array(1102941, 10, 1), // 
                Array(1053063, 10, 1), // 
                Array(1102940, 10, 1), // 
                Array(1302219, 10, 1), // 
                Array(1402259, 10, 1), // 
                Array(1412181, 10, 1), // 
                Array(1452257, 10, 1), // 
                Array(1312203, 10, 1), // 
                Array(1362063, 10, 1), // 
                Array(1432218, 10, 1), // 
                Array(1222113, 10, 1), // 
                Array(1322255, 10, 1), // 
                Array(1073159, 10, 1), // 
                Array(1073158, 10, 1), // 
                Array(1522143, 10, 1), // 
                Array(1532150, 10, 1), // 
                Array(1073161, 10, 1), // 
                Array(1073160, 10, 1), // 
                Array(1142505, 10, 1), // 
                Array(1073162, 10, 1), // 
                Array(1472265, 10, 1), // 
                Array(1382265, 10, 1), // 
                Array(1322156, 10, 1), // 
                Array(1262039, 10, 1), // 
                Array(1422189, 10, 1), // 
                Array(1462243, 10, 1), // 
                Array(1482221, 10, 1), // 
                Array(1542117, 10, 1), // 
                Array(1372228, 10, 1), // 
                Array(1212120, 10, 1)
		
        )

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (im.getSpace(1) < 2 || im.getSpace(2) < 2 || im.getSpace(3) < 2 || im.getSpace(4) < 2 || im.getSpace(5) < 2) {
            im.sendOk("请让你的所有背包都腾出2个格子后再试。1");
            im.dispose();
            return;
        } else {
            var text = "打开了箱子，一共获得了：\r\n";
            var item;
            var random = Math.floor(Math.random() * 10);//0~10
            var rand = new java.util.Random().nextInt(ScrollList.length);
            var finalchance = ScrollList[rand][1];
            if (finalchance >= random) {
                var itemId = ScrollList[rand][0];
                var quantity = ScrollList[rand][2];
                var notice = 3;
                item = im.gainGachaponItem(itemId, quantity, "威尔宝藏箱", notice);
                if (item != -1) {
                    text += "#b#t" + item + "##k " + quantity + "个!\r\n";
                }
            }
            var rand = new java.util.Random().nextInt(specialItem.length)
            finalchance = specialItem[rand][1];
            random = Math.floor(Math.random() * 10);
            if (finalchance >= random) {
                itemId = specialItem[rand][0];
                quantity = specialItem[rand][2];
                notice = 3;
                item = im.gainGachaponItem(itemId, quantity, "威尔宝藏箱", notice);
                if (item != -1) {
                    text += "#b#t" + item + "##k " + quantity + "个!\r\n";
                }
            }

            var rand = new java.util.Random().nextInt(ChairList.length);
            finalchance = ChairList[rand][1];
            random = Math.floor(Math.random() * 10);
            if (finalchance >= random) {
                itemId = ChairList[rand][0];
                quantity = ChairList[rand][2];
                notice = 3;
                item = im.gainGachaponItem(itemId, quantity, "威尔宝藏箱", notice);
                if (item != -1) {
                    text += "#b#t" + item + "##k " + quantity + "个!\r\n";
                }
            }

            var rand = new java.util.Random().nextInt(EquipList.length);
            finalchance = EquipList[rand][1];
            random = Math.floor(Math.random() * 10);
            if (finalchance >= random) {
                itemId = EquipList[rand][0];
                quantity = EquipList[rand][2];
                notice = 3;
                item = im.gainGachaponItem(itemId, quantity, "威尔宝藏箱", notice);
                if (item != -1) {
                    text += "#b#t" + item + "##k " + quantity + "个!\r\n";
                }
            }
            if (text == "打开了箱子，一共获得了：\r\n") {
                im.sendOk(im.getSpace(1) + "运气真差。。。一个东西都没有得到！！" + finalchance)
            } else {
                im.sendOk(text);
            }
            im.gainItem(im.getItemId(), -1);
            im.safeDispose();
        }
    }
}