var status = -1;
var beauty = 0;
var hair_Colo_new;
var ct = -1;
var card = 0;

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else if (mode == 1) {
        status++;
    } else {
        status--;
    }

    switch (status) {
        case 0:
            cm.askMenu("如果您有#b#t5150052##k或者#b#t5151036##k，就让我来为您打造新的形象吧！下面做出您的选择吧。\r\n#b#L0#美发（使用#b#t5150052#）#l\r\n");
            break;
        case 1:
            if (selection == 0) {
                var hair = cm.getPlayerStat("HAIR");
                hair_Colo_new = [];
                beauty = 1;
                /*if (cm.getPlayerStat("GENDER") == 0) {
                    hair_Colo_new = [30000, 30010];
                } else {
                    hair_Colo_new = [31050, 31040, 31000, 31150, 31310, 31300, 31160, 31100, 31410, 31030, 31080, 31070];
                }
				*/
				if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
				40700,//黑色熔岩珊瑚爆炸头
40710,//黑色清爽小哥发型
40720,//黑色小辣椒发型-男
40730,//黑色麦吉发型
40740,//黑色奶茶少年
40750,//黑色妖魅童子男发型
40760,//黑色复古小生发型
40770,//黑色蓬松细卷发型
40780,//黑色休止符发型
40790,//黑色麻花发型
40680,//黑色叛逆少年发型
36770, //黑色男版草莓初恋发型
36800, //黑色小正太发型
36810, //黑色超级巨星发型-男神2号
36820, //黑色布雷斯发型
36830, //黑色白银雨发型
36840, //黑色提斯发型
36850, //黑色伦多发型
36860, //黑色小卷毛发型
36880, //黑色小狮子发型
36890, //黑色熊孩纸发型
36900, //黑色萌萌兔耳发型
36910, //黑色超胆侠发型
36920, //黑色动漫少年发型
36930, //黑色未来战士发型
36940, //黑色苹果头发型
36950, //黑色潇洒哥发型
36980, //黑色精灵王子发型
36990, //黑色艺术青年发型
40000, //黑色小绅士发型
40020, //黑色型男发型
40030, //黑色蓬松短发
40040 //黑色冬雪发型
                ];
            } else {
                hair_Colo_new = [
44020,//黑色艾斯尼发型
44030,//黑色清秀女生发型
44040,//黑色拟真机器人马伦发型
44050,//黑色拟真机器人西博发型
44060,//黑色拟真机器人安博发型
44070,//黑色拟真机器人埃伯利发型
44080,//黑色拟真机器人托普发型
44090,//黑色拟真机器人斯卡雷发型
44100,//黑色拟真机器人布仑兹发型
44110,//黑色拟真机器人金吉发型
44120,//黑色星云发型
44130,//黑色滚滚发型
44140,//黑色妖精维英发型
44150,//黑色天使发型
44160,//黑色齐耳烫发型
44170,//黑色摩丝定型发型
44180,//黑色黛米安发型
44190,//黑色叛逆少女发型
44200,//黑色真挚少女发型
44290,//黑色波波头发型
44300,//黑色白蔷薇女发型
44310,//黑色俏皮小妖精发型
44320,//黑色傲娇卷卷发型
44330,//黑色娉婷小妞发型
44340,//乱蓬蓬的头发
44350,//正式翼人发型
44360,//黑色时尚朋克发型
44370,//黑色半丸子头发型
44380,//黑色萌萌小乖囡发型
44390,//黑色立刻上学发型
44400,//黑色治愈萝莉发型
44410,//黑色不良学生发型
44420,//黑色捣蛋鬼发型
44430,//黑色灵气萌萌长发
41900,//名称:黑色柔顺发型
41910,//名称:黑色叛逆少女发型
41920,//名称:黑色扭辫发型
41930,//名称:黑色至爱发型
41940,//名称:검은색 16F/W트렌드헤어
41950,//名称:黑色小辣椒发型-女
41960,//名称:aa
41970,//黑色清秀短发
41980,//黑色天然卷发型
41990,//黑色清新波浪卷发
42010,//黑色鱼尾发型
42060,//Louie Hair
42070,//Louie Hair
42090,//黑色格罗娜发型
42110,//黑色纳瑞坎发型
42120,//黑色张博士发型
42090,//黑色格罗娜发型
42080,//黑色绯红之心发型
41840,//黑色NPC派发型
41830,//黑色NPC泡芙发型
41820,//黑色NPC布丁发型
41810,//黑色NPC栗子糕发型
41770,//黑色两小无猜发型
41760,//黑色万事屋发型
41750,//黑色可爱学生妹发型
41740,//黑色月下佳人发型
41730,//黑色俏皮短波浪发型
41720,//黑色琉璃波浪卷发型
41700,//黑色酸奶奶昔发型
41690,//黑色斜刘海魅惑卷发
41680,//黑色日式花苞头
41670,//黑色天堂之翼发型
41660,//黑色超长双马尾女发型
41650,//黑色泉奈发型
41640,//黑色竹野子发型
41600,//黑色麻花长波浪
41590,//黑色暖暖棉花糖发型
41580,//黑色城堡公主发型
41570,//黑色春天的精灵发型
41560,//검은색 알리샤 헤어
41550,//黑色呆毛萌萌双发辫
41540,//黑色青春学生妹发型
41520,//名称:黑色光与影发型
41510,//黑色幽灵怪盗发型
41490,//黑色被遗忘的英雄隐月发型
41480,//黑色驯龙高手发型
41470,//丝绸发型
41460,//黑色俏皮小野猫发型
41440,//黑色熏香发型
41430,//黑色摇滚灵魂发型
41420,//黑色女神长发
41410,//黑色不对称发型
41400,//黑色扭扭高马尾发型
41390,//白色烟熏狂野发型
41380,//黑色狂战士发型
41370,//黑色精灵女王发型
41360,//黑色布莱尔夫人发型
41350,//검은색 땋은별 헤어
41340,//黑色闪烁之星发型
41220,//黑色朴素发型
41210,//검은색 티아라 헤어
41200,//黑色优雅波浪长发
41190,//黑色清纯束发
41160,//黑色爱丽丝发型
41150,//黑色尤娜发型
41070,//黑色干练发型
41080,//黑色轻盈少女马尾
41060,//黑色自由发型
41377,//褐色精灵女王发型
41390,//白色烟熏狂野发型
41440,//黑色熏香发型
41460,//黑色俏皮小野猫发型
41470,//丝绸发型
41420,//黑色女神长发
41430,//黑色摇滚灵魂发型
41220,//黑色朴素发型
41340,//黑色闪烁之星发型
41600,//黑色麻花长波浪
41650,//黑色泉奈发型
41660,//黑色超长双马尾女发型
41640,//黑色竹野子发型
41690,//黑色斜刘海魅惑卷发
41680,//黑色日式花苞头
41670,//黑色天堂之翼发型
41660,//黑色超长双马尾女发型
41720,//黑色琉璃波浪卷发型
41710,//黑色清新小卷毛发型
41700,//黑色酸奶奶昔发型
41490,//黑色被遗忘的英雄隐月发型
41470,// 41476丝绸发型
41480,// 41480黑色驯龙高手发型
41520,// 41520黑色光与影发型
41510,// 41510黑色幽灵怪盗发型
41555,// 41555蓝色呆毛萌萌双发辫
41560,// 41560검은색 알리샤 헤어
41540,// 41540黑色青春学生妹发型
41585,// 41585蓝色城堡公主发型
41593,// 41593黄色暖暖棉花糖发型
41570,// 41570黑色春天的精灵发型
41580,// 41580黑色城堡公主发型
41576,// 41576紫色春天的精灵发型
41870,// 41870黑色精灵鼠女发型
41860,// 41860黑色噩梦女王发型
41880,// 41880黑色星缘发型
41900,// 41900黑色编发双马尾发型
41890,// 41890黑色蝶梦发型
41916,// 41916紫色叛逆少女发型
41930,// 41930黑色至爱发型
41920,// 41920黑色扭辫发型
41950,// 41950黑色小辣椒发型-女
41940,// 41940검은색 16F/W트렌드헤어
41936,// 41936紫色至爱发型
41980,// 41980黑色天然卷发型
41970,// 41970黑色清秀短发
41730,// 41730黑色俏皮短波浪发型
41740,// 41740黑色月下佳人发型
41750,// 41750黑色可爱学生妹发型
41760,// 41760黑色万事屋发型
41770,// 41770黑色两小无猜发型
41800,// 41800黑色萝莉斜马尾发型
41810,// 41810黑色NPC栗子糕发型
41820,// 41820黑色NPC布丁发型
41830,// 41830黑色NPC泡芙发型
41840,// 41840黑色NPC派发型
41850,// 41850黑色彩铃发型
44140,// 44140黑色妖精维英发型
44130,// 44130黑色滚滚发型
44150,// 44150黑色天使发型
44110,// 44110黑色拟真机器人金吉发型
44100,// 44100黑色拟真机器人布仑兹发型
44120// 44120黑色星云发型
];
			}
				
                for (var i = 0; i < hair_Colo_new.length; i++) {
                    hair_Colo_new[i] = hair_Colo_new[i] + (hair % 10);
                }
                cm.askAvatar("我能把您现在的头发换个全新的发型。您对现在的发型不厌倦吗？只要您有#b#t5150052##k，我就帮您换发型。慢慢挑选您想要的发型吧！", hair_Colo_new, 5150052);
            } 
            break;
        case 2:
            if (beauty == 1) {
                if (cm.setAvatar(5150052, hair_Colo_new[selection]) == 1) {
					cm.dispose();
                    //cm.sendOk("好了，让朋友们赞叹您的新发型吧！");
					cm.playerMessage(1,"好了，让朋友们赞叹您的新发色吧！");
					card = 1;
                } else {
					if (cm.getChar().getCSPoints(1) >= 980) {
					ct = 1;
					}
					if (cm.getChar().getCSPoints(2) >= 980) {
					ct = 2;
					}
					if (ct != -1) {
					cm.gainNX(ct, -980);
					cm.gainItem(5150052, 1);
					//cm.sendOk("你好像没有足够的点卷/抵用卷!");
					//cm.playerMessage(1, "你好像没有足够的点卷/抵用卷!");
					} else {
						beauty = -1;
					}
					action(mode, type, selection);
                    //cm.sendOk("嗯……您好像没有#b#t5150052##k啊？不好意思，没有会员卡的话，我不能帮您美发。");
                }
            } 
            break;
		case 3:
            if (card == 0) {
                if (cm.getPlayer().getCSPoints(1) >= 980) {
                    if (cm.setRandomAvatar(hair_Colo_new) == 1) {
                        cm.getPlayer().modifyCSPoints(1, -980);
                        if (beauty == 1) {
							cm.dispose();
                            cm.playerMessage(1,"好了，让朋友们赞叹您的新发型吧！");
							card = 1;
                        } 
                    }
                }else {
					cm.dispose();
                    //cm.sendOk("你好像没有足够的点卷/抵用卷!");
					cm.playerMessage(1,"你好像没有足够的点卷/抵用卷！");
					card = 1;
                }
            }
            cm.dispose();
            break;
        default:
            cm.dispose();
            break;
    }
}