/*
 * BOSS奖励结算
 * @author 娜娜
 */
var status = -1;

  var item = Array(1082695,1004809,1004808,1004811,1442274,1004810,1082697,1004812,1082696,1332279,1082699,1082698,1102944,1342104,1232113,1362140,1242122,1242121,1302343,1053065,1053064,1053067,1053066,1582023,1252098,1152200,1492235,1152198,1152199,1152196,1552119,1152197,1102943,1102942,1102941,1053063,1102940,1302219,1402259,1412181,1452257,1312203,1362063,1432218,1222113,1322255,1073159,1073158,1522143,1532150,1073161,1073160,1142505,1073162,1472265,1382265,1322156,1262039,1422189,1462243,1482221,1542117,1372228,1212120); //传说系列装备

function action(mode, type, selection) {
    status++;
    switch (cm.getMapId()) {
        case 800024500: // 01
            var i = -1;
			cm.gainNX(1,10000);
            cm.dispose();
			cm.openNpc(9900003, "Spring");
            break;
        case 807100000: // 02
            break;
		case 450009400://至暗魔晶-普通
			cm.gainItem(2432069, 1);//暴君防具箱
			cm.gainItem(2432069, 1);//埃苏莱布斯武器箱
			break;
		case 450013750://威尔
			cm.gainItem(2432069, 1);//暴君防具箱
			cm.gainItem(2432069, 1);//埃苏莱布斯武器箱
			cm.gainItem(2433015, 1);//威尔专用箱
			break;
        default:
			//cm.gainNX(1,10000);
			//cm.gainItem(4310143, 20);
			//cm.warp(910000000,0);
            //cm.dispose();
			break;
    }
	cm.gainItem(2430051, 1);//玩具
	cm.gainItem(2430069, 1);//玩具
	cm.gainNX(1,10000);
	cm.gainItem(4310143, 20);//BOOS币
	cm.warp(910000000,0);
    cm.dispose();
}