/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array(" 夏日花朵",3010123, 10000),
Array(" 摇滚之魂椅子",3010116, 10000),
Array(" 魔法书椅子",3010117, 10000),
Array(" 糖果音符椅子",3010118, 10000),
Array(" 羊羊椅子",3010119, 10000),
Array(" 情书柜子",3010112, 10000),
Array(" 幽魂发条熊椅子",3010113, 10000),
Array(" 俘虏我吧！椅子",3010114, 10000),
Array(" 熊宝宝床",3010115, 10000),
Array(" 蛋糕椅子",3010141, 10000),
Array(" 早日康复床",3010140, 10000),
Array(" 水族馆椅子",3010142, 10000),
Array(" 神龙椅子",3010137, 10000),
Array(" 6周年怪物王座",3010136, 10000),
Array(" 私密空间",3010139, 10000),
Array(" 君主休憩椅",3010138, 10000),
Array(" 帐篷椅",3010133, 10000),
Array(" 撒娇喵咪椅",3010132, 10000),
Array(" 节日独角兽椅子",3010135, 10000),
Array(" 枫叶纪念凳",3010134, 10000),
Array(" 酋长宝座",3010129, 10000),
Array(" 黑龙王座",3010128, 10000),
Array(" 贪吃熊猫椅",3010131, 10000),
Array(" 血色玫瑰",3010130, 10000),
Array(" 浮游飞行器",3010156, 10000),
Array(" 家族椅子",3010157, 10000),
Array(" 机械椅子",3010154, 10000),
Array(" 暗影双刀的猫头鹰椅子",3010155, 10000),
Array(" 黄三角帐篷椅",3010152, 10000),
Array(" 无人岛椅子",3010151, 10000),
Array(" 猫咪风扇椅",3010149, 10000),
Array(" 周年庆水晶枫叶椅子",3010146, 10000),
Array(" 龙龙的蛋壳椅",3010147, 10000),
Array(" 七夕椅子",3010144, 10000),
Array(" 周年庆水晶枫叶椅子",3010145, 10000),
Array(" 名画家椅子",3010175, 10000),
Array(" 女巫炼药椅",3010174, 10000),
Array(" 万圣节塔罗椅子",3010173, 10000),
Array(" 星空椅子",3010172, 10000),
Array(" 过来抱抱椅",3010171, 10000),
Array(" 雪夜椅子",3010170, 10000),
Array(" 纸箱里“求领养”",3010169, 10000),
Array(" 友谊万岁椅子",3010168, 10000),
Array(" 豪华鲜奶蛋糕",3010167, 10000),
Array(" 双刀同门",3010166, 10000),
Array(" 满月椅(永久) ",3010164, 10000),
Array(" 满月椅 ",3010163, 10000),
Array(" 果月椅子",3010162, 10000),
Array(" 鼠鼠椅 ",3010161, 10000),
Array(" 血色玫瑰",3010057, 10000),
Array(" 世界末日",3010058, 10000),
Array(" 甜甜的零食王座",3010059, 10000),
Array(" 初心凳",3010060, 10000),
Array(" 枫树下",3010061, 10000),
Array(" 竹凳",3010062, 10000),
Array(" 月亮星星抱枕椅",3010063, 10000),
Array(" 圣诞树椅子",3010048, 10000),
Array(" 雪房子",3010049, 10000),
Array(" 公主凳",3010050, 10000),
Array(" 沙漠兔子1靠垫",3010051, 10000),
Array(" 沙漠兔子2靠垫",3010052, 10000),
Array(" 兔子纪念版椅子",3010053, 10000),
Array(" 呼噜呼噜床",3010054, 10000),
Array(" 冰雪糕丸子椅",3010055, 10000),
Array(" baby品克缤",3010073, 10000),
Array(" 我为音乐狂",3010075, 10000),
Array(" 猫头鹰椅子",3010077, 10000),
Array(" 肥猫猫椅子",3010079, 10000),
Array(" 大熊猫椅子",3010078, 10000),
Array(" 粉红海滩遮阳椅",3010065, 10000),
Array(" 棕色砂兔抱枕椅",3010064, 10000),
Array(" 红色设计师椅",3010067, 10000),
Array(" 深蓝色绒毛沙发",3010066, 10000),
Array(" 大黄风",3010069, 10000),
Array(" 露水椅子",3010068, 10000),
Array(" 神兽椅",3010071, 10000),
Array(" 巨无霸品克缤",3010070, 10000),
Array(" 漂漂猪椅子",3010094, 10000),
Array(" 石头人座椅",3010095, 10000),
Array(" 魔女的飞扫把",3010092, 10000),
Array(" 鲜美的火鸡",3010093, 10000),
Array(" 蓝帽月妙抱枕椅",3010082, 10000),
Array(" 扇子月妙抱枕椅",3010083, 10000),
Array(" 柿子树鞦韆",3010080, 10000),
Array(" 红帽月妙抱枕椅",3010081, 10000),
Array(" 梦境沙发",3010086, 10000),
Array(" 太平萧月妙抱枕椅",3010084, 10000),
Array(" 鬼娃娃椅子",3010085, 10000),
Array(" 龙龙的蛋壳椅",3010107, 10000),
Array(" 雪狼战椅",3010106, 10000),
Array(" 花蘑菇充电椅-3阶段",3010104, 10000),
Array(" 虎虎生威",3010111, 10000),
Array(" 舒适大白熊椅子",3010110, 10000),
Array(" 暖炉椅",3010109, 10000),
Array(" 幼龙秋千",3010108, 10000),
Array(" 北极熊椅子",3010099, 10000),
Array(" 电视宅人",3010098, 10000),
Array(" 坚固的木椅",3010097, 10000),
Array(" 恐龙化石宝座",3010096, 10000),
Array(" 花蘑菇充电椅-2阶段 ",3010103, 10000),
Array(" 花蘑菇充电椅-1阶段",3010102, 10000),
Array(" 财神椅子",3010100, 10000),
Array(" 黄环凳",3010032, 10000),
Array(" 绿环凳",3010033, 10000),
Array(" 悠长假期(红色)",3010034, 10000),
Array(" 悠长假期(蓝色)",3010035, 10000),
Array(" 浪漫秋千",3010036, 10000),
Array(" 猪猪凳",3010037, 10000),
Array(" 空气沙发",3010038, 10000),
Array(" 黑色海狗靠垫",3010039, 10000),
Array(" 蝙蝠椅",3010040, 10000),
Array(" 骷髅王座",3010041, 10000),
Array(" 魔女的飞扫把",3010043, 10000),
Array(" 同一红伞下",3010044, 10000),
Array(" 寒冰椅子",3010045, 10000),
Array(" 红龙椅",3010046, 10000),
Array(" 蓝龙椅",3010047, 10000),
Array(" 金色海豹靠垫",3010017, 10000),
Array(" 黑色海豹靠垫",3010016, 10000),
Array(" 寿司椅",3010019, 10000),
Array(" 椰子树沙滩椅",3010018, 10000),
Array(" 暖暖桌",3010021, 10000),
Array(" 5周年枫叶纪念凳",3010025, 10000),
Array(" 玩具粉熊椅",3010024, 10000),
Array(" 恶灵附身的娃娃椅子",3010026, 10000),
Array(" 蓝环凳",3010029, 10000),
Array(" 海盗的俘虏",3010028, 10000),
Array(" 红环凳",3010031, 10000),
Array(" 黑环凳",3010030, 10000),
Array(" 绿色时尚转椅",3010002, 10000),
Array(" 红色时尚转椅",3010003, 10000),
Array(" 黄色时尚转椅",3010006, 10000),
Array(" 粉色海豹靠垫",3010007, 10000),
Array(" 黄蓝休闲椅",3010004, 10000),
Array(" 红蓝休闲椅",3010005, 10000),
Array(" 白色海豹靠垫",3010010, 10000),
Array(" 神兵领域放松椅",3010011, 10000),
Array(" 蓝色海豹靠垫",3010008, 10000),
Array(" 榻榻凳",3010009, 10000),
Array(" 月亮弯",3010014, 10000),
Array(" 战士王座",3010012, 10000),
Array(" 粉红海滩遮阳椅",3010013, 10000),
Array(" 甜蜜蛋糕屋情侣椅子 ",3012032, 10000),
Array(" ",3012033, 10000),
Array(" 风吹稻香",3012006, 10000),
Array(" 石狮椅子",3012007, 10000),
Array(" 篝火",3012001, 10000),
Array(" 浴桶",3012002, 10000),
Array(" 爱心椅子",3012003, 10000),
Array(" 稻荷神社椅子",3012008, 10000),
Array(" 梦幻雪晶球",3012009, 10000),
Array(" 巧克力蛋糕恋人",3012010, 10000),
Array(" 我爱巧克力火锅",3012011, 10000),
Array(" 彩虹云朵椅子",3012021, 10000),
Array(" 紫藤花吊篮椅",3012020, 10000),
Array(" mPhone椅子",3012023, 10000),
Array(" 寿司小火车椅子",3012022, 10000),
Array(" 巧克力奶酪椅子",3012017, 10000),
Array(" 情侣糖果椅子",3012016, 10000),
Array(" 爱琴海椅子",3012019, 10000),
Array(" 萌萌育婴摇篮",3012018, 10000),
Array(" 萌宠下午茶杯椅子",3012028, 10000),
Array(" 猴子恋人椅",3012031, 10000),
Array(" 和你在一起椅子",3012030, 10000),
Array(" 小鸡弹簧床椅子",3012025, 10000),
Array(" 沙滩排球椅子",3012024, 10000),
Array(" 羊羊热气球椅子",3012027, 10000),
Array(" 旋转花茶杯情侣椅子",3012026, 10000),
Array(" 兔子椅子",3010580, 10000),
Array(" 黑暗龙王椅子",3010581, 10000),
Array(" 北极熊椅子",3010582, 10000),
Array(" 蛇椅子",3010583, 10000),
Array(" 热情的红色药水椅子",3010576, 10000),
Array(" 新鲜的蓝色药水椅子",3010577, 10000),
Array(" 和克里姆共享下午茶",3010578, 10000),
Array(" 和谢拉共享下午茶",3010579, 10000),
Array(" 需要充电！",3010589, 10000),
Array(" 酸甜点心椅子",3010590, 10000),
Array(" 漫画书椅子",3010591, 10000),
Array(" 圣诞节幻影椅",3010584, 10000),
Array(" 尖兵椅子",3010585, 10000),
Array(" 发财椅",3010586, 10000),
Array(" 时间胶囊",3010587, 10000),
Array(" 我的女皇椅子",3010565, 10000),
Array(" 阿卡伊勒童话书椅子",3010564, 10000),
Array(" 埃欧雷的小型音乐会",3010567, 10000),
Array(" 生日快乐，恶魔",3010566, 10000),
Array(" 扎昆的帝王椅子",3010561, 10000),
Array(" 儿童秋千",3010560, 10000),
Array(" 月亮星星靠垫",3010563, 10000),
Array(" 痊愈10周椅子",3010562, 10000),
Array(" 云朵洗手间椅子",3010573, 10000),
Array(" 艾莉珍椅子",3010572, 10000),
Array(" 奥妙的超级药水椅子",3010575, 10000),
Array(" 闪耀星星之夜椅子",3010574, 10000),
Array(" 摆钟椅子",3010569, 10000),
Array(" 希拉的美容时间",3010568, 10000),
Array(" 蘑菇朋友椅子",3010571, 10000),
Array(" 迷你神兽椅子",3010570, 10000),
Array(" 锵锵锵椅子",3010612, 10000),
Array(" 蛋糕店椅子",3010613, 10000),
Array(" 救救我，奥利维亚！",3010611, 10000),
Array(" 完美的名画椅子",3010608, 10000),
Array(" 不是在做梦",3010609, 10000),
Array(" 我的好友丹珍之椅",3010622, 10000),
Array(" 我的好友纳奥之椅",3010623, 10000),
Array(" 怪蜀黍的泄愤桌",3010620, 10000),
Array(" 蛤蛤仙人椅",3010621, 10000),
Array(" 侦探打字机椅子",3010599, 10000),
Array(" 福袋椅子",3010598, 10000),
Array(" 尤茨游戏月妙坐垫",3010597, 10000),
Array(" 放风筝坐垫",3010596, 10000),
Array(" 蓝莓蛋糕椅",3010594, 10000),
Array(" 新年快乐~",3010593, 10000),
Array(" 布莱克缤椅子",3010592, 10000),
Array(" 未上色的名画椅子",3010606, 10000),
Array(" 雏祭娃娃3",3010605, 10000),
Array(" 雏祭娃娃2",3010604, 10000),
Array(" 雏祭娃娃1",3010603, 10000),
Array(" 猫咪竹篮椅",3010601, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖4号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖4号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
