/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array("草莓星的主人",3015516, 10000),
Array("水晶球椅子",3015517, 10000),
Array("鱼尾狮公园椅子",3015495, 10000),
Array("塞维利亚西班牙广场椅子",3015494, 10000),
Array("I want you椅子",3015493, 10000),
Array("轻功箱椅子",3015481, 10000),
Array("沉睡的鸭子椅子",3015482, 10000),
Array("情侣部队铜像椅子",3015476, 10000),
Array("再睡10分钟椅子",3015472, 10000),
Array("摇摆种子椅子",3015473, 10000),
Array("花田窗户",3015474, 10000),
Array("单身部队铜像椅子",3015475, 10000),
Array("超越石椅子",3015468, 10000),
Array("孤独旅行者椅子",3015461, 10000),
Array("淑女青鸟花园",3015463, 10000),
Array("绅士青鸟花园",3015462, 10000),
Array("黑暗追随者",3015450, 10000),
Array("呆萌兔兔靠垫椅",3015451, 10000),
Array("解除怨恨椅子",3015448, 10000),
Array("守护战士",3015449, 10000),
Array("怪物捕捉器椅子",3015447, 10000),
Array("打倒小羊驼椅子",3015443, 10000),
Array("钱多多椅子",3015440, 10000),
Array("木偶戏椅子",3015439, 10000),
Array("阿布拉克萨斯椅子",3015438, 10000),
Array("被吞没的世界树椅子",3015437, 10000),
Array("竹野子相伴椅子",3015436, 10000),
Array("哈萨尔的钓鱼椅子",3015435, 10000),
Array("冬眠",3015434, 10000),
Array("冰雪企鹅王",3015433, 10000),
Array("温暖热茶椅子",3015432, 10000),
Array("冒险岛电动车椅子",3015431, 10000),
Array("年兽椅子",3015430, 10000),
Array("享受冬季的秋千椅子",3015429, 10000),
Array("和猴子一起放烟花椅子",3015428, 10000),
Array("和猴子一起玩麻将椅子",3015427, 10000),
Array("和猴子一起面具舞椅子",3015426, 10000),
Array("和猴子一起击鼓椅子",3015425, 10000),
Array("超级饺子椅子",3015424, 10000),
Array("少女的枕头大战",3015120, 10000),
Array("夏日沁饮椅子",3015135, 10000),
Array("泡泡浴椅子",3015134, 10000),
Array("亚敏下午茶椅",3015133, 10000),
Array("大粽子沙发椅",3015132, 10000),
Array("巨大鼻涕泡椅子",3015131, 10000),
Array("土豪婴儿推车",3015130, 10000),
Array("白色天堂椅子",3015129, 10000),
Array("青蛙飓风飞椅",3015111, 10000),
Array("花花幻想曲",3015109, 10000),
Array("罗曼蒂克天文台",3015106, 10000),
Array("情侣部队海报椅（男）",3015107, 10000),
Array("希拉和麦格纳斯",3015118, 10000),
Array("突击！伊莉娜乐队椅子",3015119, 10000),
Array("利琳的知己",3015116, 10000),
Array("白色实习老师的特讲",3015117, 10000),
Array("情侣部队海报椅（女）",3015114, 10000),
Array("赫丽娜的每日教室",3015115, 10000),
Array("炸鸡之梦椅子",3015112, 10000),
Array("安德洛墨达椅子",3015157, 10000),
Array("??? ?? ??",3015156, 10000),
Array("12周年冒险岛冰淇淋椅子",3015159, 10000),
Array("噜噜啦啦印第安小孩",3015158, 10000),
Array("火焰之斯乌椅子",3015155, 10000),
Array("停止支招！椅子",3015167, 10000),
Array("12周年冒险岛冰淇淋椅子",3015161, 10000),
Array("嘭嘭！品克缤椅子",3015160, 10000),
Array("和克里姆共享下午茶",3015140, 10000),
Array("武士精神椅子",3015142, 10000),
Array("巨大彩色金鱼标本椅子",3015143, 10000),
Array("蛋糕椅子",3015136, 10000),
Array("水果椅子",3015137, 10000),
Array("酸甜点心椅子",3015138, 10000),
Array("和谢拉共享下午茶",3015139, 10000),
Array("我为音乐狂",3015148, 10000),
Array("夏日花朵",3015149, 10000),
Array("熟睡鸭子椅",3015150, 10000),
Array("贵族的花船椅子",3015144, 10000),
Array("印第安酋长宝座",3015146, 10000),
Array("寿司椅",3015147, 10000),
Array("浪漫甜心巧克力椅子",3015059, 10000),
Array("五彩缤纷花车巡游椅",3015058, 10000),
Array("烟花绽放椅子",3015057, 10000),
Array("死亡骑士椅",3015056, 10000),
Array("NENE炸鸡翅椅",3015063, 10000),
Array("NENE炸鸡翅椅",3015062, 10000),
Array("单身情侣椅",3015061, 10000),
Array("五彩糖罐椅子",3015060, 10000),
Array("冰雪箱椅子",3015064, 10000),
Array("小企鹅合唱团",3015042, 10000),
Array("宝石枫叶椅子",3015043, 10000),
Array("舒适大白熊椅子",3015041, 10000),
Array("传说中的狮兽椅子",3015046, 10000),
Array("压岁钱万岁！",3015047, 10000),
Array("巨大企鹅王椅子",3015044, 10000),
Array("羊绒咩咩椅子",3015045, 10000),
Array("火车头椅",3015050, 10000),
Array("巨无霸国际巨星",3015051, 10000),
Array("碧欧蕾塔莎啦啦火车椅",3015048, 10000),
Array("黑色天堂火车椅",3015049, 10000),
Array("爱之骑士椅",3015054, 10000),
Array("血腥玛丽椅",3015055, 10000),
Array("松软三重绵羊椅",3015053, 10000),
Array("训练师庭院椅",3015089, 10000),
Array("元宵烟花椅",3015088, 10000),
Array("巧克力汤椅子",3015091, 10000),
Array("单身之王椅",3015090, 10000),
Array("烟花绽放椅子",3015093, 10000),
Array("卡卡隆与巧克力工厂椅",3015092, 10000),
Array("鲤鱼椅",3015097, 10000),
Array("羊羊幻想牧场椅子",3015096, 10000),
Array("扎纳罗非伪装椅子",3015099, 10000),
Array("花蘑菇伪装椅子",3015098, 10000),
Array("奥尔卡的布偶兔椅子",3015100, 10000),
Array("铲雪狂人椅子",3015075, 10000),
Array("雏祭娃娃4",3015076, 10000),
Array("雏祭娃娃5",3015077, 10000),
Array("雏祭娃娃6",3015078, 10000),
Array("被蛋卷椅子",3015080, 10000),
Array("雪屋",3015081, 10000),
Array("情人节爱心椅",3015082, 10000),
Array("萌动年糕汤火车椅",3015083, 10000),
Array("爱之骑士椅",3015084, 10000),
Array("血腥玛丽椅",3015085, 10000),
Array("死亡骑士椅",3015086, 10000),
Array("家庭聚餐椅子",3015087, 10000),
Array("圣诞礼物椅",3015006, 10000),
Array("花蘑菇的圣诞节",3015007, 10000),
Array("维丽尔枕头椅",3015004, 10000),
Array("七彩摩天轮",3015002, 10000),
Array("永恒斯乌枕头椅",3015003, 10000),
Array("玻璃瓶里的怪物",3015000, 10000),
Array("淘气喵喵椅",3015001, 10000),
Array(" 圣诞节椅子 ",3015036, 10000),
Array("圣诞花环椅子",3015037, 10000),
Array("寒冰萌动火车椅",3015032, 10000),
Array("福袋萌动火车椅",3015033, 10000),
Array("和羊咩咩一起椅子",3015034, 10000),
Array("灯泡里的人鱼",3015028, 10000),
Array("宇宙冲撞椅",3015029, 10000),
Array("与南哈特的回忆椅",3015030, 10000),
Array("闪耀冒险岛椅",3015031, 10000),
Array("射手座椅子",3015024, 10000),
Array("山羊座椅子",3015025, 10000),
Array("水瓶座椅子",3015026, 10000),
Array("安德洛墨达椅子",3015027, 10000),
Array("天秤座椅子",3015021, 10000),
Array("狮子座椅子",3015020, 10000),
Array("处女座椅子",3015023, 10000),
Array("天蝎座椅子",3015022, 10000),
Array("双鱼座椅子",3015017, 10000),
Array("金牛座椅子",3015016, 10000),
Array("巨蟹座椅子",3015019, 10000),
Array("双子座椅子",3015018, 10000),
Array("立体机动训练中！",3015013, 10000),
Array("萨莎、阿明与熟土豆",3015012, 10000),
Array("白羊座椅子",3015015, 10000),
Array("千钧一发！",3015014, 10000),
Array("小苹果椅子",3015009, 10000),
Array("献出心脏的敬礼",3015008, 10000),
Array("与儿时伙伴同在",3015011, 10000),
Array("西甘锡纳地区沦陷",3015010, 10000),
Array(" 印第安元老的兄弟",3010518, 10000),
Array(" 巨大白雪人椅子",3010519, 10000),
Array(" 噜噜啦啦印第安小孩",3010516, 10000),
Array(" 印第安小孩的朋友",3010517, 10000),
Array(" 可怕的女王",3010514, 10000),
Array(" 奇石椅子",3010515, 10000),
Array(" 和半半在一起",3010512, 10000),
Array(" 开心的皮埃尔",3010513, 10000),
Array(" 白鹳飞行员椅子",3010526, 10000),
Array(" 深海章鱼",3010527, 10000),
Array(" 威尔士柯基犬椅子",3010524, 10000),
Array(" 猫头鹰椅子",3010525, 10000),
Array(" 兔子旋风",3010522, 10000),
Array(" 白云漫步椅",3010523, 10000),
Array(" 巨大企鹅王椅子",3010520, 10000),
Array(" 水晶椅",3010521, 10000),
Array(" 泡泡浴椅子",3010503, 10000),
Array(" 寻找故乡的月妙椅子",3010502, 10000),
Array(" 万圣节南瓜椅",3010501, 10000),
Array(" 云朵洗手间椅子",3010500, 10000),
Array(" 僵尸猎人座椅",3010499, 10000),
Array(" 猫咪公园椅子",3010511, 10000),
Array(" 猫咪针线篮椅子",3010510, 10000),
Array(" 白银VIP的祝福",3010509, 10000),
Array(" 黄金VIP的祝福",3010508, 10000),
Array(" 钻石VIP的祝福",3010507, 10000),
Array(" 万圣节南瓜椅",3010506, 10000),
Array(" 和奥尔卡一起看棒球",3010505, 10000),
Array(" 儿童秋千",3010504, 10000),
Array(" 可爱音符椅子",3010548, 10000),
Array(" 羊羔椅子",3010549, 10000),
Array(" 寻找故乡的月妙椅子",3010550, 10000),
Array(" 邪恶之毒椅子",3010551, 10000),
Array(" 热带夏日椅子",3010544, 10000),
Array(" 千年狐椅子",3010545, 10000),
Array(" 邪恶黑龙椅子",3010546, 10000),
Array(" 魔法之书",3010547, 10000),
Array(" 皮肤皇后椅子",3010556, 10000),
Array(" 睡觉小鸟椅子",3010557, 10000),
Array(" 泡泡浴椅子",3010558, 10000),
Array(" 龙蛋",3010559, 10000),
Array(" 喵喵的免费拥抱",3010552, 10000),
Array(" 邪恶羊椅子",3010553, 10000),
Array(" 粉色手柄",3010554, 10000),
Array(" 深夜猫头鹰",3010555, 10000),
Array(" 椰子树沙滩椅",3010533, 10000),
Array(" 蓝色木椅",3010532, 10000),
Array(" 海蓝天鹅绒沙发",3010535, 10000),
Array(" 公沙沙兔靠垫",3010534, 10000),
Array(" 跑步机椅子",3010528, 10000),
Array(" 小企鹅合唱团",3010531, 10000),
Array(" 埃欧雷的小型音乐会",3010530, 10000),
Array(" 发财椅",3010541, 10000),
Array(" 蓝色龙椅",3010540, 10000),
Array(" 魔力品克缤",3010543, 10000),
Array(" 夏日喵喵椅",3010542, 10000),
Array(" 恶灵附身的娃娃椅子",3010537, 10000),
Array(" 红色设计师椅子",3010536, 10000),
Array(" 红色龙椅",3010539, 10000),
Array(" 机械椅",3010538, 10000),
Array(" 艾莉珍椅子",3010450, 10000),
Array(" 龙蛋",3010451, 10000),
Array(" 泡泡浴椅子",3010448, 10000),
Array(" 痊愈10周椅子",3010449, 10000),
Array(" 爱心云朵椅",3010454, 10000),
Array(" 扎昆的帝王椅子",3010455, 10000),
Array(" 儿童秋千",3010452, 10000),
Array(" 兔子乘风椅",3010453, 10000),
Array(" 翻滚兔子椅子",3010458, 10000),
Array(" 天使舞台椅",3010459, 10000),
Array(" 杜鹃花椅子",3010456, 10000),
Array(" 拉尼娅野餐椅",3010457, 10000),
Array(" 罗曼蒂克天文台",3010462, 10000),
Array(" 爆竹椅子",3010460, 10000),
Array(" 赏月专用月桂树秋千椅",3010461, 10000),
Array(" 千年狐椅子",3010435, 10000),
Array(" 热带夏日椅子",3010434, 10000),
Array(" 魔力品克缤",3010433, 10000),
Array(" 仲夏可可岛",3010432, 10000),
Array(" 羊羔椅子",3010439, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖3号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖3号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
