/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array("印第安元老的兄弟",3010518, 10000),
Array("巨大白雪人椅子",3010519, 10000),
Array("噜噜啦啦印第安小孩",3010516, 10000),
Array("印第安小孩的朋友",3010517, 10000),
Array("可怕的女王",3010514, 10000),
Array("奇石椅子",3010515, 10000),
Array("和半半在一起",3010512, 10000),
Array("开心的皮埃尔",3010513, 10000),
Array("白鹳飞行员椅子",3010526, 10000),
Array("深海章鱼",3010527, 10000),
Array("威尔士柯基犬椅子",3010524, 10000),
Array("猫头鹰椅子",3010525, 10000),
Array("兔子旋风",3010522, 10000),
Array("白云漫步椅",3010523, 10000),
Array("巨大企鹅王椅子",3010520, 10000),
Array("水晶椅",3010521, 10000),
Array("泡泡浴椅子",3010503, 10000),
Array("寻找故乡的月妙椅子",3010502, 10000),
Array("万圣节南瓜椅",3010501, 10000),
Array("云朵洗手间椅子",3010500, 10000),
Array("僵尸猎人座椅",3010499, 10000),
Array("猫咪公园椅子",3010511, 10000),
Array("猫咪针线篮椅子",3010510, 10000),
Array("白银VIP的祝福",3010509, 10000),
Array("黄金VIP的祝福",3010508, 10000),
Array("钻石VIP的祝福",3010507, 10000),
Array("万圣节南瓜椅",3010506, 10000),
Array("和奥尔卡一起看棒球",3010505, 10000),
Array("儿童秋千",3010504, 10000),
Array("可爱音符椅子",3010548, 10000),
Array("羊羔椅子",3010549, 10000),
Array("寻找故乡的月妙椅子",3010550, 10000),
Array("邪恶之毒椅子",3010551, 10000),
Array("热带夏日椅子",3010544, 10000),
Array("千年狐椅子",3010545, 10000),
Array("邪恶黑龙椅子",3010546, 10000),
Array("魔法之书",3010547, 10000),
Array("皮肤皇后椅子",3010556, 10000),
Array("睡觉小鸟椅子",3010557, 10000),
Array("泡泡浴椅子",3010558, 10000),
Array("龙蛋",3010559, 10000),
Array("喵喵的免费拥抱",3010552, 10000),
Array("邪恶羊椅子",3010553, 10000),
Array("粉色手柄",3010554, 10000),
Array("深夜猫头鹰",3010555, 10000),
Array("椰子树沙滩椅",3010533, 10000),
Array("蓝色木椅",3010532, 10000),
Array("海蓝天鹅绒沙发",3010535, 10000),
Array("公沙沙兔靠垫",3010534, 10000),
Array("跑步机椅子",3010528, 10000),
Array("小企鹅合唱团",3010531, 10000),
Array("埃欧雷的小型音乐会",3010530, 10000),
Array("发财椅",3010541, 10000),
Array("蓝色龙椅",3010540, 10000),
Array("魔力品克缤",3010543, 10000),
Array("夏日喵喵椅",3010542, 10000),
Array("恶灵附身的娃娃椅子",3010537, 10000),
Array("红色设计师椅子",3010536, 10000),
Array("红色龙椅",3010539, 10000),
Array("机械椅",3010538, 10000),
Array("艾莉珍椅子",3010450, 10000),
Array("龙蛋",3010451, 10000),
Array("泡泡浴椅子",3010448, 10000),
Array("痊愈10周椅子",3010449, 10000),
Array("爱心云朵椅",3010454, 10000),
Array("扎昆的帝王椅子",3010455, 10000),
Array("儿童秋千",3010452, 10000),
Array("兔子乘风椅",3010453, 10000),
Array("翻滚兔子椅子",3010458, 10000),
Array("天使舞台椅",3010459, 10000),
Array("杜鹃花椅子",3010456, 10000),
Array("拉尼娅野餐椅",3010457, 10000),
Array("罗曼蒂克天文台",3010462, 10000),
Array("爆竹椅子",3010460, 10000),
Array("赏月专用月桂树秋千椅",3010461, 10000),
Array("千年狐椅子",3010435, 10000),
Array("热带夏日椅子",3010434, 10000),
Array("魔力品克缤",3010433, 10000),
Array("仲夏可可岛",3010432, 10000),
Array("羊羔椅子",3010439, 10000),
Array("可爱音符椅子",3010438, 10000),
Array("魔法之书",3010437, 10000),
Array("邪恶黑龙椅子",3010436, 10000),
Array("邪恶羊椅子",3010443, 10000),
Array("喵喵的免费拥抱",3010442, 10000),
Array("邪恶之毒椅子",3010441, 10000),
Array("寻找故乡的月妙椅子",3010440, 10000),
Array("睡觉小鸟椅子",3010447, 10000),
Array("皮肤皇后椅子",3010446, 10000),
Array("深夜猫头鹰",3010445, 10000),
Array("粉色手柄",3010444, 10000),
Array("红色大象总统椅子",3010490, 10000),
Array("蓝色毛驴总统椅子",3010491, 10000),
Array("首脑椅子",3010492, 10000),
Array("那就是我！",3010493, 10000),
Array("TV椅子",3010494, 10000),
Array("大红灯笼椅",3010495, 10000),
Array("可爱音符椅子",3010465, 10000),
Array("魔法之书",3010464, 10000),
Array("高级冒险家旗帜椅子",3010397, 10000),
Array("高级冒险家旗帜椅子",3010390, 10000),
Array("冒险家的旗帜椅子",3010383, 10000),
Array("热情的红色药水椅子",3010376, 10000),
Array("新鲜的蓝色药水椅子",3010377, 10000),
Array("闪耀星星之夜椅子",3010374, 10000),
Array("奥妙的超级药水椅子",3010375, 10000),
Array("云朵洗手间椅子",3010373, 10000),
Array("宝石枫叶椅子",3010370, 10000),
Array("枫叶纪念凳",3010371, 10000),
Array("北极熊椅子",3010368, 10000),
Array("老海盗椅子",3010369, 10000),
Array("红色龙椅子",3010429, 10000),
Array("水晶椅子",3010428, 10000),
Array("夏日喵喵椅子 ",3010431, 10000),
Array("蓝色龙椅子",3010430, 10000),
Array("发财椅",3010421, 10000),
Array("蘑菇朋友椅子",3010423, 10000),
Array("巨无霸企鹅王",3010417, 10000),
Array("巨无霸白雪人",3010416, 10000),
Array("双子塔",3010412, 10000),
Array("荆棘椅子",3010414, 10000),
Array("熟睡鸭子椅",3010415, 10000),
Array("龙的传人椅子",3010408, 10000),
Array("粽子椅子",3010409, 10000),
Array("艾丽莎的双膝",3010410, 10000),
Array("鱼尾狮椅子",3010411, 10000),
Array("希拉的梳妆椅",3010404, 10000),
Array("摆钟椅子",3010405, 10000),
Array("迷你神兽椅子",3010406, 10000),
Array("印第安酋长宝座",3010407, 10000),
Array("水晶花园椅",3010400, 10000),
Array("幻影卡牌椅",3010401, 10000),
Array("生日派对椅",3010402, 10000),
Array("埃欧雷的小音乐会",3010403, 10000),
Array("情人节爱情椅子",3010322, 10000),
Array("阿卡伊勒读童话椅子",3010321, 10000),
Array("老奶奶读童话椅子",3010320, 10000),
Array("红丝带月妙靠垫",3010314, 10000),
Array("青丝带月妙靠垫",3010315, 10000),
Array("粉色扎昆椅子",3010313, 10000),
Array("噢我的女皇",3010318, 10000),
Array("小熊床",3010319, 10000),
Array("扇子舞月妙靠垫",3010316, 10000),
Array("太平萧月妙靠垫",3010317, 10000),
Array("生如夏花椅子",3010306, 10000),
Array("品克缤椅子",3010307, 10000),
Array("恶魔绵羊椅子",3010304, 10000),
Array("玫红手柄座椅",3010305, 10000),
Array("黑龙椅子",3010311, 10000),
Array("四叶草",3010308, 10000),
Array("购物小推车椅子",3010361, 10000),
Array("光之骑士椅子",3010360, 10000),
Array("彩虹椅子",3010362, 10000),
Array("休彼德蔓的古代石掌椅子",3010365, 10000),
Array("与谢拉享受下午茶",3010364, 10000),
Array("外星钻机椅子",3010355, 10000),
Array("与克里姆享受下午茶",3010354, 10000),
Array("美容椅子",3010357, 10000),
Array("温馨荷花池",3010356, 10000),
Array("枫树下……",3010257, 10000),
Array("鬼节南瓜椅子",3010279, 10000),
Array("精灵王座",3010287, 10000),
Array("诺特勒斯椅子",3010286, 10000),
Array("飞毯椅",3010283, 10000),
Array("送子仙鹤椅",3010282, 10000),
Array("猴子囚笼",3010281, 10000),
Array("水果椅子",3010280, 10000),
Array("黑色海豹靠垫（可交易）",3010294, 10000),
Array("金色海豹靠垫（可交易）",3010295, 10000),
Array("暖炉椅（可交易）",3010292, 10000),
Array("乔克恶灵椅子（可交易）",3010293, 10000),
Array("恶魔军团椅",3010290, 10000),
Array("早日康复床（可交易）",3010291, 10000),
Array("珍珠蚌椅子",3010288, 10000),
Array("老人家读童话椅子",3010289, 10000),
Array("超级药水椅子",3010302, 10000),
Array("加肥抱抱椅",3010303, 10000),
Array("橙色HP药水椅子",3010300, 10000),
Array("高级HP药水椅子",3010301, 10000),
Array("白熊抱抱椅子",3010298, 10000),
Array("小幼龙椅子",3010299, 10000),
Array("甜蜜的圣诞椅子",3010296, 10000),
Array("水晶月亮",3010297, 10000),
Array("手柄座椅",3010177, 10000),
Array("燕尾服猫咪椅",3010179, 10000),
Array("MP椅子 ",3010181, 10000),
Array("HP椅子",3010180, 10000),
Array("胡萝卜椅子",3010183, 10000),
Array("兔子家族椅",3010182, 10000),
Array("小伙伴品克缤",3010185, 10000),
Array("冰钓椅子",3010184, 10000),
Array("过来抱抱椅",3010187, 10000),
Array("兔子椅子",3010186, 10000),
Array("克里塞椅子",3010189, 10000),
Array("班·雷昂椅子",3010188, 10000),
Array("爱情椅子",3010191, 10000),
Array("伊芙丽思的炼金瓶",3010193, 10000),
Array("野营篝火椅子",3010194, 10000),
Array("无价之宝椅子",3010195, 10000),
Array("泡泡浴缸椅",3010196, 10000),
Array("英雄的椅子-战神",3010197, 10000),
Array("雪房子",3010199, 10000),
Array("英雄的椅子-龙神",3010200, 10000),
Array("英雄的椅子-暗影双刀",3010201, 10000),
Array("传说枫叶下……",3010202, 10000),
Array("粉红沙滩遮阳伞",3010203, 10000),
Array("古老录音机椅子",3010205, 10000),
Array("梦想画家椅子",3010206, 10000),
Array("喧闹好友椅子",3010207, 10000),
Array("精灵王座",3010211, 10000),
Array("草莓冰淇淋月饼椅子",3010210, 10000),
Array("香草冰淇淋月饼椅子",3010209, 10000),
Array("黑猫椅子",3010208, 10000),
Array("战神守护者椅子",3010215, 10000),
Array("藏獒椅子",3010212, 10000),
Array("绵羊酋长椅子",3010219, 10000),
Array("乔克恶灵椅子",3010218, 10000),
Array("香橙果冻布丁",3010217, 10000),
Array("龙神守护者椅子",3010216, 10000),
Array("狗狗好乖椅",3010223, 10000),
Array("兔兔伴读椅子",3010222, 10000),
Array("我爱馅饼椅子",3010221, 10000),
Array("我爱蛋糕椅子",3010220, 10000),
Array("月光仙子椅子",3010226, 10000),
Array("年糕冰淇淋椅子",3010224, 10000),
Array("品克缤椅子",3010225, 10000),
Array("都纳斯喷气椅子",3010124, 10000),
Array("尼贝隆战舰椅",3010125, 10000),
Array("蝙蝠魔王座",3010126, 10000),
Array("扎昆宝座",3010127, 10000),
Array("彩蛋篮子",3010120, 10000),
Array("夏日花朵",3010123, 10000),
Array("摇滚之魂椅子",3010116, 10000),
Array("魔法书椅子",3010117, 10000),
Array("糖果音符椅子",3010118, 10000),
Array("羊羊椅子",3010119, 10000),
Array("情书柜子",3010112, 10000),
Array("幽魂发条熊椅子",3010113, 10000),
Array("俘虏我吧！椅子",3010114, 10000),
Array("熊宝宝床",3010115, 10000),
Array("蛋糕椅子",3010141, 10000),
Array("早日康复床",3010140, 10000),
Array("水族馆椅子",3010142, 10000),
Array("神龙椅子",3010137, 10000),


Array("无人岛椅子",3010151, 10000),
Array("猫咪风扇椅",3010149, 10000),
Array("周年庆水晶枫叶椅子",3010146, 10000),
Array("龙龙的蛋壳椅",3010147, 10000),
Array("七夕椅子",3010144, 10000),
Array("周年庆水晶枫叶椅子",3010145, 10000)

);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖1号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.dispose();
				cm.sendOk("抱歉，你没足够的点卷！");
            } else {
				var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖1号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.dispose();
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
