/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array("我来组成左脚",3020013, 10000),
Array("我来组成右脚",3020012, 10000),
Array("我来组成左臂",3020011, 10000),
Array("我来组成右臂",3020010, 10000),
Array("我来组成心脏",3020009, 10000),
Array("我来组成头部",3020008, 10000),
Array("礼物箱子",3020006, 10000),
Array("撒娇喵咪椅",3020001, 10000),
Array("贪吃熊猫椅",3020000, 10000),
Array("我来组成左脚",3020026, 10000),
Array("我来组成左臂",3020024, 10000),
Array("我来组成右脚",3020025, 10000),
Array("我来组成心脏",3020022, 10000),
Array("我来组成右臂",3020023, 10000),
Array("礼物箱子",3020020, 10000),
Array("我来组成头部",3020021, 10000),
Array("我来组成右脚",3020018, 10000),
Array("我来组成左脚",3020019, 10000),
Array("我来组成右臂",3020016, 10000),
Array("我来组成左臂",3020017, 10000),
Array("",3019999, 10000),
Array("桃乐丝魔方椅子",3017033, 10000),
Array("喵咪魔方椅子",3017032, 10000),
Array("南瓜魔方椅子",3017031, 10000),
Array("德古拉魔方椅子",3017030, 10000),
Array("僵尸魔方椅子",3017029, 10000),
Array("骷髅魔方椅子",3017028, 10000),
Array("熟透的卢斯狼游泳圈椅子",3017027, 10000),
Array("2016中秋节方块椅子 - 快乐",3017025, 10000),
Array("2016中秋节方块椅子 - 祝大家",3017024, 10000),
Array("提诺魔方椅子",3017001, 10000),
Array("花蘑菇魔方椅子",3017000, 10000),
Array("白雪人魔方椅子",3017003, 10000),
Array("水贼魔方椅子",3017002, 10000),
Array("潜水企鹅魔方椅子",3017005, 10000),
Array("女机器人魔方椅子",3017004, 10000),
Array("棕熊魔方椅子",3017007, 10000),
Array("沙沙兔魔方椅子",3017006, 10000),
Array("英雄魔方椅子-龙神",3017016, 10000),
Array("猴子椅子",3017017, 10000),
Array("HAPPY魔方椅子",3017018, 10000),
Array("NEW魔方椅子",3017019, 10000),
Array("YEAR魔方椅子",3017020, 10000),
Array("2016中秋节方块椅子 - 2016",3017021, 10000),
Array("红蝙蝠魔方椅子",3017022, 10000),
Array("2016中秋节方块椅子 - 中秋节",3017023, 10000),
Array("邪恶绵羊魔方椅子",3017008, 10000),
Array("品克缤魔方椅子",3017009, 10000),
Array("幽灵魔方椅子",3017010, 10000),
Array("英雄魔方椅子-战神",3017011, 10000),
Array("英雄魔方椅子-隐月",3017012, 10000),
Array("英雄魔方椅子-幻影",3017013, 10000),
Array("英雄魔方椅子-双弩精灵",3017014, 10000),
Array("英雄魔方椅子-夜光法师",3017015, 10000),
Array("水晶球秋千椅",3016200, 10000),
Array("梦幻旋转木马椅子",3016203, 10000),
Array("选择之关卡椅子",3016202, 10000),
Array("暗影树的花",3015820, 10000),
Array("梦之都市椅子",3015808, 10000),
Array("啾啾岛椅子",3015809, 10000),
Array("动物救援队椅子",3015811, 10000),
Array("农夫的乐园",3015829, 10000),
Array("喵喵塔",3015828, 10000),
Array("和黄金鸡蛋的回忆之椅",3015831, 10000),
Array("冒险岛世界椅子",3015830, 10000),
Array("不给糖就捣蛋椅子",3015687, 10000),
Array("特大万圣节糖果椅子",3015689, 10000),
Array("万圣节糖果大赢家椅子",3015688, 10000),
Array("白雪人助手椅子",3015691, 10000),
Array("与万圣猫同在椅子",3015690, 10000),
Array("蛋黄地震椅子",3015693, 10000),
Array("企鹅侦探椅子",3015692, 10000),
Array("冰块中的花蘑菇椅子",3015695, 10000),
Array("冰块中的品克缤椅子",3015694, 10000),
Array("冰块中的绿水灵椅子",3015696, 10000),
Array("冰块中骷髅鱼椅子",3015697, 10000),
Array("冰块中的仙人掌椅子",3015698, 10000),
Array("冰块中的漂漂猪",3015699, 10000),
Array("破蛋而出！新年快乐！",3015700, 10000),
Array("让我们成为雪人吧",3015701, 10000),
Array("圣诞明信片椅子",3015702, 10000),
Array("马卡龙甜蜜抱枕",3015703, 10000),
Array("古典手工椅子",3015704, 10000),
Array("古代守护兵椅子",3015705, 10000),
Array("露宿小鸡椅子",3015706, 10000),
Array("小鸡马戏团椅子",3015707, 10000),
Array("白烟寥寥的蒸包椅子",3015708, 10000),
Array("圣诞树",3015709, 10000),
Array("喵喵塔",3015710, 10000),
Array("可爱的仓鼠小屋椅子",3015711, 10000),
Array("和鵺一起巧克力派对",3015715, 10000),
Array("好吃的巧克力面膜",3015714, 10000),
Array("巧克力注入机椅子",3015713, 10000),
Array("路西德的噩梦床",3015712, 10000),
Array("抽签椅子(吉)",3015719, 10000),
Array("抽签椅子(大吉)",3015718, 10000),
Array("情人节惊吓箱椅子",3015717, 10000),
Array("和兼信一起巧克力派对",3015716, 10000),
Array("花蘑菇和朋友们套餐",3015723, 10000),
Array("神圣鸟的守护",3015722, 10000),
Array("猫咪们的最爱",3015721, 10000),
Array("抽签椅子(凶)",3015720, 10000),
Array("人气爆棚的储物柜",3015739, 10000),
Array("圣诞树椅子",3015740, 10000),
Array("对立着的理想",3015741, 10000),
Array("黑洞椅",3015757, 10000),
Array("猛龙暴风椅",3015756, 10000),
Array("超星魔导椅子",3015759, 10000),
Array("灵兽盛宴椅",3015758, 10000),
Array("召唤雪女椅",3015755, 10000),
Array("晓月光斩椅",3015754, 10000),
Array("蛋生椅子",3015766, 10000),
Array("新年森林晚会椅子",3015760, 10000),
Array("和黄金鸡蛋的回忆之椅",3015763, 10000),
Array("水晶椅子",3015783, 10000),
Array("英雄的椅子-战神",3015782, 10000),
Array("英雄的椅子-龙神",3015781, 10000),
Array("需要充电！",3015780, 10000),
Array("记忆之树椅子",3015779, 10000),
Array("甜蜜的睡眠椅子",3015778, 10000),
Array("恶魔军团椅",3015785, 10000),
Array("那就是我！",3015784, 10000),
Array("皇室家庭椅子",3015799, 10000),
Array("羊羊弹簧椅",3015796, 10000),
Array("我不是瓜子椅子",3015797, 10000),
Array("海边的浪漫婚礼(新娘)",3015794, 10000),
Array("贪心的猫咪旅行车椅子",3015795, 10000),
Array("海边的浪漫婚礼(新郎)",3015793, 10000),
Array("BBQ椅子",3015800, 10000),
Array("跳跳木马椅子",3016104, 10000),
Array(" 青春乐队！大家的演唱会 ",3016100, 10000),
Array("怪物水晶球秋千椅",3016101, 10000),
Array("大家一起雏祭!",3016103, 10000),
Array("大象跷跷板椅子",3016000, 10000),
Array("雪龟岛钓鱼椅子",3015394, 10000),
Array("鲜嫩的海鲜椅子 ",3015395, 10000),
Array("英雄隐月等身椅子",3015392, 10000),
Array("紫色妖姬王座",3015393, 10000),
Array("东方明珠占卦椅子",3015398, 10000),
Array("里恩冰川占卜椅子",3015399, 10000),
Array("射手村猪猪占卜椅子",3015396, 10000),
Array("埃德尔斯坦熔铅占卜椅子",3015397, 10000),
Array("魔力品克缤",3015403, 10000),
Array("嘭嘭！品克缤椅子",3015400, 10000),
Array("来咬我呀~",3015401, 10000),
Array("大家的圣诞节",3015406, 10000),
Array("大家的圣诞节",3015407, 10000),
Array("盛开吧埃欧雷",3015404, 10000),
Array("极光白雪人椅子",3015405, 10000),
Array("英雄幻影等身椅子",3015411, 10000),
Array("英雄战神等身椅子",3015410, 10000),
Array("英雄双弩精灵等身椅子",3015409, 10000),
Array("玩具国的主人公",3015408, 10000),
Array("猴子椅子",3015415, 10000),
Array("英雄隐月等身椅子",3015414, 10000),
Array("英雄龙神等身椅子",3015413, 10000),
Array("英雄夜光法师等身椅子",3015412, 10000),
Array("外滩爆竹椅子",3015419, 10000),
Array("温暖的温泉入场券",3015416, 10000),
Array("新的一年~",3015423, 10000),
Array("少年的圣诞",3015422, 10000),
Array("少女的圣诞",3015421, 10000),
Array("圣诞树",3015420, 10000),
Array("斯乌铁粉椅子",3015367, 10000),
Array("奥尔卡铁粉椅子",3015368, 10000),
Array("奥尔卡的兔子玩偶",3015369, 10000),
Array("冬日雪花椅子1",3015370, 10000),
Array("冬日雪花椅子2",3015371, 10000),
Array("冬日雪花椅子3",3015372, 10000),
Array("射手村猪猪占卜椅子",3015374, 10000),
Array("埃德尔斯坦熔铅占卜椅子",3015375, 10000),
Array("里恩冰川占卜椅子",3015377, 10000),
Array("东方明珠占卦椅子",3015376, 10000),
Array("大家的圣诞节",3015379, 10000),
Array("大家的圣诞节",3015378, 10000),
Array("蕉蕉仙人椅",3015380, 10000),
Array("泡温泉椅子",3015383, 10000),
Array("飞翔吧！悟空椅子",3015382, 10000),
Array("日式传统茶椅子 ",3015385, 10000),
Array("金咕隆咚伸缩棒椅子",3015384, 10000),
Array("英雄龙神等身椅子",3015387, 10000),
Array("英式红茶椅子 ",3015386, 10000),
Array("英雄战神等身椅子",3015389, 10000),
Array("英雄双弩精灵等身椅子",3015388, 10000),
Array("英雄夜光法师等身椅子",3015391, 10000),
Array("英雄幻影等身椅子",3015390, 10000),
Array("魅惑九尾狐",3015332, 10000),
Array("降灵术毛莫",3015333, 10000),
Array("我不怕！（哼）",3015330, 10000),
Array("猫咪纸屋",3015331, 10000),
Array("冒险岛电动缆车椅子 ",3015328, 10000),
Array("妖怪坛椅子",3015329, 10000),
Array("冬眠椅子 ",3015342, 10000),
Array("冰雪企鹅王椅子 ",3015343, 10000),
Array("RIP椅子",3015340, 10000),
Array("黑猫房车",3015341, 10000),
Array("秘密花园椅子 ",3015338, 10000),
Array("幽灵船椅子",3015339, 10000),
Array("黑色天堂玩具椅",3015350, 10000),
Array("青蛙摇摇机椅子 ",3015349, 10000),
Array("与精英南瓜僵尸相伴",3015346, 10000),
Array("僵尸猎人椅子",3015344, 10000),
Array("“#冒险岛微博”椅子",3015354, 10000),
Array("人鱼的珊瑚礁",3015300, 10000),
Array("巨型魔力鸭椅子",3015301, 10000),
Array("安德洛墨达椅子",3015302, 10000),
Array("幸福绣花鞋椅子",3015303, 10000),
Array("淑女青鸟花园",3015296, 10000),
Array("人生逆转！兴夫椅子",3015297, 10000),
Array("冒险岛金刚（红）",3015298, 10000),
Array("冒险岛世界椅子",3015299, 10000),
Array("I want you椅子",3015309, 10000),
Array("塞维利亚西班牙广场椅子",3015310, 10000),
Array("鱼尾狮公园椅子",3015311, 10000),
Array("哗啦啦大水车",3015304, 10000),
Array("与飞龙在天派相伴",3015305, 10000),
Array("与虎啸九天派相伴",3015306, 10000),
Array("国庆节喷泉椅子",3015317, 10000),
Array("突击！伊莉娜乐队椅子",3015316, 10000),
Array("兔儿爷爷虎虎椅子",3015313, 10000),
Array("农夫的乐园",3015312, 10000),
Array("冒险岛主播椅子",3015315, 10000),
Array("浓姬椅子",3015314, 10000),
Array("夜晚满月椅子",3015325, 10000),
Array("梦之蝴蝶椅子",3015327, 10000),
Array("叮当叠罗汉椅子",3015326, 10000),
Array("国庆节喷泉椅子",3015274, 10000),
Array("羊羊叠叠乐",3015273, 10000),
Array("紫色蛙漂流椅子",3015272, 10000),
Array("霸王的王座",3015279, 10000),
Array("乌鲁斯贪吃椅子",3015278, 10000),
Array("乌鲁斯打猎椅子",3015277, 10000),
Array("拳王乌鲁斯椅子",3015276, 10000),
Array("黄色帐篷椅子",3015267, 10000),
Array("帐篷椅子",3015266, 10000),
Array("帐篷椅子",3015265, 10000),
Array("今天我是主妇椅子",3015264, 10000),
Array("米沃克首领椅子",3015271, 10000),
Array("米沃克首领椅子",3015270, 10000),
Array("营火椅子",3015269, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖2号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖2号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
