/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(

Array("骇客服",1050050, 10000),
Array("黑色长袍",1050057, 10000),
Array("达克鲁弟子服 ",1050071, 10000),
Array("蓝色春节韩服",1050065, 10000),
Array("绿色春节韩服",1050066, 10000),
Array("黑朝鲜装",1050079, 10000),
Array("绿虎之服",1050086, 10000),
Array("熊猫之服",1050087, 10000),
Array("红鹰之服",1050084, 10000),
Array("蓝鲨之服",1050085, 10000),
Array("空手道服",1050101, 10000),
Array("拳击短裤",1050111, 10000),
Array("蓝顽童服",1050110, 10000),
Array("绿顽童服",1050109, 10000),
Array("蓝色制服",1050004, 10000),
Array("红骨头服",1050013, 10000),
Array("灰骨头服",1050012, 10000),
Array("蓝骨头服",1050015, 10000),
Array("绿骨头服",1050014, 10000),
Array("圣诞服",1050019, 10000),
Array("朱红骨头服",1050016, 10000),
Array("黄紧身衣",1050017, 10000),
Array("朱红纸箱",1050020, 10000),
Array("红色制服",1050034, 10000),
Array("黑色制服",1050033, 10000),
Array("银色制服",1050032, 10000),
Array("黑色韩服",1050043, 10000),
Array("褐色韩服",1050042, 10000),
Array("蓝色泳裤",1050041, 10000),
Array("红色泳裤",1050040, 10000),
Array("青色韩服",1050044, 10000),
Array("派对王子套服",1050475, 10000),
Array("玫瑰的誓约(男)",1050472, 10000),
Array("潮男泳裤",1050466, 10000),
Array("海阔天空",1050464, 10000),
Array("怦然心动连身衣",1050471, 10000),
Array("深夜月光",1050470, 10000),
Array("幻想海岸泳衣",1050469, 10000),
Array("熊熊乐园郊游服",1050468, 10000),
Array("南瓜星银河",1050441, 10000),
Array("绿小猪主人",1050440, 10000),
Array("暖和的兔毛大衣",1050443, 10000),
Array("牛奶巧克力套服",1050442, 10000),
Array("王之宴会",1050445, 10000),
Array("星之小夜曲",1050444, 10000),
Array("冒险岛M衬衫和长裤",1050447, 10000),
Array("王之宴会",1050446, 10000),
Array("豪华邦尼",1050433, 10000),
Array("冰雪之王(男)",1050432, 10000),
Array("夜蝶",1050435, 10000),
Array("",1050434, 10000),
Array("路西德之梦",1050437, 10000),
Array("暗影侠客",1050436, 10000),
Array("花蘑菇背带裤",1050439, 10000),
Array("扑通扑通校服",1050438, 10000),
Array("甜蜜时间(男)",1050456, 10000),
Array("水晶袍",1050461, 10000),
Array("帅气逼人男装",1050462, 10000),
Array("知识探索者",1050463, 10000),
Array("开场男星",1050448, 10000),
Array("麦吉的道服",1050451, 10000),
Array("月光雪芭服",1050452, 10000),
Array("甜蜜巧克力外套",1050453, 10000),
Array("郊游男装",1050454, 10000),
Array("",1050455, 10000),
Array("圣诞老人服装",1050415, 10000),
Array("爷们沐浴袍",1050414, 10000),
Array("秘密隐月套装",1050413, 10000),
Array("秘密隐月套装",1050412, 10000),
Array("正直夜光法师套装",1050411, 10000),
Array("正直夜光法师套装",1050410, 10000),
Array("寒冰战神套装",1050409, 10000),
Array("寒冰战神套装",1050408, 10000),
Array("神秘幻影套装",1050407, 10000),
Array("神秘幻影套装",1050406, 10000),
Array("皇家双弩精灵套装",1050405, 10000),
Array("皇家双弩精灵套装",1050404, 10000),
Array("龙神龙套装",1050403, 10000),
Array("龙神龙套装",1050402, 10000),
Array("胡桃夹子制服",1050400, 10000),
Array("黑色男孩童子军",1050430, 10000),
Array("星空兰花套服(男)",1050431, 10000),
Array("清爽甘露",1050428, 10000),
Array("玫瑰王子",1050429, 10000),
Array("黑白绅士",1050426, 10000),
Array("清澈露珠",1050427, 10000),
Array("恋恋草莓连身衣",1050424, 10000),
Array("甜甜圈情缘",1050425, 10000),
Array("缪斯的男高音礼服",1050422, 10000),
Array("四叶草连身服",1050423, 10000),
Array("",1050420, 10000),
Array("",1050421, 10000),
Array("暖冬毛绒装",1050418, 10000),
Array("冬日暖男套服",1050419, 10000),
Array("时光舞裙",1050416, 10000),
Array("冰鹿衣",1050417, 10000),
Array("超能力者校服",1050381, 10000),
Array("超能力者校服",1050380, 10000),
Array("小熊背带裤",1050383, 10000),
Array("百万富翁外套",1050382, 10000),
Array("可爱棒球服",1050377, 10000),
Array("舞会王子礼服",1050376, 10000),
Array("莲花学院指定校服",1050378, 10000),
Array("提姆绅士外套",1050373, 10000),
Array("精灵鼠小弟",1050372, 10000),
Array("洋娃娃普卡",1050375, 10000),
Array("天空浪漫",1050368, 10000),
Array("人鱼传说",1050371, 10000),
Array("薄荷喵茶会",1050370, 10000),
Array("",1050396, 10000),
Array("",1050397, 10000),
Array("",1050398, 10000),
Array("",1050399, 10000),
Array("玫瑰誓约大衣",1050392, 10000),
Array("天蓝微笑套服",1050393, 10000),
Array("自嗨演出服",1050394, 10000),
Array("蓝色海军制服",1050395, 10000),
Array("乌鲁斯绅士连身衣",1050388, 10000),
Array("农夫甜心派",1050389, 10000),
Array("懒懒喇叭裤",1050390, 10000),
Array("",1050391, 10000),
Array("小蓝蓝全身服",1050384, 10000),
Array("时间的旋律",1050385, 10000),
Array("爱情蓝鸟套服",1050386, 10000),
Array("海军风校服",1050387, 10000),
Array("甘菊下午茶",1050232, 10000),
Array("魔术师晚礼服",1050234, 10000),
Array("魅力王子",1050235, 10000),
Array("怪盗幻影套服-男款",1050226, 10000),
Array("薄荷雪套服",1050227, 10000),
Array("精灵精神外套",1050228, 10000),
Array("端庄韩服",1050229, 10000),
Array("淘淘可爱礼服",1050230, 10000),
Array("侍女服",1050231, 10000),
Array("精灵王服饰-男款",1050221, 10000),
Array("军团长外套-男款",1050220, 10000),
Array("黄色晚礼服-男款",1050209, 10000),
Array("正太学生装",1050208, 10000),
Array("蓝色小背带服",1050210, 10000),
Array("Dr.冒险岛男孩",1050215, 10000),
Array("红色长筒靴",1050193, 10000),
Array("蓝色雪花休闲装",1050187, 10000),
Array("新手MapleBoy套服",1050186, 10000),
Array("闪烁之星男生礼服",1050190, 10000),
Array("花少年韩服",1050188, 10000),
Array("圣诞节套服-男孩",1050179, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖4号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖5号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
