/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(

Array("白时尚上装",1042046, 10000),
Array("蓝竖条T恤",1042045, 10000),
Array("粉条T恤",1042044, 10000),
Array("红极地大衣",1042035, 10000),
Array("绿极地大衣",1042034, 10000),
Array("黄极地大衣",1042033, 10000),
Array("黄蜘蛛衫",1042032, 10000),
Array("蓝星长袖T恤",1042039, 10000),
Array("红运动衫",1042038, 10000),
Array("白色冬恋大衣",1042037, 10000),
Array("红色冬恋大衣",1042036, 10000),
Array("花纹衬衫",1042026, 10000),
Array("红色便装",1042024, 10000),
Array("囚服",1042025, 10000),
Array("绿水灵T恤",1042030, 10000),
Array("花蘑菇T恤",1042031, 10000),
Array("三眼章鱼T恤",1042029, 10000),
Array("爱心T恤",1042018, 10000),
Array("M纹红T恤",1042019, 10000),
Array("粉红滑雪服",1042016, 10000),
Array("淡蓝滑雪服",1042017, 10000),
Array("野战军服",1042022, 10000),
Array("蓝色便装",1042023, 10000),
Array("褐色军服",1042020, 10000),
Array("星星T恤",1042021, 10000),
Array("苹果绿短袖衫",1042128, 10000),
Array("休闲领带装",1042129, 10000),
Array("长金链短T",1042130, 10000),
Array("休闲马甲两件套",1042131, 10000),
Array("爱情海蓝T恤",1042132, 10000),
Array("蓝条纹两件套",1042133, 10000),
Array("黄色半袖T恤",1042134, 10000),
Array("变身用黑军官铠甲",1042135, 10000),
Array("变身用红守护之服",1042136, 10000),
Array("变身用黑夜",1042137, 10000),
Array("银链街头背心",1042138, 10000),
Array("探险家衬衫",1042140, 10000),
Array("粉星短袖T恤",1042141, 10000),
Array("彩虹条背心",1042142, 10000),
Array("点点围脖上衣",1042143, 10000),
Array("绿色棒球夹克衫",1042117, 10000),
Array("噢耶大衣",1042116, 10000),
Array("围领大衣",1042119, 10000),
Array("红色格子衬衫",1042118, 10000),
Array("粉色纯情大衣",1042121, 10000),
Array("蓝色纯情大衣",1042120, 10000),
Array("名侦探制服",1042122, 10000),
Array("兔兔包T恤",1042125, 10000),
Array("宽松白衫",1042127, 10000),
Array("红黑运动拉链衫",1042126, 10000),
Array("蓝条纹棉背心",1042162, 10000),
Array("我最IN－T恤",1042163, 10000),
Array("蓝格子套头衫",1042160, 10000),
Array("嫩黄连帽卫衣",1042161, 10000),
Array("摩托夹克",1042166, 10000),
Array("绿领带衬衣",1042164, 10000),
Array("粉色领结小背心",1042165, 10000),
Array("酷夏T恤",1042170, 10000),
Array("闪电T恤",1042168, 10000),
Array("冲锋者T恤",1042169, 10000),
Array("野营服",1042174, 10000),
Array("高尔夫上衣",1042172, 10000),
Array("绿油油polo衫",1042173, 10000),
Array("绅士针织背心",1042147, 10000),
Array("星星连帽衫",1042146, 10000),
Array("黄色小鸭T恤",1042145, 10000),
Array("蓝格子短袖衬衫",1042144, 10000),
Array("黄格绒线上衣",1042151, 10000),
Array("靶心黑T恤",1042150, 10000),
Array("灰条纹休闲衫",1042149, 10000),
Array("天空前卫夹克",1042155, 10000),
Array("吉祥棉服",1042154, 10000),
Array("红呢绒格子外套",1042153, 10000),
Array("如意棉服",1042152, 10000),
Array("小蜜蜂背带",1042159, 10000),
Array("黑白短款夹克",1042158, 10000),
Array("粉红爱心T恤",1042157, 10000),
Array("银河系T恤",1042156, 10000),
Array("蓝色卷曲围巾外套",1042068, 10000),
Array("粉红大腰带T恤",1042069, 10000),
Array("天蓝大腰带T恤",1042070, 10000),
Array("白色休闲套头T恤",1042071, 10000),
Array("橙色套头T恤",1042066, 10000),
Array("圆点套头外套",1042067, 10000),
Array("花点T恤",1042076, 10000),
Array("红与蓝",1042077, 10000),
Array("无袖水手服",1042078, 10000),
Array("红色休闲套头T恤",1042072, 10000),
Array("蓝紫色短袖夹克",1042073, 10000),
Array("星纹T恤",1042074, 10000),
Array("粉ETT恤",1042075, 10000),
Array("蓝翻毛上装",1042053, 10000),
Array("蓝贵族滑雪服",1042052, 10000),
Array("粉贵族滑雪服",1042055, 10000),
Array("红翻毛上装",1042054, 10000),
Array("休闲二件套",1042049, 10000),
Array("紫阳光衬衫",1042048, 10000),
Array("复古夹克",1042051, 10000),
Array("法式上装",1042050, 10000),
Array("褐色黄纹运动夹克",1042061, 10000),
Array("黄色高领毛衣",1042060, 10000),
Array("红色围肩毛衣",1042063, 10000),
Array("黑色皮夹克",1042062, 10000),
Array("十字领衫",1042056, 10000),
Array("红围领T恤",1042059, 10000),
Array("红白斑点服",1042058, 10000),
Array("海军T恤",1042102, 10000),
Array("白色随意T恤",1042103, 10000),
Array("拽拽中性西装",1042100, 10000),
Array("白领服",1042101, 10000),
Array("卡莫套头夹克",1042098, 10000),
Array("海蓝条纹连帽衫",1042099, 10000),
Array("超人T恤",1042096, 10000),
Array("印花休闲套头T恤",1042097, 10000),
Array("朱红加厚棉线衫",1042110, 10000),
Array("水印闪星背心",1042108, 10000),
Array("暖暖防风夹克衫",1042109, 10000),
Array("彩虹蓝T恤",1042106, 10000),
Array("紫印花T恤",1042107, 10000),
Array("小绿叶T恤",1042104, 10000),
Array("小红叶T恤",1042105, 10000),
Array("快乐骷髅衫",1042087, 10000),
Array("摄影师夹克",1042086, 10000),
Array("可爱心T恤",1042085, 10000),
Array("军装连帽坎肩",1042084, 10000),
Array("可爱连帽披风",1042083, 10000),
Array("黑茄克套",1042082, 10000),
Array("樱桃休闲T恤",1042081, 10000),
Array("红白条纹T恤",1042080, 10000),
Array("黑色夹克",1042095, 10000),
Array("高领小毛衣",1042094, 10000),
Array("双排扣小外套",1042093, 10000),
Array("红心小夹克",1042092, 10000),
Array("粉色棉马甲",1042091, 10000),
Array("红色骷髅马甲",1042090, 10000),
Array("蓝色棉马甲",1042089, 10000),
Array("黑色骷髅马甲",1042088, 10000),
Array("粉红公主裙",1060122, 10000),
Array("超短裙",1060123, 10000),
Array("熔岩皮裤",1060120, 10000),
Array("冰凌皮裤",1060121, 10000),
Array("巨星摩登裤子",1060126, 10000),
Array("苹果牛仔裤",1060114, 10000),
Array("校服裤",1060112, 10000),
Array("海员裤",1060113, 10000),
Array("黄蓝羽绒裤",1060118, 10000),
Array("牛仔小迷你",1060119, 10000),
Array("迷彩沙滩裤",1060116, 10000),
Array("红沙滩裤",1060117, 10000),
Array("长短裤",1060108, 10000),
Array("青年裤",1060096, 10000),
Array("彩带草裙",1060103, 10000),
Array("幼儿园裤",1060145, 10000),
Array("啦啦啦斑点裤",1060190, 10000),
Array("白色夏日短裤",1060188, 10000),
Array("冰蓝绒球短裤",1060189, 10000),
Array("绿色沙滩裤",1060187, 10000),
Array("高尔夫短裤",1060182, 10000),
Array("百褶南瓜短裤",1060180, 10000),
Array("流星雨裤子",1060181, 10000),
Array("[MS特制橙色登山裤",1060178, 10000),
Array("高尔夫短裤",1060179, 10000),
Array("牛仔裤",1060174, 10000),
Array("军用短裤",1060003, 10000),
Array("黑西裤",1060001, 10000),
Array("黑摩托车裤",1060036, 10000),
Array("蓝摩托车裤",1060034, 10000),
Array("白摩托车裤",1060035, 10000),
Array("灰色喇叭裤",1060047, 10000),
Array("蓝运动裤",1060040, 10000),
Array("绿运动裤",1060041, 10000),
Array("橙色登山裤",1060042, 10000),
Array("黄毛糙裤",1060053, 10000),
Array("红毛糙裤",1060055, 10000),
Array("褐毛糙裤",1060054, 10000),
Array("蓝色喇叭裤",1060049, 10000),
Array("绿色喇叭裤",1060048, 10000),
Array("西部牛仔裤",1060066, 10000),
Array("乖仔裤",1060067, 10000),
Array("粉红女便装裤",1061112, 10000),
Array("夏威夷草裙",1061113, 10000),
Array("粉白运动短裤",1061110, 10000),
Array("黑白运动短裤",1061111, 10000),
Array("红白运动短裤",1061108, 10000),
Array("蓝白运动短裤",1061109, 10000),
Array("SF 忍者裤子",1061107, 10000),
Array("礼服裙",1061103, 10000),
Array("花袜牛仔裙",1061089, 10000),
Array("红色运动裤",1061072, 10000),
Array("淡蓝运动裤",1061073, 10000),
Array("粉红运动裤",1061074, 10000),
Array("黑色运动裤",1061075, 10000),
Array("乖囡裙",1061068, 10000),
Array("淡蓝公主裙",1061065, 10000),
Array("热裤",1061067, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖4号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖5号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
