/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(

Array("飞行猫猫靴子",1072467, 10000),
Array("学院优等生鞋子",1072466, 10000),
Array("粉色条纹鞋",1072469, 10000),
Array("蝴蝶结娃娃鞋",1072468, 10000),
Array("天蓝条纹鞋",1072470, 10000),
Array("运动版休闲拖",1072457, 10000),
Array("唤灵斗师靴子",1072461, 10000),
Array("豹弩游侠靴子",1072462, 10000),
Array("皇家彩虹靴",1072448, 10000),
Array("奥兹的魔法靴子",1072454, 10000),
Array("胡克的船长靴",1072444, 10000),
Array("龙神短靴",1072443, 10000),
Array("暗影双刀鞋子",1072441, 10000),
Array("灰蒙蒙猫肉垫",1072440, 10000),
Array("采草莓礼鞋",1072439, 10000),
Array("小嫩叶鞋",1072438, 10000),
Array("PB拖拖",1072437, 10000),
Array("浪漫唐鞋",1072433, 10000),
Array("炫彩脚环",1072426, 10000),
Array("弗里德的鞋子",1072425, 10000),
Array("小丑鞋子",1072417, 10000),
Array("枫叶赛车手鞋",1072408, 10000),
Array("神秘术士短靴",1072404, 10000),
Array("HELLO喵喵拖",1072407, 10000),
Array("贵族勇士钢铁战靴",1072406, 10000),
Array("粉红礼鞋",1072392, 10000),
Array("糖果雨鞋",1072394, 10000),
Array("双色帆布鞋",1072395, 10000),
Array("女仆礼鞋",1072388, 10000),
Array("BigBig鞋",1072384, 10000),
Array("纯白拖鞋",1072385, 10000),
Array("黑色木拖",1072386, 10000),
Array("红色木拖",1072387, 10000),
Array("军团长的靴子",1072627, 10000),
Array("精灵王的靴子",1072628, 10000),
Array("喵喵管家皮鞋",1072632, 10000),
Array("红色运动板鞋",1072633, 10000),
Array("魔族高贵靴子",1072637, 10000),
Array("粉色皮靴",1072609, 10000),
Array("西部牛仔靴",1072613, 10000),
Array("奥尔卡黑色之翼靴",1072622, 10000),
Array("粉红大象拖鞋",1072529, 10000),
Array("考拉拖鞋",1072531, 10000),
Array("谢丽尔靴子",1072536, 10000),
Array("克洛乌靴子",1072537, 10000),
Array("天使羽翼",1072517, 10000),
Array("新手小鸡拖鞋",1072516, 10000),
Array("狮子宝宝拖",1072515, 10000),
Array("天使翅膀帆布鞋",1072514, 10000),
Array("凉爽夏日脚蹼",1072708, 10000),
Array("银河牛仔靴",1072729, 10000),
Array("异国风情庆典鞋",1072748, 10000),
Array("泡泡巧克力鞋子",1072749, 10000),
Array("剑豪的鞋子",1072750, 10000),
Array("猫咪脚掌",1072742, 10000),
Array("喵喵鞋",1072760, 10000),
Array("超级小猫拖鞋",1072756, 10000),
Array("小鸡拖",1072759, 10000),
Array("白猫拖",1072758, 10000),
Array("海龙靴",1072650, 10000),
Array("炎龙靴",1072651, 10000),
Array("魔法学校皮鞋",1072648, 10000),
Array("武陵道场道鞋",1072649, 10000),
Array("银河战队靴子",1072652, 10000),
Array("精灵精神靴",1072646, 10000),
Array("热血高校皮鞋",1072647, 10000),
Array("战斗修女靴",1072659, 10000),
Array("炫彩脚环",1072658, 10000),
Array("蓝色天使鞋",1072663, 10000),
Array("露西亚运动鞋",1072662, 10000),
Array("阿拉伯鞋子(男)",1072680, 10000),
Array("阿拉伯鞋子(女)",1072681, 10000),
Array("阴阳师的鞋子",1072676, 10000),
Array("熊猫拖",1072838, 10000),
Array("垒球鞋",1072836, 10000),
Array("海滩拖鞋",1072832, 10000),
Array("泡泡拖",1072843, 10000),
Array("真·破灭鞋子",1072842, 10000),
Array("真·生命鞋子",1072841, 10000),
Array("超级明星鞋子",1072852, 10000),
Array("葡萄鞋",1072851, 10000),
Array("血腥吊带袜",1072848, 10000),
Array("闪购拖鞋",1072862, 10000),
Array("勃肯拖鞋",1072863, 10000),
Array("明星闪耀",1072860, 10000),
Array("欧迪尔芭蕾舞鞋",1072858, 10000),
Array("深蓝神之子鞋子",1072859, 10000),
Array("熊宝宝靴子",1072856, 10000),
Array("欧黛特芭蕾舞鞋",1072857, 10000),
Array("时间旅行者的高跟鞋",1072869, 10000),
Array("制服皮鞋",1072868, 10000),
Array("万圣节机器人皮鞋",1072871, 10000),
Array("艺妓木屐",1072865, 10000),
Array("云朵羊鞋子",1072867, 10000),
Array("巧可羊鞋子",1072866, 10000),
Array("黑暗小恶魔鞋",1072877, 10000),
Array("卡卡奥熊掌鞋",1072876, 10000),
Array("万圣节幻影鞋子",1072878, 10000),
Array("企鹅拖",1072894, 10000),
Array("绿猫猫短靴",1072895, 10000),
Array("烈焰战靴",1072888, 10000),
Array("蛇纹运动鞋",1072889, 10000),
Array("K君的猫咪鞋",1072890, 10000),
Array("蛇年嘻哈鞋",1072771, 10000),
Array("黑暗小恶魔鞋子",1072770, 10000),
Array("圣洁天使拖",1072779, 10000),
Array("黑暗力量靴",1072778, 10000),
Array("斯乌黑色之翼鞋",1072783, 10000),
Array("尖兵尼奥鞋子",1072782, 10000),
Array("猫咪鞋子",1072781, 10000),
Array("蓝缎带猫咪鞋",1072780, 10000),
Array("小恐龙绿豆爪爪",1072791, 10000),
Array("高尔夫球鞋",1072800, 10000),
Array("稀奇恐龙鞋",1072803, 10000),
Array("希拉鞋子",1072807, 10000),
Array("废都高校皮鞋",1072809, 10000),
Array("软软绵羊拖鞋",1072808, 10000),
Array("武陵武道馆运动鞋",1072811, 10000),
Array("魔法密林魔法学校皮鞋",1072810, 10000),
Array("女妖鞋子",1072816, 10000),
Array("Blavy天使鞋",1072817, 10000),
Array("明星熊仔鞋",1072820, 10000),
Array("金铃派对鞋",1072821, 10000),
Array("高尔夫运动鞋",1072823, 10000),
Array("天使之翼鞋子",1072824, 10000),
Array("GM队长的露西娅运动鞋",1072830, 10000),
Array("波比短靴",1072831, 10000),
Array("闪耀唐鞋",1072978, 10000),
Array("灰色喵喵球鞋",1073023, 10000),
Array("蓝色喵喵球鞋",1073022, 10000),
Array("小恐龙鞋",1073019, 10000),
Array("粉红小熊鞋",1073014, 10000),
Array("小狗狗鞋子",1073013, 10000),
Array("羊绒雪地靴",1073012, 10000),
Array("拉拉队长鞋",1073011, 10000),
Array("农场小皮靴",1073009, 10000),
Array("红色运动鞋",1073008, 10000),
Array("兔熊拖鞋",1072998, 10000),
Array("蝴蝶结红皮鞋",1072999, 10000),
Array("幻夜蝶华的褶皱皮鞋",1072921, 10000),
Array("僵尸新娘高跟鞋",1072920, 10000),
Array("波点娃娃鞋",1072923, 10000),
Array("大厨鞋",1072922, 10000),
Array("未来医生靴子",1072925, 10000),
Array("未来天使靴",1072924, 10000),
Array("双色帆布鞋",1072926, 10000),
Array("制服皮鞋",1072913, 10000),
Array("豹皮鞋",1072914, 10000),
Array("小马马乖乖鞋",1072917, 10000),
Array("林之灵鞋子",1072916, 10000),
Array("蓝色蝴蝶鞋",1072919, 10000),
Array("粉红蝴蝶鞋",1072918, 10000),
Array("邦尼翼靴",1072908, 10000),
Array("紫色炫彩情侣鞋",1072909, 10000),
Array("可可熊鞋子",1072910, 10000),
Array("肃清者暗靴",1072911, 10000),
Array("红猫猫短靴",1072896, 10000),
Array("蓝色鹿皮鞋",1072897, 10000),
Array("雪之女神短靴",1072900, 10000),
Array("五彩珠鞋",1072901, 10000),
Array("隐武士战靴",1072945, 10000),
Array("暗夜精灵战靴",1072944, 10000),
Array("呼拉呼拉串珠脚环",1072951, 10000),
Array("蓝色小马运动鞋",1072950, 10000),
Array("红色小马运动鞋",1072949, 10000),
Array("海鸥拖拖鞋",1072942, 10000),
Array("哼唱旋律的舞鞋",1072943, 10000),
Array("机械兔靴",1072941, 10000),
Array("柴郡猫短靴",1072930, 10000),
Array("爱丽丝鞋子",1072931, 10000),
Array("彩虹运动鞋",1072934, 10000),
Array("风神的鞋子",1073109, 10000),
Array("我的球鞋",1073105, 10000),
Array("保罗熊鞋子",1073106, 10000),
Array("龙神龙靴子",1073116, 10000),
Array("皇家双弩精灵鞋子",1073117, 10000),
Array("皇家双弩精灵鞋子",1073118, 10000),
Array("神秘幻影鞋子",1073119, 10000),
Array("龙神龙靴子",1073115, 10000),
Array("黑色乌鲁斯拖鞋",1073092, 10000),
Array("蓝鸟拖拖",1073088, 10000),
Array("棕色乌鲁斯拖鞋",1073091, 10000),
Array("白色乌鲁斯拖鞋",1073090, 10000),
Array("北极雪橇靴 ",1073098, 10000),
Array("蛋黄拖",1073150, 10000),
Array("水菊鞋子",1073151, 10000),
Array("草莓小皮鞋",1073148, 10000),
Array("枫叶贵族鞋子",1073149, 10000),
Array("鲨鱼拖鞋",1073144, 10000),
Array("喵咪的萌脚印",1073145, 10000),
Array("绒毛拖鞋",1073127, 10000),
Array("秘密隐月靴子",1073126, 10000),
Array("秘密隐月靴子",1073125, 10000),
Array("正直夜光法师鞋子",1073124, 10000),
Array("正直夜光法师鞋子",1073123, 10000),
Array("寒冰战神靴子",1073122, 10000),
Array("寒冰战神靴子",1073121, 10000),
Array("神秘幻影鞋子",1073120, 10000),
Array("月光蝴蝶短靴",1073135, 10000),
Array("月光蝴蝶鞋",1073134, 10000),
Array("暗影铆钉短靴",1073133, 10000),
Array("暗影马丁靴",1073132, 10000),
Array("暖绒绒鞋子",1073129, 10000),
Array("鹿之足迹",1073128, 10000),
Array("啵啵鼠鞋",1073040, 10000),
Array("黑色马丁靴",1073041, 10000),
Array("喜羊羊拖",1073046, 10000),
Array("美羊羊拖",1073047, 10000),
Array("奔跑吧！运动鞋",1073050, 10000),
Array("闪耀之星纪念鞋",1073051, 10000),
Array("闪耀之星纪念鞋",1073052, 10000),
Array("弓凛小花鞋",1073055, 10000),
Array("雏鸟鞋子",1073025, 10000),
Array("红色圣诞小皮鞋",1073024, 10000),
Array("立体机动装置",1073027, 10000),
Array("可爱兔鞋子",1073037, 10000),
Array("蓝鸟鞋子",1073036, 10000),
Array("可爱小绵羊鞋子",1073039, 10000),
Array("海贼团皮靴",1073074, 10000),
Array("薄荷喵拖鞋",1073075, 10000),
Array("枫叶翅膀鞋子",1073078, 10000),
Array("果冻鞋",1073079, 10000),
Array("星光布鞋",1073076, 10000),
Array("欧黛特芭蕾舞鞋",1073082, 10000),
Array("海贼团皮靴 ",1073080, 10000),
Array("超能力者皮鞋",1073084, 10000),
Array("超能力者皮鞋",1073085, 10000),
Array("黑猫鞋子",1073059, 10000),
Array("小淘气鞋子",1073058, 10000),
Array("小花仙拖鞋",1073056, 10000),
Array("小白兔高跟鞋",1073062, 10000),
Array("粉红花纹鞋子",1073061, 10000),
Array("贵族花纹鞋",1073060, 10000),
Array("派对女王高跟鞋",1071111, 10000),
Array("血色小皮鞋(女)",1071108, 10000),
Array("轻云鞋",1071106, 10000),
Array("婚礼高跟鞋",1071107, 10000),
Array("灿烂之舞",1071104, 10000),
Array("樱桃高跟鞋",1071105, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "椅子专卖4号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖5号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
