/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array("叉子上的蛋糕",1702561, 10000),
Array("泰迪小伙伴(棕)",1702560, 10000),
Array("圣诞雪人",1702562, 10000),
Array("死亡之刃",1702565, 10000),
Array("妙趣悠悠球",1702564, 10000),
Array("漂浮小虎",1702567, 10000),
Array("羊羊魔术棒",1702566, 10000),
Array("幻想莲花武器",1702617, 10000),
Array("魔力鸭棒棒糖",1702616, 10000),
Array("啦啦啦大葱",1702619, 10000),
Array("神秘骰子",1702621, 10000),
Array("神秘骰子",1702620, 10000),
Array("杰的陪伴",1702623, 10000),
Array("海军条纹雨伞",1702608, 10000),
Array("小鸭单肩包",1702611, 10000),
Array("主人公权杖",1702613, 10000),
Array("精灵匹克",1702612, 10000),
Array("球棒",1702614, 10000),
Array("培根",1702601, 10000),
Array("意大利面",1702600, 10000),
Array("肋骨牛排",1702603, 10000),
Array("汉堡",1702602, 10000),
Array("甜甜圈",1702605, 10000),
Array("芭菲",1702604, 10000),
Array("拔丝胡萝卜",1702607, 10000),
Array("鱿鱼",1702606, 10000),
Array("清冷天空竹子",1702593, 10000),
Array("薄荷喵下午茶",1702595, 10000),
Array("奥尔卡瞌睡",1702594, 10000),
Array("彩虹贝壳武器",1702597, 10000),
Array("啊呜！赫雅",1702599, 10000),
Array("枫叶武器",1702598, 10000),
Array("光与暗双头杖",1702649, 10000),
Array("战神之矛摩诃",1702648, 10000),
Array("被遗忘的英雄拳甲",1702651, 10000),
Array("光与暗双头杖",1702650, 10000),
Array("透明机甲手枪",1702653, 10000),
Array("被遗忘的英雄拳甲",1702652, 10000),
Array("双弩精灵玩偶",1702655, 10000),
Array("温泉喵",1702654, 10000),
Array("龙神之杖",1702641, 10000),
Array("兔儿雪绒绒 ",1702640, 10000),
Array("精灵王双弩枪",1702643, 10000),
Array("龙神之杖",1702642, 10000),
Array("怪盗幻影手杖",1702645, 10000),
Array("精灵王双弩枪",1702644, 10000),
Array("战神之矛摩诃",1702647, 10000),
Array("怪盗幻影手杖",1702646, 10000),
Array("猴儿小伙伴",1702633, 10000),
Array("扎昆爪爪",1702632, 10000),
Array("茅山道士铜钱剑",1702635, 10000),
Array("小蘑菇和史莱姆的基情僵尸秀",1702634, 10000),
Array("音乐律动武器箱",1702637, 10000),
Array("北极杀人豚  ",1702636, 10000),
Array("这是薯片！",1702639, 10000),
Array("蓝色海军之治学热情",1702638, 10000),
Array("爱情蓝鸟武器",1702625, 10000),
Array("时间主宰者",1702624, 10000),
Array("樱花之刃",1702627, 10000),
Array("海洋风提包",1702626, 10000),
Array("那时的最新款手机",1702629, 10000),
Array("荣耀的黄金鸡蛋杆",1702628, 10000),
Array("玫瑰誓约",1702631, 10000),
Array("吊篮花灯",1702630, 10000),
Array("水晶之心漂流瓶",1702681, 10000),
Array("山茶花之剑",1702680, 10000),
Array("海鲜串武器",1702682, 10000),
Array("火凤鸟",1702685, 10000),
Array("青鸾鸟",1702684, 10000),
Array("恋恋草莓武器",1702687, 10000),
Array("叠叠猪甜甜圈",1702686, 10000),
Array("猴子香蕉",1702673, 10000),
Array("小鸭子单肩背包",1702672, 10000),
Array("绒绒雪妖精",1702675, 10000),
Array("戴米安玩偶",1702677, 10000),
Array("缪斯水晶麦克风",1702676, 10000),
Array("淘气黑猫",1702679, 10000),
Array("阿丽莎玩偶",1702678, 10000),
Array("龙神玩偶",1702665, 10000),
Array("怪盗幻影玩偶",1702667, 10000),
Array("战神玩偶",1702666, 10000),
Array("公主日记武器",1702669, 10000),
Array("享受冬季手鼓",1702668, 10000),
Array("圣经武器",1702671, 10000),
Array("隐月玩偶",1702657, 10000),
Array("夜光法师玩偶",1702656, 10000),
Array("大师时间",1702659, 10000),
Array("圣诞树戒指",1702658, 10000),
Array("",1702661, 10000),
Array("调皮雪人武器",1702660, 10000),
Array("",1702663, 10000),
Array("",1702662, 10000),
Array("万圣节女巫权杖",1702713, 10000),
Array("兔摇铃",1702712, 10000),
Array("拉克兰幻想曲",1702715, 10000),
Array("多彩狗爪爪武器",1702714, 10000),
Array("心动爱情粉笔",1702717, 10000),
Array("晨露阳伞",1702716, 10000),
Array("春之花卉娃娃",1702719, 10000),
Array("暗影剑",1702718, 10000),
Array("熊宝宝撇嘴游泳圈",1702705, 10000),
Array("蓝色海军之治学热情",1702704, 10000),
Array("邦尼的臭臭胡萝卜",1702707, 10000),
Array("给我冰淇淋",1702706, 10000),
Array("手掌荧光棒",1702709, 10000),
Array("天堂极光",1702708, 10000),
Array("猫头鹰魔导书",1702711, 10000),
Array("镰鼬武器",1702710, 10000),
Array("一杯喵星人",1702697, 10000),
Array("银狼",1702696, 10000),
Array("炫彩沙滩排球",1702699, 10000),
Array("爆破手武器",1702698, 10000),
Array("龙魔祭九剑",1702701, 10000),
Array("蝴蝶幽兰",1702703, 10000),
Array("兔兔扇纸武器",1702702, 10000),
Array("草木精灵",1702689, 10000),
Array("闪耀金话筒",1702688, 10000),
Array("妖精佛罗拉",1702691, 10000),
Array("枫叶贵族长杖",1702690, 10000),
Array("露水泡泡",1702693, 10000),
Array("照相鸡自拍杆",1702692, 10000),
Array("爆力卖萌小柴",1702695, 10000),
Array("玫瑰绽放",1702694, 10000),
Array("柔软银铃花",1702745, 10000),
Array("闪闪月光灯",1702744, 10000),
Array("我的朋友小喜鹊",1702747, 10000),
Array("小恐龙",1702746, 10000),
Array("情书包",1702749, 10000),
Array("春之豚鼠武器",1702748, 10000),
Array("草莓跳绳",1702750, 10000),
Array("寒冰楼阁",1702737, 10000),
Array("舞动的雪花权杖",1702736, 10000),
Array("手掌荧光棒",1702739, 10000),
Array("咯咯嗒小鸡",1702738, 10000),
Array("出动吧，冲锋鸡！",1702740, 10000),
Array("超星魔导杖",1702742, 10000),
Array("只要有你在",1702729, 10000),
Array("蜜糖脚掌武器",1702728, 10000),
Array("雪兔子",1702731, 10000),
Array("超大童摇鼓",1702733, 10000),
Array("New帽子里的兔子",1702732, 10000),
Array("星座的玫瑰",1702735, 10000),
Array("冒险岛5000天旗帜",1702734, 10000),
Array("死亡之字",1702721, 10000),
Array("冒险岛M智能手机",1702720, 10000),
Array("三只小猪",1702723, 10000),
Array("冬季兔兔",1702722, 10000),
Array("降灵术士",1702725, 10000),
Array("僵尸熊",1702724, 10000),
Array("萌兔泡泡棒武器",1702727, 10000),
Array("一闪一闪南瓜星",1702726, 10000),
Array("呱呱小黄伞",1702761, 10000),
Array("萌萌仓鼠武器",1702760, 10000),
Array("清凉弹珠汽水瓶武器",1702765, 10000),
Array("执法者铁锤",1702764, 10000),
Array("闪亮钻石",1702766, 10000),
Array("潘多拉武器",1702753, 10000),
Array("雪之铃兰武器",1702752, 10000),
Array("香甜法棍",1702755, 10000),
Array("希纳斯的守护",1702757, 10000),
Array("镇魂杖",1702756, 10000),
Array("樱桃棒棒糖",1702759, 10000),
Array("骷髅王麦克风武器",1702758, 10000),
Array("",1302917, 10000)

);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "稀有点装4号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖4号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
