/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(

Array("龙神龙套装",1051471, 10000),
Array("黑暗力量连身衣",1051311, 10000),
Array("喵喵派对裙",1051304, 10000),
Array("神圣夜光法师",1051301, 10000),
Array("粉红淑女韩服",1051302, 10000),
Array("抹胸礼服",1051303, 10000),
Array("玩世不恭裙装",1051296, 10000),
Array("红帽子短连衣裙",1051297, 10000),
Array("国庆全身战甲-女款",1051298, 10000),
Array("国庆战斗外套-女款",1051299, 10000),
Array("阿尔卑斯少女套裙",1051312, 10000),
Array("樱桃雪套服",1051278, 10000),
Array("精灵精神外套",1051279, 10000),
Array("怪盗幻影套服-女款",1051276, 10000),
Array("希纳斯裙子",1051277, 10000),
Array("军团长外套-女款",1051270, 10000),
Array("精灵王服饰-女款",1051271, 10000),
Array("华丽银色安哥拉外套",1051264, 10000),
Array("华丽金色安哥拉外套",1051265, 10000),
Array("魔法裙装",1051295, 10000),
Array("抒情裙装",1051294, 10000),
Array("开场女星",1051292, 10000),
Array("银河牛仔连身装",1051290, 10000),
Array("魅力公主",1051285, 10000),
Array("魔术师晚礼裙",1051284, 10000),
Array("迷迭香下午茶",1051282, 10000),
Array("褐色休闲大衣",1051281, 10000),
Array("端庄韩服",1051280, 10000),
Array("粉格纹假日装",1051368, 10000),
Array("女仆之骄傲",1051369, 10000),
Array("浪漫旗袍",1051370, 10000),
Array("蝴蝶结女生校园风",1051371, 10000),
Array("巧克力女孩",1051372, 10000),
Array("血红詹娜",1051373, 10000),
Array("欧黛特芭蕾裙",1051374, 10000),
Array("欧迪尔芭蕾裙",1051375, 10000),
Array("超级明星连衣裙",1051362, 10000),
Array("开场天使",1051363, 10000),
Array("贝塔战袍",1051365, 10000),
Array("小娃娃皮卡",1051366, 10000),
Array("蓝色雪糕MM装",1051367, 10000),
Array("巧克力恋人",1051385, 10000),
Array("邦尼戎装",1051384, 10000),
Array("春游连衣裙",1051387, 10000),
Array("女仆的骄傲",1051386, 10000),
Array("纯白婚纱",1051389, 10000),
Array("艾尔莎连衣裙",1051391, 10000),
Array("秋游套装",1051390, 10000),
Array("万圣节机器人裙",1051376, 10000),
Array("佳人隐月",1051383, 10000),
Array("天生购物狂",1051382, 10000),
Array("波比魔法斗篷",1051352, 10000),
Array("海滩美眉装",1051359, 10000),
Array("粉可爱比基尼",1051358, 10000),
Array("可爱棒球服",1051357, 10000),
Array("魔术师晚礼裙",1051347, 10000),
Array("可爱猫咪服装",1051345, 10000),
Array("GM璐利的制服",1051351, 10000),
Array("派对名媛裙",1051350, 10000),
Array("女妖",1051349, 10000),
Array("魔法密林魔法学校校服",1051348, 10000),
Array("条纹淑女连衣裙",1051173, 10000),
Array("草莓牛奶连衣裙",1051175, 10000),
Array("军式帝王制服",1051171, 10000),
Array("红色幼稚园背带",1051170, 10000),
Array("水兵服",1051180, 10000),
Array("周末约会装",1051183, 10000),
Array("异国风情庆典服",1051182, 10000),
Array("结婚服",1051177, 10000),
Array("贵族生校服",1051176, 10000),
Array("甜美公主裙",1051179, 10000),
Array("黄紧身衣",1051178, 10000),
Array("蓝色碎花裙",1051188, 10000),
Array("怦然心动装",1051189, 10000),
Array("死神长袍",1051190, 10000),
Array("女仆套裙",1051185, 10000),
Array("樱花服",1051199, 10000),
Array("海洋裹裹短裙",1051192, 10000),
Array("甜橙浴袍",1051193, 10000),
Array("太极旗套服",1051143, 10000),
Array("轻舞飞扬黄连衣裙",1051142, 10000),
Array("跆拳道红带",1051141, 10000),
Array("白领结水手服",1051139, 10000),
Array("玉女服",1051138, 10000),
Array("兔毛领粉红装",1051137, 10000),
Array("韩式改良宫廷服",1051136, 10000),
Array("韩式公主服",1051149, 10000),
Array("帅娃娃",1051147, 10000),
Array("医女服",1051146, 10000),
Array("宫中侍女服",1051145, 10000),
Array("蓝色优雅洋装",1051144, 10000),
Array("套套帽校服",1051158, 10000),
Array("简易校服",1051159, 10000),
Array("黑色毛大衣",1051156, 10000),
Array("白色毛大衣",1051157, 10000),
Array("女神晚礼服",1051154, 10000),
Array("公主礼服",1051155, 10000),
Array("冬日韩服",1051166, 10000),
Array("点点蕾丝边小礼服",1051167, 10000),
Array("粉红色KAWAYI套装",1051164, 10000),
Array("水手校服",1051162, 10000),
Array("鬼娃娃晚装",1051163, 10000),
Array("裹裹短裙",1051160, 10000),
Array("车模装",1051233, 10000),
Array("闪烁之星女孩礼服",1051232, 10000),
Array("橙色小鸡裙子",1051235, 10000),
Array("",1051238, 10000),
Array("粉红天使制服",1051252, 10000),
Array("红帽迷你裙",1051253, 10000),
Array("萝莉学生装",1051254, 10000),
Array("黄色晚礼服-女款",1051255, 10000),
Array("蓝色小背带裙",1051256, 10000),
Array("童话幻想",1051261, 10000),
Array("Dr.冒险岛女孩",1051262, 10000),
Array("邦妮女孩套服",1051200, 10000),
Array("伊丽莎白礼服",1051211, 10000),
Array("龙神套服",1051209, 10000),
Array("草莓少女套服",1051208, 10000),
Array("MapleGirl套服",1051218, 10000),
Array("彩虹mini连衣裙",1051219, 10000),
Array("伊丽莎白长裙",1051220, 10000),
Array("圣诞节套服-女孩",1051221, 10000),
Array("新手MapleGirl套服",1051227, 10000),
Array("阿尔卑斯山少女装",1051231, 10000),
Array("粉红色雪花休闲装",1051228, 10000),
Array("花少女韩服",1051229, 10000),
Array("英雄长袍",1052151, 10000),
Array("舞狮服",1052147, 10000),
Array("圣诞宴会装",1052145, 10000),
Array("白领灰风衣",1052144, 10000),
Array("虎娃服",1052154, 10000),
Array("变身用保镖服",1052153, 10000),
Array("变身用绿星光长袍",1052152, 10000),
Array("半人马装",1052135, 10000),
Array("背带短裤套装",1052142, 10000),
Array("轻柔羽绒服",1052143, 10000),
Array("良人装",1052049, 10000),
Array("黑色黑板服",1052048, 10000),
Array("蓝色嘻哈装",1052051, 10000),
Array("红色嘻哈装",1052050, 10000),
Array("熊熊服",1052053, 10000),
Array("日式武士服",1052052, 10000),
Array("黑色皮西装",1052055, 10000),
Array("英国足球服No,7",1052057, 10000),
Array("韩国足球服No.2",1052056, 10000),
Array("法国足球服No.14",1052059, 10000),
Array("巴西足球服No.10",1052058, 10000),
Array("巴西足球服No.9",1052061, 10000),
Array("英国足球服No.8",1052060, 10000),
Array("法国足球服No.10",1052062, 10000),
Array("红健美服",1052032, 10000),
Array("绿健美服",1052033, 10000),
Array("蓝健美服",1052034, 10000),
Array("关公服",1052035, 10000),
Array("诸葛亮服",1052036, 10000),
Array("大厨服",1052037, 10000),
Array("蓝色机器人驾驶员服",1052038, 10000),
Array("蜀皇之服",1052039, 10000),
Array("魏皇之服",1052040, 10000),
Array("吴皇之服",1052041, 10000),
Array("红色机器人驾驶员服",1052042, 10000),
Array("褐色街舞服",1052043, 10000),
Array("健美防寒服",1052044, 10000),
Array("羊毛大衣",1052045, 10000),
Array("雪人服",1052046, 10000),
Array("红色雪板服",1052047, 10000),
Array("大圣装",1052083, 10000),
Array("绿精灵套装",1052082, 10000),
Array("米勒服",1052087, 10000),
Array("肚兜（蓝色）",1052086, 10000),
Array("肚兜（红色）",1052085, 10000),
Array("黄金甲",1052084, 10000),
Array("夏其尔的盔甲",1052091, 10000),
Array("习武服",1052090, 10000),
Array("夜行衣",1052089, 10000),
Array("八戒装",1052094, 10000),
Array("亚努斯的盔甲",1052093, 10000),
Array("比耶莫特的盔甲",1052092, 10000),
Array("木乃伊服",1052067, 10000),
Array("白骨服",1052068, 10000),
Array("绚丽秋装",1052069, 10000),
Array("猫咪泡泡衣",1052074, 10000),
Array("白兔装",1052073, 10000),
Array("泡泡袍",1052078, 10000),
Array("月兔服",1052077, 10000),
Array("天使服",1052030, 10000),
Array("小少爷服",1052031, 10000),
Array("绿色织布和服",1052028, 10000),
Array("褐色风衣",1052029, 10000),
Array("灰色织布和服",1052026, 10000),
Array("赤色织布和服",1052027, 10000),
Array("大官和服",1052024, 10000),
Array("五星背带裤",1052025, 10000),
Array("白秀臀装",1052022, 10000),
Array("黑秀臀装",1052023, 10000),
Array("白连体装",1052020, 10000),
Array("黑连体装",1052021, 10000),
Array("绿勇士马甲",1052018, 10000),
Array("蓝勇士马甲",1052019, 10000),
Array("青色织布和服",1052016, 10000),
Array("红勇士马甲",1052017, 10000),
Array("蓝色织布和服",1052015, 10000),
Array("鸭子服",1052014, 10000),
Array("毕业服",1052013, 10000),
Array("绿画工服",1052012, 10000),
Array("蓝画工服",1052011, 10000),
Array("红画工服",1052010, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖5号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
