/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(

Array("戴米安外套",1053033, 10000),
Array("喵妹套服（女）",1053046, 10000),
Array("喵汉套服（男）",1053045, 10000),
Array("火凤侠女服",1053042, 10000),
Array("青鸾侠客服",1053041, 10000),
Array("鲨鱼服",1053040, 10000),
Array("蓝色萌小象衣服",1053055, 10000),
Array("水菊和服",1053054, 10000),
Array("叶子泡泡连衣裙",1053053, 10000),
Array("叶子泡泡连身裤",1053052, 10000),
Array("鸡仔背带裤",1053051, 10000),
Array("枫叶贵族套服",1053050, 10000),
Array("花栗鼠雨衣",1053049, 10000),
Array("守夜者",1052996, 10000),
Array("北极保暖套服 ",1052997, 10000),
Array("外星人连身服",1052998, 10000),
Array("保罗熊衣服",1052999, 10000),
Array("勃艮第公爵外套",1052994, 10000),
Array("喵喵管家礼服",1052995, 10000),
Array("暖绒兔长裙 ",1053006, 10000),
Array("圣诞鹿玩偶服",1053015, 10000),
Array("暗影小斗篷(女)",1053023, 10000),
Array("暗影套服(男)",1053022, 10000),
Array("大眼猫头鹰玩偶服",1053018, 10000),
Array("春之花卉套服",1053099, 10000),
Array("酸酸企鹅玩偶服",1053098, 10000),
Array("甜甜企鹅玩偶服",1053097, 10000),
Array("晨露妖精衣服",1053096, 10000),
Array("我是超级神奇魔方",1053103, 10000),
Array("我们家的背带裤",1053102, 10000),
Array("灵魂歌手套服",1053091, 10000),
Array("幻灵玉兔(女)",1053090, 10000),
Array("幻灵玉兔(男)",1053089, 10000),
Array("褐色短裙正装",1053088, 10000),
Array("比熊全身衣",1053095, 10000),
Array("万圣节庆典装(女)",1053094, 10000),
Array("万圣节庆典装(男)",1053093, 10000),
Array("锁链公主连衣裙",1053092, 10000),
Array(" 玛农的梦",1053114, 10000),
Array("蛋壳套服",1053115, 10000),
Array("圣诞恋歌(男)",1053118, 10000),
Array("圣诞恋歌(女)",1053119, 10000),
Array("怪猫套服",1053116, 10000),
Array("爱情树套服",1053117, 10000),
Array("冬季兔兔外套(粉色)",1053110, 10000),
Array("万圣节幻影套装",1053108, 10000),
Array("冬季兔兔外套(蓝色)",1053109, 10000),
Array("喵铃铛套服",1053069, 10000),
Array("玄武金刚甲",1053068, 10000),
Array("爆破手套装 ",1053057, 10000),
Array("爆破手套装 ",1053056, 10000),
Array("黑衣人套装",1053059, 10000),
Array("天蓝俏皮小背带",1053058, 10000),
Array("炫彩沙滩裤",1053061, 10000),
Array("炫彩比基尼",1053060, 10000),
Array("",1053062, 10000),
Array("宽版沙滩长袍",1053082, 10000),
Array("人形高级魔方",1053083, 10000),
Array("人形闪炫魔方",1053084, 10000),
Array("人形终极魔方",1053085, 10000),
Array("镰鼬套服",1053086, 10000),
Array("褐色短裤正装",1053087, 10000),
Array("拿破仑制服",1053167, 10000),
Array("伊丽莎白长裙",1053166, 10000),
Array("呱呱雨衣",1053165, 10000),
Array("狐狸先森套服",1053164, 10000),
Array("巨星豹纹礼服",1053163, 10000),
Array("白玫瑰露肩小礼服",1053162, 10000),
Array("救赎之镇魂袍",1053159, 10000),
Array("山茶花套服",1053158, 10000),
Array("潘多拉套服",1053157, 10000),
Array("雪之铃兰小礼服",1053156, 10000),
Array("雪之铃兰蓬蓬裙",1053155, 10000),
Array("执法者套服(男)",1053183, 10000),
Array("粉红丸子服",1053180, 10000),
Array("金吉的午夜马戏团",1053176, 10000),
Array("大侦探套服",1053177, 10000),
Array("布仑兹的蒸汽朋克风",1053174, 10000),
Array("托普的奏鸣曲晚礼服",1053175, 10000),
Array("安博的皇家小夜曲",1053172, 10000),
Array("西博的满月狂想曲",1053173, 10000),
Array("埃伯利的古典梦想",1053170, 10000),
Array("斯卡雷的魔力小子",1053171, 10000),
Array("阿特利埃套装",1053168, 10000),
Array("马伦的缎带小礼服",1053169, 10000),
Array("黄色小鸡套服(男)",1053133, 10000),
Array("奶油甜点礼服",1053132, 10000),
Array("黄色小鸡套服(女)",1053134, 10000),
Array("咯咯嗒娃娃装",1053129, 10000),
Array("蜜蜂服",1053128, 10000),
Array("巧克力甜点礼服",1053131, 10000),
Array("极地探险棉服",1053130, 10000),
Array("白夜叉套服",1053125, 10000),
Array("雪月花套服",1053124, 10000),
Array("心花乱坠机车服(男)",1053127, 10000),
Array("心花乱坠连衣裙(女)",1053126, 10000),
Array("光荣源泉",1053121, 10000),
Array("神圣源泉",1053120, 10000),
Array("瓢啊瓢套服",1053148, 10000),
Array("斗篷校服(男)",1053144, 10000),
Array("斗篷校服(女)",1053145, 10000),
Array("我代表我的心",1053146, 10000),
Array("冒险勇士白虎",1053147, 10000),
Array("柔软妖精服",1053141, 10000),
Array("火箭爆竹服装",1053142, 10000),
Array("守望者套服",1053143, 10000),
Array("喵铃铛套服",1053137, 10000),
Array("超星魔导服",1053138, 10000),
Array("印花长衬衫",1053207, 10000),
Array("小心心透视装",1053205, 10000),
Array("来玩吧套服",1053204, 10000),
Array("扑通西瓜套服",1053203, 10000),
Array("显瘦泳装",1053202, 10000),
Array("潮男泳裤",1053201, 10000),
Array("西瓜小弟背带裤",1053200, 10000),
Array("蓝色迪诺恐龙服",1053215, 10000),
Array("夏日花精灵套装（男）",1053210, 10000),
Array("夏日花精灵套装（女）",1053209, 10000),
Array("嫩黄连身服",1053208, 10000),
Array("粉红大象玩偶服装",1053186, 10000),
Array("冒险星系宇航服",1053187, 10000),
Array("执法者套服(女)",1053184, 10000),
Array("清凉泳衣(男)",1053198, 10000),
Array("西瓜小妹连衣裙",1053199, 10000),
Array("森林密语套服(男)",1053196, 10000),
Array("清凉泳衣(女)",1053197, 10000),
Array("夏日之星连衣裙",1053194, 10000),
Array("森林密语套服(女)",1053195, 10000),
Array("胡萝卜背带裤",1053192, 10000),
Array("俏皮牛仔背带裤",1053232, 10000),
Array("柳德的长袍",1053234, 10000),
Array("软软粉熊套服",1053245, 10000),
Array("巴尼兔小礼服（男）",1053244, 10000),
Array("时尚格纹夹克",1053247, 10000),
Array("软软蓝熊套服",1053246, 10000),
Array("巴尼兔小礼服（女）",1053243, 10000),
Array("喵喵喵玩偶服",1053242, 10000),
Array("羽毛信使套服（男）",1053220, 10000),
Array("魔神套服（女）",1053221, 10000),
Array("魔神套服（男）",1053222, 10000),
Array("黄色迪诺恐龙服",1053216, 10000),
Array("小姐姐套服（女）",1053217, 10000),
Array("小哥哥套服（男）",1053218, 10000),
Array("羽毛信使套服（女）",1053219, 10000),
Array("猫咪育儿背带服（女）",1053228, 10000),
Array("猫咪育儿背带服（男）",1053229, 10000),
Array("苹果兔卫衣",1053230, 10000),
Array("俏皮牛仔背带裙",1053231, 10000),
Array("aa",1053225, 10000),
Array("aa",1053226, 10000),
Array("黑暗军师袍",1053227, 10000),
Array("夏娃秘书机器人礼服",1053270, 10000),
Array("亚当秘书机器人礼服",1053269, 10000),
Array("秘书机器人服装",1053268, 10000),
Array("企鹅女孩探险服",1053250, 10000),
Array("企鹅男孩探险服",1053251, 10000),
Array("卡德娜特工套装（男）",1053254, 10000),
Array("冬日幻想披风",1053255, 10000),
Array("炸虾套服",1053252, 10000),
Array("卡德娜特工套装（女）",1053253, 10000),
Array("雪山套服",1053256, 10000),
Array("人偶的梦想",1053257, 10000),
Array("柴犬背带裙(女)",1053280, 10000),
Array("柴犬背带裤(男)",1053281, 10000),
Array("皇家卫队套服（女）",1053282, 10000),
Array("皇家卫队套服（男）",1053283, 10000),
Array("极地探险棉服",1053284, 10000),
Array("粉色心情套服（男）",1053286, 10000),
Array("粉色心情套服（女）",1053287, 10000),
Array("青森郊游服（男）",1053288, 10000),
Array("青森郊游服（女）",1053289, 10000),
Array("甜心BOY套服（男）",1053290, 10000),
Array("甜心GIRL套服（女）",1053291, 10000),
Array("蔷薇花衬衫",1053292, 10000),
Array("恋恋情人节套服(男)",1053293, 10000),
Array("恋恋情人节套服（女）",1053294, 10000),
Array("红色运动服",1040045, 10000),
Array("白色运动服",1040046, 10000),
Array("黑色运动服",1040047, 10000),
Array("橙色运动服",1040053, 10000),
Array("绿色运动服",1040052, 10000),
Array("橙色翻领运动服",1040055, 10000),
Array("绿色翻领运动服",1040054, 10000),
Array("青色运动服",1040051, 10000),
Array("灰色翻领运动服",1040056, 10000),
Array("橙色棒球服",1040005, 10000),
Array("黑西装",1040001, 10000),
Array("青年装",1040027, 10000),
Array("骷髅T恤",1040101, 10000),
Array("夏威夷花环",1040114, 10000),
Array("乞丐服",1040119, 10000),
Array("校服上衣",1040123, 10000),
Array("绿夹克装",1040125, 10000),
Array("英格兰T恤",1040124, 10000),
Array("蓝心背心",1040127, 10000),
Array("黄蛋糕吊带",1040126, 10000),
Array("黄毛糙服",1040066, 10000),
Array("白毛糙服",1040064, 10000),
Array("灰毛糙服",1040065, 10000),
Array("乖仔衣",1040078, 10000),
Array("西部牛仔上衣",1040077, 10000),
Array("[MS特制橙色运动服",1040190, 10000),
Array("[MS特制橙色翻领运动服",1040191, 10000),
Array("牛仔衬衫",1040186, 10000),
Array("幼儿园服装上衣",1040154, 10000),
Array("巨星摩登上装",1040144, 10000),
Array("蓝少女衫",1040141, 10000),
Array("粉红公主短T",1040140, 10000),
Array("熔岩上装-男款",1040137, 10000),
Array("念珠上衣",1040139, 10000),
Array("冰凌上装-男款",1040138, 10000),
Array("蓝居家服",1040133, 10000),
Array("椰树背心",1040132, 10000),
Array("肌肉人",1040135, 10000),
Array("黄蓝羽绒服",1040134, 10000),
Array("红颓废西装",1040129, 10000),
Array("田径背心",1040128, 10000),
Array("粉领带颓废西装",1040131, 10000),
Array("绿领带颓废西装",1040130, 10000),
Array("真红小背心",1040193, 10000),
Array("绿色兔子T恤",1040192, 10000),
Array("来看胡子背心",1040195, 10000),
Array("菠萝背心",1040194, 10000),
Array("啦啦啦无袖衫",1040197, 10000),
Array("小叶子背心",1040196, 10000),
Array("大佬纹身",1040198, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖5号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
