/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:稀有戒指
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array(" 爱吃胡萝卜兔聊天戒指",1115003, 10000),
Array(" 菠萝甜心聊天戒指",1115005, 10000),
Array(" 蜜蜂聊天戒指",1115004, 10000),
Array(" 咕噜噜聊天戒指",1115007, 10000),
Array(" 公主日记聊天戒指",1115006, 10000),
Array(" 热浪鲨鱼聊天戒指",1115025, 10000),
Array(" 彩色毛毛虫聊天戒指",1115024, 10000),
Array(" 祥云聊天戒指",1115027, 10000),
Array(" 猫咪的线团聊天戒指",1115026, 10000),
Array(" DJ吉姆对话框戒指",1115029, 10000),
Array(" V聊天戒指",1115028, 10000),
Array(" 活力品克缤聊天戒指",1115031, 10000),
Array(" 好吃的巧克力聊天戒指",1115030, 10000),
Array(" 认真聊天戒指",1115033, 10000),
Array(" 蜘蛛聊天戒指",1115032, 10000),
Array(" 浪漫星空聊天戒指",1115035, 10000),
Array(" 冰晶雪花聊天戒指",1115034, 10000),
Array(" 圣诞花环聊天戒指",1115037, 10000),
Array(" BEYOND聊天戒指",1115036, 10000),
Array(" 瓢啊瓢聊天戒指",1115039, 10000),
Array(" 小鸡聊天戒指",1115038, 10000),
Array(" 彩糖聊天戒指",1115009, 10000),
Array(" 绿恐龙聊天戒指",1115008, 10000),
Array(" 吃货小怪兽聊天戒指 ",1115011, 10000),
Array(" 晚安小怪兽聊天戒指 ",1115010, 10000),
Array(" MVP对话框戒指（黄金）",1115013, 10000),
Array(" MVP对话框戒指（白银）",1115012, 10000),
Array(" 雪人的红围巾聊天戒指 ",1115015, 10000),
Array(" MVP对话框戒指（钻石）",1115014, 10000),
Array(" 圣诞对话框戒指",1115017, 10000),
Array(" 雪龟岛聊天戒指",1115016, 10000),
Array(" 戴米安聊天戒指",1115019, 10000),
Array(" 猴子聊天戒指",1115018, 10000),
Array(" 黑魔法师聊天戒指",1115021, 10000),
Array(" 超越石聊天戒指",1115020, 10000),
Array(" 阳光牧场聊天戒指",1115023, 10000),
Array(" 兔子布贴聊天戒指",1115022, 10000),
Array(" 小泰迪聊天戒指",1115057, 10000),
Array(" 影魂聊天戒指",1115056, 10000),
Array(" 梅花物语聊天戒指",1115059, 10000),
Array(" 柯基聊天戒指",1115058, 10000),
Array(" 甜蜜巧克力聊天戒指",1115061, 10000),
Array(" 白色情人节聊天戒指",1115060, 10000),
Array(" 小鸡聊天戒指",1115063, 10000),
Array(" 欢乐城堡聊天戒指",1115062, 10000),
Array(" 守护骑士聊天戒指",1115065, 10000),
Array(" 椰树聊天戒指",1115064, 10000),
Array(" 笔记本聊天戒指",1115066, 10000),
Array(" 桃花狐聊天戒指",1115069, 10000),
Array(" 樱吹雪聊天戒指",1115068, 10000),
Array(" 山茶花聊天戒指",1115041, 10000),
Array(" 女巫炼药聊天戒指",1115040, 10000),
Array(" 治安官对话框戒指",1115043, 10000),
Array(" 小胡子聊天戒指",1115042, 10000),
Array(" NOVA聊天戒指",1115045, 10000),
Array(" 闪亮的埃尔露娜聊天戒指",1115044, 10000),
Array(" 果酱打翻了聊天戒指",1115047, 10000),
Array(" 蜂蜜打翻了聊天戒指",1115046, 10000),
Array(" 浪花聊天戒指",1115049, 10000),
Array(" 万圣节幽灵聊天戒指",1115048, 10000),
Array(" 椰树聊天戒指",1115051, 10000),
Array(" 蝶梦聊天戒指",1115050, 10000),
Array(" 呀！豌豆聊天戒指",1115053, 10000),
Array(" 月亮兔聊天戒指",1115052, 10000),
Array(" 骨碌骨碌聊天戒指",1115055, 10000),
Array(" 血族聊天戒指",1115054, 10000),
Array(" MVP名片戒指（黄金）",1115101, 10000),
Array(" MVP名片戒指（白银）",1115100, 10000),
Array(" 雪龟岛名片戒指",1115103, 10000),
Array(" MVP名片戒指（钻石）",1115102, 10000),
Array(" 蜘蛛名片戒指",1115121, 10000),
Array(" 活力品克缤名片戒指",1115120, 10000),
Array(" 冰晶雪花名片戒指",1115123, 10000),
Array(" 认真名片戒指",1115122, 10000),
Array(" BEYOND名片戒指",1115125, 10000),
Array(" 浪漫星空名片戒指",1115124, 10000),
Array(" 小鸡名片戒指",1115127, 10000),
Array(" 圣诞花环名片戒指",1115126, 10000),
Array(" 女巫炼药名片戒指",1115129, 10000),
Array(" 瓢啊瓢名片戒指",1115128, 10000),
Array(" 小胡子名片戒指",1115131, 10000),
Array(" 山茶花名片戒指",1115130, 10000),
Array(" 闪亮的埃尔露娜名片戒指",1115133, 10000),
Array(" 治安官名片戒指",1115132, 10000),
Array(" 蜂蜜打翻了名片戒指",1115135, 10000),
Array(" NOVA名片戒指",1115134, 10000),
Array(" 猴子名片戒指",1115105, 10000),
Array(" 圣诞名片戒指",1115104, 10000),
Array(" 蓝队名片",1115107, 10000),
Array(" 红队名片",1115106, 10000),
Array(" 超越石名片戒指",1115109, 10000),
Array(" 戴米安名片戒指",1115108, 10000),
Array(" 兔子布贴名片戒指",1115111, 10000),
Array(" 黑魔法师名片戒指",1115110, 10000),
Array(" 彩色毛毛虫名片戒指",1115113, 10000),
Array(" 阳光牧场名片戒指",1115112, 10000),
Array(" 猫咪的线团名片戒指",1115115, 10000),
Array(" 热浪鲨鱼名片戒指",1115114, 10000),
Array(" V名片戒指",1115117, 10000),
Array(" 祥云名片戒指",1115116, 10000),
Array(" 好吃的巧克力名片戒指",1115119, 10000),
Array(" DJ吉姆名片戒指",1115118, 10000),
Array(" 椰树名片戒指",1115153, 10000),
Array(" 小鸡名片戒指",1115152, 10000),
Array(" 笔记本名片戒指",1115155, 10000),
Array(" 守护骑士名片戒指",1115154, 10000),
Array(" 樱吹雪名片戒指",1115157, 10000),
Array(" 桃花狐名片戒指",1115158, 10000),
Array(" 万圣节幽灵名片戒指",1115137, 10000),
Array(" 果酱打翻了名片戒指",1115136, 10000),
Array(" 蝶梦名片戒指",1115139, 10000),
Array(" 浪花名片戒指",1115138, 10000),
Array(" 月亮兔名片戒指",1115141, 10000),
Array(" 椰树名片戒指",1115140, 10000),
Array(" 血族名片戒指",1115143, 10000),
Array(" 呀！豌豆名片戒指",1115142, 10000),
Array(" 影魂名片戒指",1115145, 10000),
Array(" 骨碌骨碌名片戒指",1115144, 10000),
Array(" 柯基名片戒指",1115147, 10000),
Array(" 小泰迪名片戒指",1115146, 10000),
Array(" 白色情人节名片戒指",1115149, 10000),
Array(" 梅花物语名片戒指",1115148, 10000),
Array(" 欢乐城堡名片戒指",1115151, 10000),
Array(" 甜蜜巧克力名片戒指",1115150, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "稀有特殊戒指店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "稀有特殊戒指店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
