/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array("蓬松小尾巴",1102998, 10000),
Array("淘气彩虹",1102999, 10000),
Array("我的喵脚印",1102994, 10000),
Array("超星魔导披风",1102995, 10000),
Array("星座的影子",1102992, 10000),
Array("极地探险背囊",1102991, 10000),
Array("小鸡叽叽叽",1102990, 10000),
Array("美丽低语",1102989, 10000),
Array("雪花的低语",1102988, 10000),
Array("冒险岛5000天披风",1102987, 10000),
Array("白夜叉披风",1102984, 10000),
Array("雪月花伞",1102983, 10000),
Array("涅槃火焰翅膀",1102982, 10000),
Array("爱心蝴蝶结披风",1102981, 10000),
Array("小黑天使之翼",1102980, 10000),
Array("圣诞闪耀",1102978, 10000),
Array("鸡大神的祝福",1102977, 10000),
Array("星星糖粉",1102976, 10000),
Array("不要太热闹",1102961, 10000),
Array("紫色之梦",1102960, 10000),
Array("羁绊之翼",1102963, 10000),
Array("萤火虫之舞",1102965, 10000),
Array("轻盈的心动",1102964, 10000),
Array("万圣节幻影",1102967, 10000),
Array("今日天气 : 晴",1102969, 10000),
Array("冰封之翼",1102968, 10000),
Array("今日天气 : 雷",1102971, 10000),
Array("今日天气 : 雨",1102970, 10000),
Array("凌晨的宝石",1102973, 10000),
Array("冬木翅膀",1102972, 10000),
Array("怪猫气球",1102975, 10000),
Array("小星光水波",1102974, 10000),
Array("我的喵脚印",1102945, 10000),
Array("无忧花环",1102946, 10000),
Array("New天使祖母绿",1102947, 10000),
Array("小霓虹之翼",1102948, 10000),
Array("纯粹之翼",1102949, 10000),
Array("彩虹气泡",1102950, 10000),
Array("冰淇淋之友",1102951, 10000),
Array("镰鼬尾巴",1102953, 10000),
Array("猫头鹰披风",1102954, 10000),
Array("月兔铃音",1102955, 10000),
Array("灵魂歌手披风",1102956, 10000),
Array("锁链公主披风",1102957, 10000),
Array("夜蝙蝠披风",1102958, 10000),
Array("永恒之梦",1102959, 10000),
Array("枫叶贵族披风",1102931, 10000),
Array("雨滴滴滴",1102930, 10000),
Array("全黑的恶魔",1102929, 10000),
Array("粉红蝴蝶精灵",1102928, 10000),
Array("北风那个吹",1102935, 10000),
Array("雪精灵",1102934, 10000),
Array("阿丽莎之花翼",1102933, 10000),
Array("阿丽莎的翅膀",1102932, 10000),
Array("中式祥云披风",1102939, 10000),
Array("幻想中的海滩",1102938, 10000),
Array("动物总动员披风",1102937, 10000),
Array("森林的低语",1102936, 10000),
Array("蓝色蝴蝶之舞",1102914, 10000),
Array("缪斯的蝴蝶精灵",1102915, 10000),
Array("妖异的火焰",1102912, 10000),
Array("胖胖雪人气球",1102805, 10000),
Array("可爱小绵羊披风",1102806, 10000),
Array("金鱼披风",1102807, 10000),
Array("暖棉棉披风",1102800, 10000),
Array("银色的狼披风",1102801, 10000),
Array("圆圆水晶魔球",1102802, 10000),
Array("漂亮品克缤气球",1102803, 10000),
Array("决战！暴雪！",1102812, 10000),
Array("肩膀上的布兰奇",1102813, 10000),
Array("福袋",1102815, 10000),
Array("啵啵鼠气球",1102808, 10000),
Array("死亡华尔兹",1102809, 10000),
Array("雪花飘飘",1102811, 10000),
Array("双色梦幻之翼",1102823, 10000),
Array("花语",1102822, 10000),
Array("朦胧的夜晚",1102820, 10000),
Array("小淘气披风",1102819, 10000),
Array("星星幻想披风",1102818, 10000),
Array(" 闪亮小叮当",1102816, 10000),
Array("高飞",1102831, 10000),
Array("王的披风",1102827, 10000),
Array("双色幻想之翼",1102824, 10000),
Array("薄荷喵漫游仙境",1102836, 10000),
Array("盗梦空间",1102837, 10000),
Array("海贼团披风 ",1102835, 10000),
Array("机械披风",1102832, 10000),
Array("莲花学院守护魂火",1102847, 10000),
Array("鼠鼠和兔兔",1102844, 10000),
Array("蓝嘟嘟熊披风",1102845, 10000),
Array("菠萝斜挎包",1102842, 10000),
Array("粉红四翼天使",1102843, 10000),
Array("爱莉丝的泡泡",1102841, 10000),
Array("蒼穹之翼",1102604, 10000),
Array("暗炎赎罪者",1102605, 10000),
Array("蝙蝠魔气球",1102592, 10000),
Array("浮漾的棒球",1102593, 10000),
Array("拉兹丽之精气",1102617, 10000),
Array("拉比斯之精气",1102616, 10000),
Array("喜欢冰的小企鹅",1102619, 10000),
Array("啰嗦扩音器",1102621, 10000),
Array("我的烟火秀",1102620, 10000),
Array("时间旅行者的怀表",1102622, 10000),
Array("粉色旋律翅膀",1102609, 10000),
Array("超级巨星水晶魔球",1102608, 10000),
Array("普赛克旋律",1102611, 10000),
Array("普赛克时空",1102610, 10000),
Array("熊宝宝发条",1102615, 10000),
Array("岩炎赎罪披风",1102632, 10000),
Array("天王星光芒之翼",1102624, 10000),
Array("蜗牛披风",1102625, 10000),
Array("浪漫四翼天使",1102630, 10000),
Array("万圣节幻影披风",1102631, 10000),
Array("粉红四翼天使",1102629, 10000),
Array("小熊猫尾巴",1102651, 10000),
Array("隐月狐尾",1102650, 10000),
Array("K君的猫尾巴",1102648, 10000),
Array("熊熊尾巴",1102655, 10000),
Array("狗狗尾巴",1102654, 10000),
Array("兔尾巴",1102653, 10000),
Array("松鼠尾巴",1102652, 10000),
Array("金色之翼",1102643, 10000),
Array("烈焰之翼",1102646, 10000),
Array("粉色光芒之翼",1102644, 10000),
Array("夜天使之翼",1102668, 10000),
Array("壕",1102669, 10000),
Array("肃清者的荆翼",1102671, 10000),
Array("雪之女神围脖",1102665, 10000),
Array("寻找满月",1102667, 10000),
Array("动物尾巴6",1102656, 10000),
Array("动物尾巴7",1102657, 10000),
Array("动物尾巴8",1102658, 10000),
Array("真·高贵之神",1102659, 10000),
Array("熊宝宝披风",1102685, 10000),
Array("未来医生听诊器",1102684, 10000),
Array("兔兔熊背包",1102683, 10000),
Array("未来天使注射器",1102682, 10000),
Array("摇摆猫咪酱",1102676, 10000),
Array("僵尸新娘披风",1102673, 10000),
Array("唠叨话喇叭",1102672, 10000),
Array("糖果甜甜蝴蝶结",1102675, 10000),
Array("小小寿司团",1102674, 10000),
Array("红色蝴蝶羽翼",1102702, 10000),
Array("蓝色蝴蝶羽翼",1102703, 10000),
Array("蓝色光芒之翼",1102700, 10000),
Array("翠绿之翼",1102698, 10000),
Array("岩浆之翼",1102699, 10000),
Array("红色蜻蜓翅膀",1102697, 10000),
Array("迷你迷你绿水灵",1102694, 10000),
Array("灵魂九尾狐披风",1102695, 10000),
Array("小小寿司团",1102692, 10000),
Array("柴郡猫的狐狸围脖",1102690, 10000),
Array("双色砰砰炮",1102688, 10000),
Array("梦寐不忘度假胜地",1102712, 10000),
Array("双色糖果翅膀",1102709, 10000),
Array("粉色梦想海螺",1102708, 10000),
Array("蓝色梦想海螺",1102707, 10000),
Array("极光音符披风",1102706, 10000),
Array("背着海鸥去旅行",1102705, 10000),
Array(" 精灵翅膀",1102704, 10000),
Array("夜光法师四翼天使",1102487, 10000),
Array("阳光明媚",1102491, 10000),
Array("蛋糕杯气球",1102488, 10000),
Array("高贵之神",1102466, 10000),
Array("银河牛仔披风",1102465, 10000),
Array("黑暗力量披风",1102512, 10000),
Array("超级蜜蜂妖精翅膀",1102496, 10000),
Array("[MS特价我的朋友九尾狐尾巴",1102501, 10000),
Array("猫咪洛丽塔披风",1102503, 10000),
Array("考拉披风",1102508, 10000),
Array("圣洁四翼天使",1102511, 10000),
Array("猫尾莎啦啦",1102510, 10000),
Array("绿宝石翅膀",1102550, 10000),
Array("蓝宝石翅膀",1102551, 10000),
Array("绿色幻想之翼",1102548, 10000),
Array("管家的猫咪",1102549, 10000),
Array("蓝色幻想之翼",1102546, 10000),
Array("粉色幻想之翼",1102547, 10000),
Array("信天翁披风",1102544, 10000),
Array("信天翁披风",1102545, 10000),
Array("鬼娃娃之翼",1102554, 10000),
Array("大天使的翅膀",1102555, 10000),
Array("光芒智天使",1102532, 10000),
Array("僵尸猎人披风",1102531, 10000),
Array("奥兹魔法披风",1102543, 10000),
Array("胡克的船长披风",1102542, 10000),
Array("星尘披肩",1102537, 10000),
Array("GM队长的露西娅披风",1102582, 10000),
Array("宝宝龙波比",1102583, 10000),
Array("诺克斯四翼天使",1102576, 10000),
Array("银色天使",1102577, 10000),
Array("黑暗光芒之翼",1102588, 10000),
Array("精灵光芒之翼",1102589, 10000),
Array("口袋怪物胜利者披风",1102591, 10000),
Array("安琪莉可的光环",1102587, 10000),
Array("天衣无缝",1102564, 10000),
Array("格拉泰斯光芒之翼",1102572, 10000),
Array("路易斯四翼天使",1102575, 10000),
Array("小鸡叽叽叽",1102574, 10000),
Array("精灵精神披风",1102367, 10000),
Array("怪盗幻影披风",1102355, 10000),
Array("自由的翅膀",1102353, 10000),
Array("胖胖雪人气球",1102359, 10000),
Array("圆圆水晶魔球",1102358, 10000),
Array("漂亮品克缤气球",1102357, 10000),
Array("天使祖母绿",1102356, 10000),
Array("精灵王的披风",1102344, 10000),
Array("粉红微笑胖鬼怪",1102350, 10000),
Array("发光精灵翅膀",1102349, 10000),
Array("小蜜蜂翅膀",1102338, 10000),
Array("炼金师的披风",1102336, 10000),
Array("军团长的披风",1102343, 10000),
Array("西式风情披风",1102392, 10000),
Array("路易斯四翼天使",1102385, 10000),
Array("海龙尾巴",1102387, 10000),
Array("诺克斯四翼天使",1102386, 10000),
Array("金色天使",1102389, 10000),
Array("炎龙尾巴",1102388, 10000),
Array("小蜜蜂翅膀",1102391, 10000),
Array("银色天使",1102390, 10000),
Array("粉色旋律翅膀",1102376, 10000),
Array("普赛克时空",1102377, 10000),
Array("普赛克旋律",1102378, 10000),
Array("我的朋友青蛙酱",1102380, 10000),
Array("皇家公爵翅膀",1102381, 10000),
Array("落英飞天丝带",1102368, 10000),
Array("露西娅披风",1102373, 10000),
Array("飞行小猴披风",1102374, 10000),
Array("圆滚滚的微笑柠檬",1102421, 10000),
Array("星尘披肩",1102420, 10000),
Array("露西娅披风",1102419, 10000),
Array("粉嫩披风",1102461, 10000),
Array("树妖",1102453, 10000),
Array("精灵光芒之翼",1102452, 10000),
Array("黑暗光芒之翼",1102451, 10000),
Array("天使光芒之翼",1102450, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "稀有披风店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖5号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
