/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能:椅子专卖
 *  @Author 娜娜 
 */
var status = 0;
var choice;
var scrolls = Array(
Array(" 流星雨短裙",1061207, 10000),
Array(" 天津四短裙",1061208, 10000),
Array(" 真红皮裙",1061209, 10000),
Array(" 英伦风裙裤",1061210, 10000),
Array(" 绿色蓬纱短裙",1061211, 10000),
Array(" 白色夏日短裙",1061212, 10000),
Array(" 冰蓝绒球绵裙",1061213, 10000),
Array(" 啦啦啦斑点裙",1061214, 10000),
Array(" 白牛仔裤",1062000, 10000),
Array(" 蓝牛仔裤",1062001, 10000),
Array(" 褐色皮制裤",1062002, 10000),
Array(" 红色街舞裤",1062003, 10000),
Array(" 绿色皮裤",1062004, 10000),
Array(" 蓝色街舞裤",1062005, 10000),
Array(" 打猎裤",1062006, 10000),
Array(" 维泽特西裤",1062007, 10000),
Array(" 粉红马裤",1062008, 10000),
Array(" 绿色马裤",1062009, 10000),
Array(" 淡蓝马裤",1062010, 10000),
Array(" 蓝色棒球裤",1062011, 10000),
Array(" 白色棒球裤",1062012, 10000),
Array(" 灰色棒球裤",1062013, 10000),
Array(" 黑蓝色棒球裤",1062014, 10000),
Array(" 个性牛仔裤",1062015, 10000),
Array(" 荒野枪手中裤",1062032, 10000),
Array(" 红方格子裤",1062033, 10000),
Array(" 白方格子裤",1062034, 10000),
Array(" 黑骷髅皮裤",1062035, 10000),
Array(" 褐线街舞裤",1062038, 10000),
Array(" 白色牛仔裤",1062039, 10000),
Array(" 浅蓝嘻哈裤",1062040, 10000),
Array(" 深蓝嘻哈裤",1062041, 10000),
Array(" 挂链牛仔裤",1062042, 10000),
Array(" 黑色简洁长裤",1062043, 10000),
Array(" 红星短裤",1062044, 10000),
Array(" 补膝劳动裤",1062045, 10000),
Array(" 复古牛仔裤",1062046, 10000),
Array(" 白底格纹中裤",1062047, 10000),
Array(" 黄色滑板裤",1062016, 10000),
Array(" 绿色滑板裤",1062017, 10000),
Array(" 紧身牛仔裤",1062018, 10000),
Array(" 粉红滑雪裤",1062019, 10000),
Array(" 淡蓝滑雪裤",1062020, 10000),
Array(" 蓝色短裤",1062021, 10000),
Array(" 褐色军裤",1062022, 10000),
Array(" 亮点街舞裤",1062023, 10000),
Array(" 野战军裤",1062024, 10000),
Array(" 蓝便装裤",1062025, 10000),
Array(" 红便装裤",1062026, 10000),
Array(" 囚裤",1062027, 10000),
Array(" 郊游牛仔短裤",1062028, 10000),
Array(" 蓝色篮球短裤",1062029, 10000),
Array(" 橙色篮球短裤",1062030, 10000),
Array(" 黄格子裤",1062031, 10000),
Array(" 青苹果裤",1062064, 10000),
Array(" 天蓝线裤",1062065, 10000),
Array(" 白色破洞牛仔裤",1062066, 10000),
Array(" 夏日七分牛仔裤",1062067, 10000),
Array(" 彩虹裤",1062068, 10000),
Array(" 低腰咖啡长裤",1062069, 10000),
Array(" 小熊补丁牛仔裤",1062070, 10000),
Array(" 洞洞牛仔裤",1062071, 10000),
Array(" BAND牛仔裤",1062072, 10000),
Array(" 橄榄色南瓜裤",1062073, 10000),
Array(" 褐色南瓜裤",1062074, 10000),
Array(" 黑色个性牛仔裤",1062075, 10000),
Array(" 水洗个性牛仔裤",1062076, 10000),
Array(" 黄色茸茸球裤子",1062077, 10000),
Array(" 褐色格纹裤",1062048, 10000),
Array(" 星星丹宁裤",1062051, 10000),
Array(" 白色水洗牛仔裤",1062052, 10000),
Array(" 粉边白短裤",1062053, 10000),
Array(" 南瓜裤",1062054, 10000),
Array(" 蓝条沙滩裤",1062055, 10000),
Array(" 军用魔龙裤",1062056, 10000),
Array(" 格子花纹裤",1062057, 10000),
Array(" 燃烧的牛仔裤",1062058, 10000),
Array(" 黑色仿旧牛仔裤",1062059, 10000),
Array(" 蓝色怀旧牛仔裤",1062060, 10000),
Array(" 橄榄色怀旧牛仔裤",1062061, 10000),
Array(" 玫瑰色怀旧牛仔裤",1062062, 10000),
Array(" 直筒蓝色牛仔裤",1062063, 10000),
Array(" 卡其色休闲短裤",1062096, 10000),
Array(" 牛仔工装长裤",1062097, 10000),
Array(" 水叮当牛仔裤",1062098, 10000),
Array(" HIP-HOP个性牛仔裤",1062100, 10000),
Array(" 卷边牛仔裤",1062101, 10000),
Array(" 星星牛仔裤",1062102, 10000),
Array(" 炫彩中裤",1062103, 10000),
Array(" 红链褐色牛仔裤",1062104, 10000),
Array(" 及膝蓝色马裤",1062105, 10000),
Array(" 兔纹萝莉裤",1062106, 10000),
Array(" 明星长裤",1062107, 10000),
Array(" 仿旧牛仔裤",1062108, 10000),
Array(" 嫩黄修身裤",1062109, 10000),
Array(" baby粉色灯笼裤",1062110, 10000),
Array(" 蓝色蝴蝶结短裤",1062111, 10000),
Array(" 粉嘟嘟罗莉服",1062080, 10000),
Array(" 喜洋洋兔兔裤",1062081, 10000),
Array(" 红樱桃低腰裤",1062082, 10000),
Array(" 小兜兜七分裤",1062083, 10000),
Array(" 细身牛仔裤",1062084, 10000),
Array(" 修身小西裤",1062085, 10000),
Array(" 变身用黑军官裙",1062086, 10000),
Array(" 变身用红守护裤",1062087, 10000),
Array(" 变身用黑夜裤",1062088, 10000),
Array(" 紫色做旧休闲短裤",1062089, 10000),
Array(" 黑灰格子短裤",1062091, 10000),
Array(" 斜纹红西裤",1062092, 10000),
Array(" 嫩绿休闲短裤",1062093, 10000),
Array(" 休闲夏日短裤",1062094, 10000),
Array(" 米兰牛仔裤",1062095, 10000),
Array(" 点点红休闲裤",1062129, 10000),
Array(" 点点蓝休闲裤",1062130, 10000),
Array(" 白色卷边牛仔裤",1062131, 10000),
Array(" 星纹运动裤",1062133, 10000),
Array(" POP短裤",1062134, 10000),
Array(" 精英裤子",1062135, 10000),
Array(" 分层斜纹短裤",1062136, 10000),
Array(" 牛奶果子露短裤",1062137, 10000),
Array(" 薄荷色做旧牛仔裤",1062138, 10000),
Array(" 天真系短裤",1062139, 10000),
Array(" [派对]白色西裤",1062140, 10000),
Array(" [派对]蓝色怀旧牛仔裤",1062141, 10000),
Array(" [派对]橄榄色怀旧牛仔裤",1062142, 10000),
Array(" [派对]红超短裙",1062143, 10000),
Array(" 内裤",1062112, 10000),
Array(" 彩铅短裤",1062113, 10000),
Array(" 心心相印裤",1062114, 10000),
Array(" 朴素的武士裤",1062115, 10000),
Array(" 星星沙滩裤",1062116, 10000),
Array(" 暴雪牛仔裤",1062118, 10000),
Array(" 糖果纹裤子",1062119, 10000),
Array(" 迷彩裤",1062121, 10000),
Array(" 格子卷边裤",1062122, 10000),
Array(" 高空行进裤",1062123, 10000),
Array(" 娃娃裤",1062124, 10000),
Array(" 紫条纹短裤",1062126, 10000),
Array(" 超级古怪木琴紧身裤",1062160, 10000),
Array(" [MS特制]红方格子裤",1062161, 10000),
Array(" 超级海蓝长筒袜",1062162, 10000),
Array(" 蛇年嘻哈裤",1062163, 10000),
Array(" 魔术师战士短裤",1062165, 10000),
Array(" 魔术师丹维奇短裤",1062166, 10000),
Array(" 魔术师游侠短裤",1062167, 10000),
Array(" 魔术师刺客短裤",1062168, 10000),
Array(" 魔术师流浪者短裤",1062169, 10000),
Array(" 大明星短裤",1062171, 10000),
Array(" 芭比格子塑身裤",1062172, 10000),
Array(" [派对]棉袜套牛仔短裙",1062144, 10000),
Array(" 古怪木琴紧身裤",1062145, 10000),
Array(" 打猎裤",1062146, 10000),
Array(" 蓝色小裤衩",1062147, 10000),
Array(" 运动会优胜组短裤",1062148, 10000),
Array(" 白银三叶草裤子",1062149, 10000),
Array(" 黄金三叶草裤子",1062150, 10000),
Array(" 爱丽丝兔裤",1062151, 10000),
Array(" 荧光粉长裤",1062152, 10000),
Array(" 假日斜纹短裤",1062153, 10000),
Array(" 分层斜纹短裤",1062154, 10000),
Array(" 海蓝色水洗牛仔短裤",1062155, 10000),
Array(" 紫色马赛克短裤",1062156, 10000),
Array(" 草莓巧克力短裤",1062157, 10000),
Array(" 2013运动会优胜组短裤",1062158, 10000),
Array(" 超级草莓巧克力短裤",1062159, 10000)
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "稀有点装2号店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
                var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "椅子专卖2号店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
