status = -1;
var itemList = Array(
    Array(2430210, 600, 1, 3),  //女神之泪
    Array(2048723, 300, 1, 3), //女神之血滴
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(5062024, 500, 1, 3),  //神话耳环
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    Array(2048708, 300, 1, 3), // 繁星椅子, 300, 1, 3), // 由中国玩家"小术"设计的的夏日天空星星椅子。每10秒中恢复HP，MP各500。
    Array(2614008, 400, 1, 3), // 阿卡伊勒童话书椅子, 300, 1, 3), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614014, 300, 1, 3), // 我的女皇椅子, 300, 1, 3), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614002, 200, 1, 3), // 生日快乐，恶魔, 300, 1, 3), // 坐在椅子上的恶魔猎手的表情感觉很奇怪。每10秒HP恢复100，MP恢复50。
    Array(3015820, 200, 1, 3), // 迷你神兽椅子, 300, 1, 3), // 坐在迷你神兽椅子上时，每10秒HP恢复50，MP恢复50。
    Array(3015712, 200, 1, 3), // 摆钟椅子, 300, 1, 3), // 坐在钟摆椅子上时，每10秒HP恢复50，MP恢复50。
    Array(3015633, 200, 1, 3), // 宝石枫叶椅子, 300, 1, 3), // 用宝石做成的闪亮枫叶椅子。坐下后每10秒恢复HP 40, MP 20。
    Array(2614004, 300, 1, 3), // 热情的红色药水椅子, 300, 1, 3), // 和其他药水椅子相比，可以更快地恢复HP的红色药水椅子。每10秒HP恢复110，MP恢复50。
    Array(2435824, 100, 1, 3), // V卷箱子
    Array(3994417, 40, 1, 3), // 蜡笔
    Array(3994422, 40, 1, 3), // 蜡笔
    Array(1112968, 300, 1, 3), // 公沙沙兔靠垫, 300, 1, 3), // 靠着可爱的公沙沙兔坐着，每10秒HP恢复60。
    Array(3015545, 200, 1, 3), // 海蓝天鹅绒沙发, 300, 1, 3), // 奢华的海蓝色天鹅绒沙发。坐在上面，每10秒HP恢复60。
    Array(3015327, 200, 1, 3), // 红色设计师椅子, 300, 1, 3), // 采用明亮红色的设计师椅子。坐在上面，每10秒HP恢复60。
    Array(3015181, 200, 1, 3), // 艾莉珍椅子, 300, 1, 3), // 可以成为可爱的少女艾莉珍的好朋友。每10秒HP恢复50，MP恢复50。
    Array(3015178, 200, 1, 3), // 红帽月妙抱枕椅, 300, 1, 3), // 坐在抱枕椅上就可以看到戴著红色帽子的可爱月妙的才艺。
    Array(3015688, 200, 1, 3), // 蓝帽月妙抱枕椅, 300, 1, 3), // 坐在抱枕椅上就可以看到戴著蓝色帽子的可爱月妙的才艺。
    Array(3015690, 200, 1, 3), // 扇子月妙抱枕椅, 300, 1, 3), // 坐在抱枕椅上就可以观赏拿著扇子走绳索的月妙的才艺。
    Array(3015653, 200, 1, 3), // 太平萧月妙抱枕椅, 300, 1, 3), // 坐在抱枕椅上就可以观赏史出浑身力量演奏的月妙。
    Array(3015642, 200, 1, 3), // 恶灵附身的娃娃椅子, 300, 1, 3), // 恶灵附身的娃娃椅子。坐在上面，每10秒HP恢复50。
    Array(4000463, 600, 1, 3), //神话耳环蓝图
    Array(2435824, 100, 1, 3), // V卷箱子
    Array(2048723, 300, 1, 3), //女神之血滴
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(2435824, 100, 1, 3), // V卷箱子
    Array(5062024, 500, 1, 3),  //神话耳环
    Array(2436363, 40, 1, 3), // VVVIP盒子
    Array(2048708, 300, 1, 3), // 繁星椅子, 300, 1, 3), // 由中国玩家"小术"设计的的夏日天空星星椅子。每10秒中恢复HP，MP各500。
    Array(2614008, 400, 1, 3), // 阿卡伊勒童话书椅子, 300, 1, 3), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614014, 300, 1, 3), // 我的女皇椅子, 300, 1, 3), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614002, 200, 1, 3), // 生日快乐，恶魔, 300, 1, 3), // 坐在椅子上的恶魔猎手的表情感觉很奇怪。每10秒HP恢复100，MP恢复50。	Array(4000463, 600, 1, 3), //神话耳环蓝图
    Array(2430210, 600, 1, 3),  //女神之泪
    Array(2436256, 30, 1, 3), // 神秘之影
    Array(1113056, 30, 1, 3), // 神秘之影
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(5062024, 500, 1, 3),  //神话耳环
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    Array(2048708, 300, 1, 3), // 繁星椅子, 300, 1, 3), // 由中国玩家"小术"设计的的夏日天空星星椅子。每10秒中恢复HP，MP各500。
    Array(2614008, 400, 1, 3), // 阿卡伊勒童话书椅子, 300, 1, 3), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614014, 300, 1, 3), // 我的女皇椅子, 300, 1, 3), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614002, 200, 1, 3), // 生日快乐，恶魔, 300, 1, 3), // 坐在椅子上的恶魔猎手的表情感觉很奇怪。每10秒HP恢复100，MP恢复50。	Array(4000463, 600, 1, 3), //神话耳环蓝图
    Array(2430210, 600, 1, 3),  //女神之泪
    Array(2435824, 100, 1, 3), // V卷箱子
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(2430210, 500, 1, 3),  //神话耳环
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    Array(2048708, 300, 1, 3), // 繁星椅子, 300, 1, 3), // 由中国玩家"小术"设计的的夏日天空星星椅子。每10秒中恢复HP，MP各500。
    Array(2614008, 400, 1, 3), // 阿卡伊勒童话书椅子, 300, 1, 3), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614014, 300, 1, 3), // 我的女皇椅子, 300, 1, 3), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614002, 200, 1, 3), // 生日快乐，恶魔, 300, 1, 3), // 坐在椅子上的恶魔猎手的表情感觉很奇怪。每10秒HP恢复100，MP恢复50。	Array(4000463, 600, 1, 3), //神话耳环蓝图
    Array(4000463, 600, 1, 3),  //女神之泪
    Array(2048723, 300, 1, 3), //女神之血滴
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(3994419, 40, 1, 3), // 蜡笔
    Array(5062024, 500, 1, 3),  //神话耳环
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    Array(3994422, 40, 1, 3), // 蜡笔
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(3994420, 40, 1, 3), // 蜡笔
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(2436383, 30, 1, 3), // 特米纳斯
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    //130装备
    Array(4000463, 600, 1, 3), //神话耳环蓝图
    Array(2430210, 600, 1, 3),  //女神之泪
    Array(2048723, 300, 1, 3), //女神之血滴
    Array(2435824, 150, 1, 3), // V卷箱子
    Array(2436262, 40, 1, 3), // 露西德机器人
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(5062024, 500, 1, 3),  //神话耳环
    Array(3994418, 40, 1, 3), // 蜡笔
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    Array(2048708, 300, 1, 3), // 繁星椅子, 300, 1, 3), // 由中国玩家"小术"设计的的夏日天空星星椅子。每10秒中恢复HP，MP各500。
    Array(2614008, 400, 1, 3), // 阿卡伊勒童话书椅子, 300, 1, 3), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614014, 300, 1, 3), // 我的女皇椅子, 300, 1, 3), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614002, 200, 1, 3), // 生日快乐，恶魔, 300, 1, 3), // 坐在椅子上的恶魔猎手的表情感觉很奇怪。每10秒HP恢复100，MP恢复50。	Array(4000463, 600, 1, 3), //神话耳环蓝图
    Array(2435824, 100, 1, 3), // V卷箱子
    Array(2048723, 300, 1, 3), //女神之血滴
    Array(2048721, 300, 1, 3),  //绝对之戒
    Array(4000463, 600, 1, 3),  //终极魔方
    Array(5062024, 500, 1, 3),  //神话耳环
    Array(2048704, 300, 1, 3),  //星火幸运箱子
    Array(2048708, 300, 1, 3), // 繁星椅子, 300, 1, 3), // 由中国玩家"小术"设计的的夏日天空星星椅子。每10秒中恢复HP，MP各500。
    Array(2614008, 400, 1, 3), // 阿卡伊勒童话书椅子, 300, 1, 3), // 感觉和阿卡伊勒的关系好像变得亲近一些的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614014, 300, 1, 3), // 我的女皇椅子, 300, 1, 3), // 可以感觉到女王的火热人气的椅子。每10秒HP恢复100，MP恢复50。
    Array(2614002, 200, 1, 3)
        );
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 410);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
			var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			item = cm.gainGachaponItem(itemId, quantity, "进阶露西德", notice);
        } else {
			cm.dispose();
            //cm.sendOk("今天的运气可真差，什么都没有拿到。");
        }
		
		var chance1 = Math.floor(Math.random() * 510);
        var finalitem1 = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem1.push(itemList[i]);
            }
        }
        if (finalitem1.length != 0) {
            var item1;
            var random = new java.util.Random();
			var finalchance1 = random.nextInt(finalitem1.length);
            var itemId1 = finalitem1[finalchance1][0];
            var quantity1 = finalitem1[finalchance1][2];
            var notice = finalitem1[finalchance1][3];
			item1 = cm.gainGachaponItem(itemId1, quantity1, "进阶露西德", notice);
        } else {
			cm.dispose();
            //cm.sendOk("今天的运气可真差，什么都没有拿到。");
        }
		
		var chance2 = Math.floor(Math.random() * 610);
        var finalitem2 = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem2.push(itemList[i]);
            }
        }
        if (finalitem2.length != 0) {
            var item2;
            var random = new java.util.Random();
			var finalchance2 = random.nextInt(finalitem2.length);
            var itemId2 = finalitem2[finalchance2][0];
            var quantity2 = finalitem2[finalchance2][2];
            var notice = finalitem2[finalchance2][3];
			item2 = cm.gainGachaponItem(itemId2, quantity2, "进阶露西德", notice);
        } else {
			cm.dispose();
            //cm.sendOk("今天的运气可真差，什么都没有拿到。");
        }
		cm.dispose();
		cm.warp(910000000, 0);
    }
}