/*  This is mada by 娜娜    
 *  This source is made by BMS Team
 *  脚本功能：骑宠专卖店
 *  @Author 娜娜 
 */

var status = 0;
var choice;
var scrolls = Array(
		Array("幽灵马车骑宠", 2432518, 10000),
		Array("摩托艇骑宠", 2432821, 10000),
		Array("蛋糕骑宠", 2433292, 10000),
		Array("美羊羊骑宠", 2433497, 10000),
		Array("喜羊羊骑宠", 2433742, 10000),
		Array("黑色天使骑宠", 2434084, 10000),
		Array("拯救骑宠", 2433836, 10000),
		Array("王权马车骑宠", 2433876, 10000),
		Array("金鱼出租车骑宠", 2434082, 10000),
		Array("金龙鱼骑宠", 2433889, 10000),
		Array("盖奥勒克骑宠", 2434142, 10000),
		Array("粉碎机骑宠", 2434143, 10000),
		Array("天狗骑宠", 2434618, 10000),
		Array("雪地摩托", 2437798, 10000),
		Array("花花象骑宠", 2439151, 10000),
		Array("丑陋的直升机明星骑宠", 2434079, 10000),
		Array("白魔法师和雪原永久骑宠", 2438109, 10000),
		Array("奥尔卡和雪原永久骑宠交换券", 2432349, 10000),
		Array("希纳斯和雪原永久骑宠交换券", 2432348, 10000),
		Array("南哈特和雪原永久骑宠交换券", 2432347, 10000),
		Array("鳄鱼骑宠30天使用券", 2439215, 10000),
		Array("永久鸵鸟推车骑宠优惠券", 2435113, 10000),
		Array("蹦跶蹦跶小狐狸骑宠", 2436407, 10000),
		Array("与鸭共浴骑宠", 2437125, 10000),
		Array("闪耀帆船航行骑宠", 2437123, 10000),
		Array("爱心星座骑宠", 2436837, 10000),
		Array("战斗飞艇骑宠使用券", 2432006, 10000),
		Array("鬼畜发条鸡", 2436472, 10000),
		Array("双花蘑菇骑宠30天券", 2430991, 10000),
		Array("小纸船骑宠", 2435279, 10000),
		Array("好栗子骑宠", 2437809, 10000),
		Array("海加顿之拳骑宠使用券", 2432007, 10000),
		Array("夜光星骑宠交换券", 2439211, 10000),
		Array("雪花魔法阵骑宠永久交换券", 2435091, 10000),
		Array("藏獒骑宠90天使用券", 2430994, 10000),
		Array("蒸汽气缸翅膀骑宠永久交换券", 2435089, 10000),
		Array("老式战船骑宠90天券", 2432029, 10000),
		Array("喷气式滑艇骑宠永久劵", 2433053, 10000),
		Array("潜水艇骑宠永久券", 2434077, 10000),
		Array("猫咪手推车骑宠永久劵", 2433051, 10000),
		Array("好友骑宠永久券", 2432031, 10000),
		Array("夜晚火车骑宠永久券", 2434517, 10000),
		Array("石像鬼骑宠永久券", 2432030, 10000),
		Array("纷飞吧韩字骑宠交换券", 2436126, 10000),
		Array("巨大公鸡骑宠30天券", 2432099, 10000),
		Array("蝙蝠魔骑宠卷", 2430050, 10000),
		Array("夏日清凉喷水车骑宠永久券", 2439266, 10000),
		Array("幻龙骑宠永久使用券", 2432110, 10000),
		Array("巨大怪兽骑宠券", 2439278, 10000),
		Array("与你相伴幻影骑宠使用券", 2432105, 10000),
		Array("摇摆木马骑宠90天使用券", 2432104, 10000),
		Array("欢乐卟卟车骑宠", 2435185, 10000),
		Array("LV骑宠", 2434163, 10000),
		Array("青炎黑暗魂兽骑宠券", 2439295, 10000),
		Array("香蕉船骑宠交换券", 2437240, 10000),
		Array("火焰独角兽骑宠", 2439036, 10000),
		Array("老海盗的俘虏骑宠", 2431764, 10000),
		Array("圣诞是劳动的日子骑宠", 2436167, 10000),
		Array("地狱犬骑宠永久券", 2432078, 10000),
		Array("海豚骑宠永久券", 2432085, 10000),
		Array("樱花烂漫自行车骑宠", 2436183, 10000),
		Array("弹跳小鹿骑宠", 2436185, 10000),
		Array("梦幻天鹅骑宠", 2439331, 10000),
		Array("梦幻麋鹿骑宠", 2439329, 10000),
		Array("爱之信使骑宠", 2438743, 10000),
		Array("兔兔赏月骑宠", 2432172, 10000),
		Array("急冲冲的茶点时间骑宠", 2439804, 10000),
		Array("踏花迎春福猪骑宠交换券", 2439908, 10000),
		Array("圣伯纳德犬骑宠", 2437699, 10000),
		Array("呆萌鲸鱼骑宠", 2434236, 10000),
		Array("变身云朵骑宠", 2434235, 10000),
		Array("橘子蜗牛骑宠永久交换券", 2435205, 10000),
		Array("超级英雄骑宠永久交换券", 2435203, 10000),
		Array("猫咪野营车骑宠", 2437261, 10000),
		Array("冰龙骑宠", 2437260, 10000),
		Array("稻香四溢骑宠", 2432149, 10000),
		Array("纸船骑宠永久优惠券", 2434737, 10000),
		Array("血色玫瑰骑宠永久使用卷", 2438598, 10000),
		Array("水豚骑宠", 2437273, 10000),
		
		
		
		
		

		Array("鸟叔邮递员骑宠", 2431915, 10000),
		Array("休彼德蔓的热气球", 2430275, 10000),
		Array("狮子王", 2430117, 10000),
		Array("田园红卡车", 2430118, 10000),
		Array("恶魔石像", 2430119, 10000),
		Array("雄狮骑宠", 2430262, 10000),
		Array("魔女的扫把", 2430264, 10000),
		Array("玩具坦克", 2430323, 10000),
		Array("妮娜的魔法", 2430316, 10000),
		Array("青蛙", 2430318, 10000),
		Array("无辜水牛", 2430322, 10000),
		Array("维京战车", 2430326, 10000),
		Array("打豆豆机器人", 2430328, 10000),
		Array("暴风摩托", 2430330, 10000),
		Array("玩具木马", 2430332, 10000),
		Array("老虎只是传说", 2430334, 10000),
		Array("莱格斯的豺犬", 2430336, 10000),
		Array("鸵鸟", 2430338, 10000),
		Array("跑车", 2430340, 10000),
		Array("拿破仑的白马", 2430342, 10000),
		Array("女女机车", 2430347, 10000),
		Array("男男机车", 2430349, 10000),
		Array("赛车", 2430351, 10000),
		Array("巨无霸兔子", 2430355, 10000),
		Array("兔兔加油", 2430357, 10000),
		Array("兔子车夫", 2430359, 10000),
		Array("走路鸡", 2430361, 10000),
		Array("机动巡逻车", 2430345, 10000),
		Array("警车", 2430367, 10000),
		Array("双梦魇骑宠", 2430933, 10000),
		//Array("蓝焰梦魇", 2432499, 10000),
		Array("冒险骑士团高速电车", 2430392, 10000),
		Array("福袋", 2430232, 10000),
		Array("GO兔冒险", 2430537, 10000),
		Array("圣诞雪橇", 2430199, 10000),
		Array("赛车", 2430211, 10000),
		Array("超级兔子", 2430508, 10000),
		Array("蓝色电单车", 2431491, 10000),
		Array("布莱克缤", 2431474, 10000),
		Array("和品克缤一起旅行", 2431777, 10000),
		Array("双粉红飞马", 2436291, 10000),
		Array("二连跳青蛙", 2431490, 10000),
		Array("幻龙", 2432110, 10000),
		Array("与你相伴阿幻影", 2432105, 10000),
		Array("与你相伴阿莉亚", 2431134, 10000),
		Array("玛瑙美洲豹", 2431268, 10000),
		Array("礼物雪球", 2431362, 10000),
		Array("蝴蝶秋千", 2431415, 10000),
		Array("滑板", 2431358, 10000),
		Array("僵尸压榨", 2431485, 10000),
		Array("黑蛇", 2431390, 10000),
		Array("舞狮", 2431391, 10000),
		//Array("贝伦", 2432296, 10000),
		Array("小龟龟", 2430320, 10000),
		Array("与天使同在", 2432170, 10000),
		Array("提拉", 2430080, 10000),
		Array("热气球", 2430292, 10000),
		Array("飞船", 2430294, 10000),
		Array("天马", 2430296, 10000),
		Array("暗光龙", 2430298, 10000),
		Array("魔法扫帚", 2430300, 10000),
		Array("筋斗云", 2430302, 10000),
		Array("骑士团战车", 2430304, 10000),
		Array("梦魔", 2430306, 10000),
		Array("透明蝙蝠", 2430309, 10000),
		Array("猫头鹰", 2430312, 10000),
		Array("直升机", 2432751, 10000),
		Array("国庆热气球", 2430464, 10000),
		Array("黑飞龙", 2431353, 10000),
		Array("天空自行车", 2431423, 10000),
		Array("雪花骑宠", 2433707, 10000),
		Array("雨和云骑宠", 2433707, 10000),
        Array("蝙蝠", 2432167, 10000),
        Array("飞行床", 2432151, 10000),
        Array("摇摇木马", 2431779, 10000),
		Array("小行星", 2432451, 10000),
		Array("蜜蜂小火车", 2431697, 10000),
		Array("南瓜马车", 2432294, 10000),
		Array("沙云", 2431883, 10000),
		Array("沙云", 2432015, 10000),
		Array("月亮", 2431464, 10000),
		Array("雨和云骑宠", 2431462, 10000)
		
		
        );

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1)
        cm.dispose();
    else {
        if (status == 0 && mode == 0) {
            cm.dispose();
            return;
        } else if (status >= 1 && mode == 0) {
            cm.sendOk("好吧，欢迎下次继续光临！.");
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            choices = "\r\n我账户点卷：#r" + cm.getPlayer().getCSPoints(1) + "#k (#r买后不支持退货哟亲#k)";
            for (var i = 0; i < scrolls.length; i++) {
                choices += "\r\n#L" + i + "##v" + scrolls[i][1] + "##z" + scrolls[i][1] + "#　#d需要#r" + scrolls[i][2] + "#d点卷#k#l";
            }
            cm.askMenuS("欢迎来到" + cm.getServerName() + "骑宠专卖店,你想买我们商店的物品么?请选择吧：." + choices, 2);
        } else if (status == 1) {
            cm.askYesNo("你确定要购买#v" + scrolls[selection][1] + "##t" + scrolls[selection][1] + "#?");
            choice = selection;
        } else if (status == 2) {
            var money = scrolls[choice][2];
            if (cm.getPlayer().getCSPoints(1) < money) {
                cm.sendOk("抱歉，你没足够的点卷！");
                cm.dispose();
            } else {
				var gachaponItem = cm.gainGachaponItem(scrolls[choice][1], 1, "骑宠专卖店", 3, true);
				if (gachaponItem != -1) {
					cm.gainNX(-money);
					cm.dispose();
					cm.sendOk("恭喜您成功购买#i" + scrolls[choice][1] + ":# #b#t" + scrolls[choice][1] + "##k。");
				} else {
					cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
				}
            }
        }
    }
}
