/**
-- BMS 反应堆脚本空白模板 -------------------------------------------------------------------------
反应堆 ID： %反应堆ID%
反应堆名称： %反应堆名称%
所在地图ID： %所在地图ID%
所在地图名称： %所在地图名称%
-- 作者 -------------------------------------------------------------------------------------------
模板：Jessefjxm
---------------------------------------------------------------------------------------------------
 **/

function act() {
	var id = rm.getReactor().getReactorId();
	var name = rm.getReactor().getName();
	rm.playerMessage(5, "这个反应堆 [" + id + " : " + name + "] 的脚本尚未修复。脚本位于： %SCRIPT_PATH% 。【注意】修改完脚本后要重新登录或者切换频道才能生效！");
}
