 var hair_Colo_new = [];
var status = -1;
var beauty = -1;
var hairCard = [5150040, 5150064, 5150100, 5150119, 5150126, 5150123, 5150124, 5150135, 5150139, 5150139];
var types = -1;
var ct = -1;
var isSecond = false;
var isAngel;
function start() {
    isAngel = cm.getJob() == 6001;
    if (isAngel) {
        cm.sendChoiceAngle();
        return;
    } else {
        action(1, 0, 0);
    }
}

function action(mode, type, selection) {

    if (mode == 0) {
        cm.dispose();
        return;
    } else if (mode == 1) {
        status++;
    } else {
        status--;
    }

    switch (status) {
        case 0:
            if (isAngel) {
                isSecond = selection != 0;
            }
            cm.askMenu("你好。我是大头国的#b#p1012117##k。如果你有#b#t05150040##k，我可以为你设计一个发型。怎么样？\r\n#b#L0#更换发型 (使用皇家理发券)#l \r\n#b#L1#更换发型 (使用顶级皇家理发券)#l\r\n#b#L2#更换发型 (使用经典皇家发型)#l\r\n#b#L3#更换发型（使用RED皇家理发券）#l\r\n#b#L4#更换发型（使用周年庆皇家理发券）#l \r\n#b#L5#更换发型（毛莫理发券）#l \r\n#b#L6#更换发型（九尾狐理发券）#l\r\n#b#L7#更换发型（闪耀之星皇家理发券）#l#l\r\n#b#L8#更换发型（奇迹皇家理发券）#l\r\n#b#L9#更换发型（BMS新加）#l");
            break;
        case 1:
            beauty = selection;
            getHairID(selection);
            var hair = isSecond ? cm.getPlayer().getSecondHair() : cm.getPlayerStat("HAIR");
            var iNow = 0;
            var hairTypeNow = [];
            for (var i = 0; i < hair_Colo_new.length; i++) {
                if (hair_Colo_new[i] != hair - hair % 10) {
                    hairTypeNow[iNow++] = hair_Colo_new[i] + (hair % 10);
                }
            }
            hair_Colo_new = cm.getCanHair(hairTypeNow);
			if(selection==9){
				cm.dispose();
				cm.openNpc(1012117, "BMS新加发型");
			}else{
				cm.askMenu("那么你想...\r\n#b#L0#看看这都有什么发型#l\r\n#b#L1#更换发型#l");
			}
            break;
        case 2:
            if (hair_Colo_new.length == 0) {
                cm.dispose();
				cm.sendOk("该理发券正在整理中....");
            } else if (selection == 0) {
                types = 0;
                cm.askAvatar("那么请随便随便看..", hair_Colo_new, hairCard[beauty]);
            } else if (selection == 1) {
                types = 1;
                if (beauty != -1) {
                    cm.askYesNo("使用#b#t" + hairCard[beauty] + "##k，可以随机更换发型。你真的要使用#b#t0" + hairCard[beauty] + "##k，更换发型吗？");
                } else {
                    cm.dispose();
					cm.sendOk("出现未知错误");
                }
            }
            break;
        case 3:
            if (types == 0) {
                //status = 0;
                //action(mode, type, beauty);
				if (cm.getChar().getCSPoints(1) >= 980) {
                ct = 1;
            }
            if (cm.getChar().getCSPoints(2) >= 980) {
                ct = 2;
            }
            if (ct != -1) {
				cm.gainNX(ct, -980);
				cm.gainItem(hairCard[beauty], 1);
				if (cm.setRandomAvatar(hairCard[beauty], hair_Colo_new) == 1) {
                    cm.addTrait("charm", 50);
                    cm.dispose();
					cm.playerMessage(1,"好了,让朋友们赞叹你的新发型吧!");
                }
            }else{
				cm.dispose();
				cm.playerMessage(1,"点卷或者抵用卷不够!");
			}
				
            } else {
                if (cm.setRandomAvatar(hairCard[beauty], hair_Colo_new) == 1) {
                    cm.addTrait("charm", 50);
                    cm.dispose();
					cm.playerMessage(1,"好了,让朋友们赞叹你的新发型吧!");
                } else {
                    cm.askYesNo("您没有可使用的会员卡。是否想消耗980抵用券/点卷直接购买使用？");
                }
            }
            break;
        case 4:
            status = 2;
            if (cm.getChar().getCSPoints(1) >= 980) {
                ct = 1;
            }
            if (cm.getChar().getCSPoints(2) >= 980) {
                ct = 2;
            }
            if (ct != -1) {
				cm.gainNX(ct, -980);
				cm.gainItem(hairCard[beauty], 1);
            } else {
                beauty = -1;
            }
            action(mode, type, selection);
            break;
        default:
            cm.dispose();
            break;
    }
}

function getHairID(selection) {
    switch (selection) {
        case 0://皇家理发券
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [30010, //黑色贝吉塔发型
                    30090, //黄色喔喔鸡发型
                    30440, //黑色狂野发
                    32160, //黑色克洛乌发型
                    32500, //黑色彩虹核爆发型
                    33160, //银色利琳发型(男)
                    33170, //黑色佳佳发型
                    33190, //黑色唤灵I男发型
                    33210, //黑色犀利哥发型
                    33250, //黑色妖精维英发型
                    33260, //黑色南哈特发型
                    33270, //黑色高富帅发型
                    33280, //黑色潇洒男发型
                    33300, //黑色虫虫发型
                    33310, //白色唤灵男发型
                    33320, //黑色豹弩男发型
                    33330, //黑色天使发型
                    33340, //黑色后翘翘发型
                    33350, //黑色前翘翘发型
                    33360 //黑色老克勒发型
                ];
            } else {
                hair_Colo_new = [
                    31090, //黑色马尾
                    31100, //黑色短发
                    31110, //黑色淑女头
                    31140, //黑色书童女
                    31160, //黑色小髻
                    31170, //黑色栗米发
                    31180, //黑色公主头
                    31190, //黑色辣妹头
                    31260, //黑色2046之王靖雯头
                    31450, //黑色甜心发型
                    31840, //黑色女性爆炸发型
                    31870, //黑色孔雀发型
                    31880, //黑色杉菜发型
                    31890, //黑色调皮少女发型
                    31910, //黑色上海小姐发型
                    31920, //黑色清爽盘发
                    31990, //黑色龙神女发型
                    32130, //黑色机械师女发型
                    32140, //黑色大波浪发型
                    32150, //黑色谢丽尔发型
                    32490, //女版酷尖尖发型
                    34000, //黑色冲天辫
                    34010, //黑色空气卷发型
                    34040, //黑色波波头
                    34050, //银色战神女发型
                    34100 //黑色蝴蝶结发型
                ];
            }
            break;
        case 1://顶级皇家理发券:5150064
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [33370, //黑色不均衡发型
                    33380, //白色TOP发型
                    33400, //黑色管家发型
                    33410, //黑色光亮分层发型
                    33430, //黑色猫耳发型
                    33460, //黑色后倒发型
                    33470, //黑色冷峻发型
                    33480, //黑色艺术长发
                    33510, //白色机械师发型
                    33520, //黑色花样美男发型
                    33550, //黑色风中凌乱男生发型
                    33580, //黑色发胶尖尖发型
                    33590, //黑色巴黎发型
                    33600, //黑色霹雳发型
                    33620, //黑色艺术家发型
                    33630, //黑色毛毛干练发型
                    40250, //黑色闪烁之星发型
                    33640, //黑色我最帅发型
                    33650, //黑色意大利男士发型
                    33660 //黑色潮男气质短发
                ];
            } else {
                hair_Colo_new = [
                    34110, //黑色宅女发型
                    34120, //黑色波希米亚发型
                    34130, //黑色自闭发型
                    34140, //黑色双刀I女发型
                    34150, //黑色可爱啾啾头
                    34160, //银色利琳发型(女)
                    34170, //黑色叮铃发型
                    34180, //银色波浪马尾发型
                    34190, //黑色豹弩I女发型
                    34200, //黑色暗影女发型
                    34210, //黑色小公主发型
                    34220, //黑色猪小七发型
                    34230, //黑色妖精波波头
                    34240, //黑色厮守发型
                    34250, //黑色洛小蒙发型
                    34260, //黑色雯子花苞头
                    34270, //黑色拉直发型
                    34280, //黑色虫虫发型
                    34290, //白色唤灵女发型
                    34310, //黑色哥特萝莉发型
                    34320, //黑色月下佳人发型 
                    34330, //黑色邻家妹发型
                    34340, //黑色浪漫编织发型
                    34360, //黑色蓬松麻花辫
                    34370, //黑色樱桃短发
                    34380 //黑色公主发型
                ];
            }
            break;
        case 2://经典皇家发型:5150100 
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    33370, //黑色不均衡发型
                    33380, //白色TOP发型
                    33400, //黑色管家发型
                    33410, //黑色光亮分层发型
                    33430, //黑色猫耳发型
                    33460, //黑色后倒发型
                    33470, //黑色冷峻发型
                    33480, //黑色艺术长发
                    33510, //白色机械师发型
                    33520, //黑色花样美男发型
                    33550, //黑色风中凌乱男生发型
                    33580, //黑色发胶尖尖发型
                    33590, //黑色巴黎发型
                    33600, //黑色霹雳发型
                    33620, //黑色艺术家发型
					36700, //黑色泡泡
                    33630, //黑色毛毛干练发型
                    40250, //黑色闪烁之星发型
                    33640, //黑色我最帅发型
                    33650, //黑色意大利男士发型
                    33660, //黑色潮男气质短发
                    33670, //黑色王子尾羽发型 
                    33680, //黑色情人结发型
                    33700, //黑色奢华发型
                    33710, //黑色亮泽小尾巴发型
                    33720, //黑色独角兽发型
                    33730, //黑色波浪马尾辫
                    33740, //黑色骑士发型
                    33750, //黑色端正柔顺发型
                    33760, //黑色婴儿卷发
                    33770, //黑色率真短发 
                    33780, //黑色狂野精神发型
                    33790, //黑色新古典短发
                    33800, //黑色炎男发型
                    33810, //黑色柠檬发型
                    33820, //黑色刀刃发型
                    33930, //黑色粗犷男人发型
                    33940, //黑色花花少爷发型
                    33950, //黑色看不见发型
                    33960, //黑色羞涩男孩发型
                    33970 //黑色爆气勇士发型
                ];
            } else {
                hair_Colo_new = [
                    34400, //黑色麦穗头
                    34410, //黑色恶魔发型 
                    34420, //银灰精灵发型
                    34430, //黑色花朵发型
                    34440, //黑色罗曼蒂克发型
                    34450, //黑色猫咪发型
                    34470, //黑色淘气女孩苹果头
                    34480, //白色机械师女性发型
                    34490, //黑色丽亚娜发型
                    34510, //黑色美人鱼发型
                    34540, //黑色原子发型
                    34560, //黑色风中凌乱女生发型
                    34590, //黑色清爽活泼小辫
                    34620, //黑色糖果蓬蓬发型
                    34630, //黑色华丽女王发型
                    34640, //黑色洋气短发
                    34650, //黑色中华发型
                    34660, //黑色迷你兔兔发型
                    34670, //黑色香水月季发型
                    34680, //黑色迪斯科发型
                    34690, //黑色小葫芦卷发型
                    34700, //黑色清新短发
                    34710, //黑色创意棒子发型
                    34720, //黑色灯笼辫子发型
                    34730, //黑色波浪蓬蓬头
                    34750, //黑色侧扎长波浪发型
                ];
            }
            break;
        case 3://RED皇家理发券 5150119
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    33980, //黑色小刺猬发型
                    33990, //黑色火焰男发型
                    34130, //黑色自闭发型
                    34350, //黑色宴会发型
                    35000, //黑色IT男发型
                    35010, //黑色我的王子发型
                    35020, //黑色鸟巢发型
                    35040, //黑色摇滚发型
                    35050, //黑色飓风发型
                    35070, //黑色纳豆发型
                    35090, //黑色凌乱碎发发型
                    35110, //黑色浪客发型
                    35120, //黑色小英俊发型
                    35130, //黑色Cool Boy发型
                    35200, //黑色魅力潮男发型
                    35220, //黑色潮男发型
                    35240, //黑色镜头感发型
                    35260, //黑色小帅发型
                    35270, //黑色都教授发型
                    35280 //黑色发胶发型
                ];
            } else {
                hair_Colo_new = [
                    34760, //黑色可爱桃子发型
                    34770, //黑色阿莉亚发型
                    34780, //黑色魅力卷发
                    34790, //黑色春之华尔兹发型
                    34810, //黑色刀刃发型
                    34820, //黑色雪姬发型
                    34830, //黑色希神发型
                    34840, //黑色海螺姑娘发型
                    34850, //黑色小丫环发型
                    34860, //黑色月光妖精发型
                    34870, //黑色萌动发型
                    34880, //黑色清新短卷发型
                    34890, //黑色大小姐发型
                    34900, //黑色花环仙女发型
                    34910, //黑色干练OL发型
                    34940, //黑色希纳斯发型
                    34950, //黑色伊莉娜发型
                    34960, //黑色迪纳卡发型
                    34970, //黑色苏子叶发型
                    34980, //黑色银河牛仔发型(女)
                    34990, //黑色武道魂发型
                    35190, //黑色乖宝贝发型
                    35710, //黑色苗苗发型
                    36170, //优雅发型
                    36180, //黑色棒棒糖发型
                    36340 //黑色废都风格发型
                ];
            }
            break;
        case 4://周年庆皇家理发券 5150126
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    35290, //黑色优质男生发型
                    35300, //黑色峰峰发型
                    35330, //黑色摩卡少年发型
                    35340, //黑色透气蓬松卷卷
                    35350, //黑色麦香飞舞发型
                    35420, //黑色蓬蓬头发型
                    35430, //黑色质感碎发发型
                    35440, //黑色影碟发型
                    35450, //黑色俠客的新髮型
                    35460, //黑色呆萌少年发型
                    35470, //黑色Rock Boy发型
                    35490, //黑色奥德赛发型
                    35510, //黑色迪伦发型
                    35520, //黑色就是任性发型
                    35530, //冲击发型
                    35550, //黑色呆萌宝宝发型
                    35560, //黑色奶油小生发型
                    35600, //黑色蓝莓之恋发型
                    35620, //黑色花样欧巴发型
                    35630 //黑色一米阳光发型
                ];
            } else {
                hair_Colo_new = [
                    36350, //黑色炫目发型
                    36400, //黑色短卷发
                    37000, //黑色奥尔卡发型
                    37010, //黑色瓦莱莉发型
                    37020, //黑色克里斯丁发型
                    37030, //黑色白富美发型
                    37040, //优雅发型
                    37050, //黑色害羞乖女发型
                    37060, //白色人鱼公主发型
                    37090, //黑色婷可贝鲁发型
                    37100, //黑色桃乐丝发型
                    37110, //黑色圆圆贝壳发型
                    37180, //黑色苹果啾啾发型
                    37190, //黑色可爱囡囡发型
                    37200, //黑色S波浪长发
                    37210, //黑色可爱淘发型
                    37220, //黑色双层质感长发
                    37230, //黑色花骨朵发型
                    37270, //娃娃头（黑）
                    37280, //黑色牛角发型
                    37290, //黑色睡意慵懒发型
                    37300, //黑色木灵发型
                    37310, //黑色棉花糖发型
                    37320, //黑色紫丁香发型
                    37340, //黑色丝柔发型
                    37350 //黑色哥特萝莉发型
                ];
            }
            break;
        case 5://毛莫理发券 5150123
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    35650, //黑色水晶男孩
                    35660, //黑色摇滚少年发型
                    35680, //黑色小细节发型
                    35690, //黑色空气感碎发
                    35710, //黑色苗苗发型
                    35720, //黑色纯真年代发型
                    35760, //黑色青涩少年发型
                    35770, //黑色小淘气发型
                    35780, //黑色花样少年发型
                    35790, //黑色龙卷风发型
                    36000, //黑色半遮眼男发型
                    36030, //黑色米哈尔发型
                    36080, //黑色摩诃发型
                    36090, //黑色少年南哈特发型
                    36100, //黑豆刨冰发型
                    36110, //黑色银河牛仔发型(男)
                    36130, //黑色难掩帅气发型
                    36140, //黑色可爱洋葱发型
                    36150, //黑色撅撅发型
                    36160 //黑色香吉发型
                ];
            } else {
                hair_Colo_new = [
                    38490, //黑色峰峰发型
                    38500, //黑色森林波浪卷发型
                    38520, //黑色狂热玛利亚发型
                    38540, //黑色优雅女生发型
                    38560, //黑色影蝶发型
                    38590, //黑色奥德赛发型
                    38600, //黑色My Girl发型
                    38610, //黑色柔顺淑女发型
                    38620, //黑色清新短发发型
                    38630, //黑色水漾女生发型
                    38640, //黑色可爱甜心发型
                    38650, //黑色随意马尾发型
                    38660, //清爽发型
                    38670, //活力短发
                    38680, //黑色呆萌兔兔发型
                    38690, //黑色浪漫满屋发型
                    38700, //黑色甜美淑女发型I
                    38710, //黑色甜美淑女发型II
                    38730, //黑色纯真年代发型
                    38740, //黑色俏皮小妞
                    38760, //水晶女孩
                    38770, //黑色哈允德发型
                    38790, //黑色淘气女生发型
                    38800, //黑色俏皮小呆毛发型
                    38810, //黑色萝莉发型
                    38930, //黑色宫廷双马尾发型
                    38940, //黑色飘逸梦幻发型
                    41080, //黑色轻盈少女马尾
                    41090, //黑色空气刘海发型
                    41120, //黑色卡门发型
                    41340 //黑色闪烁之星发型


                ];
            }
            break;
        case 6://九尾狐理发券  5150124
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    36170, //优雅发型
                    36180, //黑色棒棒糖发型
                    36220, //黑色邻家小弟发型
                    36230, //黑色层次发型
                    36300, //黑色飘逸公子发型
                    36310, //黑色圆嘟嘟发型
                    36330, //黑色午夜发型
                    36340, //黑色废都风格发型
                    36350, //黑色炫目发型
                    36370, //黑色高鬓角毛毛头
                    36380, //黑色维多利亚发型
                    36390, //黑色蓬蓬头发型
                    36410, //黑色鹰嘴发型
                    36420, //黑色指挥家发型
                    36430, //黑色包子发型
                    36440, //黑色叙事诗发型
                    36450, //黑色魅力公子发型
                    36480, //黑色斯乌发型
                    36490, //黑色关谷发型
                    36510 //黑色双彩发型
                ];
            } else {
                hair_Colo_new = [
                    37370, //黑色佛罗拉发型
                    37380, //黑色春丽发型
                    37400, //黑色狐尾发型
                    37410, //黑色波兰发型
                    37420, //黑色羊角角发型
                    37430, //黑色柔亮短发
                    37440, //黑色茉莉发型
                    37460, //黑色小奥尔卡发型
                    37500, //黑色维丽尔发型
                    37510, //黑色仙草发型
                    37520, //黑色麦穗双马尾
                    37530, //黑色满天星发型
                    37560, //黑色小清新发型
                    37580, //黑色狂欢个性发型
                    37590, //黑色隼人马尾辫
                    37610, //黑色公主姬发型
                    37620, //黑色优雅马尾 
                    37630, //黑色泡泡卷发型
                    37640, //黑色小呆毛发型
                    37650, //黑色星星糖发型
                    37670, //黑色斑驳发型
                    37680, //黑色天然直发发型
                    37690, //黑色萌萌狐仙发型
                    37700, //黑色花妖精发型
                    37710, //黑色超级巨星发型-女神1号
                    37720 //黑色帕帕亚发型
                ];
            }
            break;
        case 7://闪耀之星皇家理发券 5150135
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    36520, //黑色贵公子发型
                    36530, //黑色张扬发型
                    36540, //黑色包菜发型
                    36550, //黑色狂欢朋克发型
                    36580, //黑色蛋糕卷发型
                    36590, //黑色害羞宝宝头
                    36600, //黑色坎纳男孩发型
                    36620, //黑色巧克力发型
                    36630, //黑色电蓬发型
                    36640, //黑色乌鸦发型
                    36650, //黑色亲和发型
                    36670, //黑色前焦点发型
                    36680, //黑色潇洒短发
                    36690, //黑色萌萌狐仙发型
                    36710, //黑色遮眼发型
                    36720, //黑色超级巨星发型-男神1号
                    36730, //黑色小王子发型
                    36740, //黑色海藻头发型
                    36750, //黑色简约发型
                    36760 //黑色随风发型
                ];
            } else {
                hair_Colo_new = [
                    37730, //黑色魅力短发
                    37740, //黑色仙草2号发型
                    37750, //黑色人鱼公主发型
                    37760, //黑色梦幻女生发型
                    37800, //黑色皮皮长发
                    37810, //黑色海藻头发型
                    37820, //黑色奥罗拉发型
                    37830, //黑色悠悠发型
                    37840, //黑色修嘉发型
                    37850, //黑色奥利维亚发型
                    37860, //黑色粉小妹发型
                    37880, //黑色小呆呆毛发型
                    37890, //黑色熊孩纸发型
                    37900, //黑色动漫少女发型
                    37910, //黑色牛角面包发型
                    37920, //黑色萌萌兔耳发型
                    37930, //黑色未来女战士发型
                    37940, //黑色梦幻飘逸长发
                    37950, //黑色海藻头发型
                    37960, //黑色梦幻飘逸长发
                    37970, //奥利维亚发型
                    37980, //黑色渐变陶瓷卷发型
                    37990, //黑色浪漫小啾发型
                    38010, //黑色风一样的女纸发型
                    38020, //黑色月光天使发型
                    38040 //黑色我的公主发型
                ];
            }
            break;
        case 8://奇迹皇家理发券 5150139
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    36770, //黑色男版草莓初恋发型
                    36800, //黑色小正太发型
                    36810, //黑色超级巨星发型-男神2号
                    36820, //黑色布雷斯发型
                    36830, //黑色白银雨发型
                    36840, //黑色提斯发型
                    36850, //黑色伦多发型
                    36860, //黑色小卷毛发型
                    36880, //黑色小狮子发型
                    36890, //黑色熊孩纸发型
                    36900, //黑色萌萌兔耳发型
                    36910, //黑色超胆侠发型
                    36920, //黑色动漫少年发型
                    36930, //黑色未来战士发型
                    36940, //黑色苹果头发型
                    36950, //黑色潇洒哥发型
                    36980, //黑色精灵王子发型
                    36990, //黑色艺术青年发型
                    40000, //黑色小绅士发型
                    40020, //黑色型男发型
                    40030, //黑色蓬松短发
                    40040 //黑色冬雪发型
                ];
            } else {
                hair_Colo_new = [
                    38050, //黑色层次感碎发
                    38075, //黑色温婉发型
                    38070, //黑色女版草莓初恋发型
                    38080, //黑色俏皮小乖发型
                    38090, //黑色侠女发型
                    38100, //黑色超级巨星发型-女神2号
                    38110, //黑色恬静女生发型
                    38120, //黑色小静公主头发型
                    38150, //黑色小可爱发型
                    38160, //黑色俏皮妞妞发型
                    38220, //黑色翘麻花发型
                    38240, //黑色优雅女生发型
                    38310, //白色巴尼女孩发型
                    38320, //黑色小颂伊发型
                    38330, //黑色童稚发型
                    38350, //黑色时尚潮女发型
                    38360, //黑色梦幻短发发型
                    38390, //黑色街拍潮女发型
                    38400, //黑色轻舞飞扬发型
                    38410, //黑色气质淑女发型
                    38420, //黑色浪漫甜心发型
                    38430, //黑色学生妹发型
                    38450, //黑色俠客的新髮型
                    38460, //黑色麻花辫发型
                    38470, //黑色宝贝甜心发型
                    38480 //黑色冰雪气质发型
                ];
            }
            break;
		case 9://BMS新加
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
				40700,//黑色熔岩珊瑚爆炸头
40710,//黑色清爽小哥发型
40720,//黑色小辣椒发型-男
40730,//黑色麦吉发型
40740,//黑色奶茶少年
40750,//黑色妖魅童子男发型
40760,//黑色复古小生发型
40770,//黑色蓬松细卷发型
40780,//黑色休止符发型
40790,//黑色麻花发型
40680,//黑色叛逆少年发型
                    36770, //黑色男版草莓初恋发型
                    36800, //黑色小正太发型
                    36810, //黑色超级巨星发型-男神2号
                    36820, //黑色布雷斯发型
                    36830, //黑色白银雨发型
                    36840, //黑色提斯发型
                    36850, //黑色伦多发型
                    36860, //黑色小卷毛发型
                    36880, //黑色小狮子发型
                    36890, //黑色熊孩纸发型
                    36900, //黑色萌萌兔耳发型
                    36910, //黑色超胆侠发型
                    36920, //黑色动漫少年发型
                    36930, //黑色未来战士发型
                    36940, //黑色苹果头发型
                    36950, //黑色潇洒哥发型
                    36980, //黑色精灵王子发型
                    36990, //黑色艺术青年发型
                    40000, //黑色小绅士发型
                    40020, //黑色型男发型
                    40030, //黑色蓬松短发
                    40040 //黑色冬雪发型
                ];
            } else {
                hair_Colo_new = [
44020,//黑色艾斯尼发型
44030,//黑色清秀女生发型
44040,//黑色拟真机器人马伦发型
44050,//黑色拟真机器人西博发型
44060,//黑色拟真机器人安博发型
44070,//黑色拟真机器人埃伯利发型
44080,//黑色拟真机器人托普发型
44090,//黑色拟真机器人斯卡雷发型
44100,//黑色拟真机器人布仑兹发型
44110,//黑色拟真机器人金吉发型
44120,//黑色星云发型
44130,//黑色滚滚发型
44140,//黑色妖精维英发型
44150,//黑色天使发型
44160,//黑色齐耳烫发型
44170,//黑色摩丝定型发型
44180,//黑色黛米安发型
44190,//黑色叛逆少女发型
44200,//黑色真挚少女发型
44290,//黑色波波头发型
44300,//黑色白蔷薇女发型
44310,//黑色俏皮小妖精发型
44320,//黑色傲娇卷卷发型
44330,//黑色娉婷小妞发型
44340,//乱蓬蓬的头发
44350,//正式翼人发型
44360,//黑色时尚朋克发型
44370,//黑色半丸子头发型
44380,//黑色萌萌小乖囡发型
44390,//黑色立刻上学发型
44400,//黑色治愈萝莉发型
44410,//黑色不良学生发型
44420,//黑色捣蛋鬼发型
44430,//黑色灵气萌萌长发




41900,//名称:黑色柔顺发型
41910,//名称:黑色叛逆少女发型
41920,//名称:黑色扭辫发型
41930,//名称:黑色至爱发型
41940,//名称:검은색 16F/W트렌드헤어
41950,//名称:黑色小辣椒发型-女
41960,//名称:aa
41970,//黑色清秀短发
41980,//黑色天然卷发型
41990,//黑色清新波浪卷发
42010,//黑色鱼尾发型
42060,//Louie Hair
42070,//Louie Hair
42090,//黑色格罗娜发型
42110,//黑色纳瑞坎发型
42120,//黑色张博士发型
42090,//黑色格罗娜发型
42080,//黑色绯红之心发型
41840,//黑色NPC派发型
41830,//黑色NPC泡芙发型
41820,//黑色NPC布丁发型
41810,//黑色NPC栗子糕发型
41770,//黑色两小无猜发型
41760,//黑色万事屋发型
41750,//黑色可爱学生妹发型
41740,//黑色月下佳人发型
41730,//黑色俏皮短波浪发型
41720,//黑色琉璃波浪卷发型
41700,//黑色酸奶奶昔发型
41690,//黑色斜刘海魅惑卷发
41680,//黑色日式花苞头
41670,//黑色天堂之翼发型
41660,//黑色超长双马尾女发型
41650,//黑色泉奈发型
41640,//黑色竹野子发型
41600,//黑色麻花长波浪
41590,//黑色暖暖棉花糖发型
41580,//黑色城堡公主发型
41570,//黑色春天的精灵发型
41560,//검은색 알리샤 헤어
41550,//黑色呆毛萌萌双发辫
41540,//黑色青春学生妹发型
41520,//名称:黑色光与影发型
41510,//黑色幽灵怪盗发型
41490,//黑色被遗忘的英雄隐月发型
41480,//黑色驯龙高手发型
41470,//丝绸发型
41460,//黑色俏皮小野猫发型
41440,//黑色熏香发型
41430,//黑色摇滚灵魂发型
41420,//黑色女神长发
41410,//黑色不对称发型
41400,//黑色扭扭高马尾发型
41390,//白色烟熏狂野发型
41380,//黑色狂战士发型
41370,//黑色精灵女王发型
41360,//黑色布莱尔夫人发型
41350,//검은색 땋은별 헤어
41340,//黑色闪烁之星发型
41220,//黑色朴素发型
41210,//검은색 티아라 헤어
41200,//黑色优雅波浪长发
41190,//黑色清纯束发
41160,//黑色爱丽丝发型
41150,//黑色尤娜发型
41070,//黑色干练发型
41080,//黑色轻盈少女马尾
41060,//黑色自由发型
41377,//褐色精灵女王发型
41390,//白色烟熏狂野发型
41440,//黑色熏香发型
41460,//黑色俏皮小野猫发型
41470,//丝绸发型
41420,//黑色女神长发
41430,//黑色摇滚灵魂发型
41220,//黑色朴素发型
41340,//黑色闪烁之星发型
41600,//黑色麻花长波浪
41650,//黑色泉奈发型
41660,//黑色超长双马尾女发型
41640,//黑色竹野子发型
41690,//黑色斜刘海魅惑卷发
41680,//黑色日式花苞头
41670,//黑色天堂之翼发型
41660,//黑色超长双马尾女发型
41720,//黑色琉璃波浪卷发型
41710,//黑色清新小卷毛发型
41700,//黑色酸奶奶昔发型
41490,//黑色被遗忘的英雄隐月发型
41470,// 41476丝绸发型
41480,// 41480黑色驯龙高手发型
41520,// 41520黑色光与影发型
41510,// 41510黑色幽灵怪盗发型
41555,// 41555蓝色呆毛萌萌双发辫
41560,// 41560검은색 알리샤 헤어
41540,// 41540黑色青春学生妹发型
41585,// 41585蓝色城堡公主发型
41593,// 41593黄色暖暖棉花糖发型
41570,// 41570黑色春天的精灵发型
41580,// 41580黑色城堡公主发型
41576,// 41576紫色春天的精灵发型
41870,// 41870黑色精灵鼠女发型
41860,// 41860黑色噩梦女王发型
41880,// 41880黑色星缘发型
41900,// 41900黑色编发双马尾发型
41890,// 41890黑色蝶梦发型
41916,// 41916紫色叛逆少女发型
41930,// 41930黑色至爱发型
41920,// 41920黑色扭辫发型
41950,// 41950黑色小辣椒发型-女
41940,// 41940검은색 16F/W트렌드헤어
41936,// 41936紫色至爱发型
41980,// 41980黑色天然卷发型
41970,// 41970黑色清秀短发
41730,// 41730黑色俏皮短波浪发型
41740,// 41740黑色月下佳人发型
41750,// 41750黑色可爱学生妹发型
41760,// 41760黑色万事屋发型
41770,// 41770黑色两小无猜发型
41800,// 41800黑色萝莉斜马尾发型
41810,// 41810黑色NPC栗子糕发型
41820,// 41820黑色NPC布丁发型
41830,// 41830黑色NPC泡芙发型
41840,// 41840黑色NPC派发型
41850,// 41850黑色彩铃发型
44140,// 44140黑色妖精维英发型
44130,// 44130黑色滚滚发型
44150,// 44150黑色天使发型
44110,// 44110黑色拟真机器人金吉发型
44100,// 44100黑色拟真机器人布仑兹发型
44120,// 44120黑色星云发型

                ];
            }
            break;
    }
}