/**
-- BMS NPC脚本空白模板 ----------------------------------------------------------------------------
NPC ID： 3003646
NPC名称： 小型飞船
所在地图ID： 450009300
所在地图名称： 
-- 更新日志 ---------------------------------------------------------------------------------------
2019-08-13 Jessefjxm 建立模板
2019-09-12 Jessefjxm 更新模板
---------------------------------------------------------------------------------------------------
 **/

// 全局变量
var status = -1; // status: 当前聊天交互轮数
var selectionLog = new Array(); // 记录每一轮的选择

// 开头
function start() {
    cm.askYesNo("你要返回前哨基地吗？");
}

function action(mode, type, selection) {
    if (mode == 1) {
        cm.warp(450009050, 0);
    }
    cm.dispose();
}