status = -1;
var tz15 = "#fEffect/CharacterEff/1112949/0/0#";  //花样音符
var aaa ="#fUI/UIWindow/AriantMatch/characterIcon/5#";
var yun ="#fUI/UIWindow/Quest/icon8/0#";////红沙漏
var yun2 ="#fUI/UIWindow/Quest/icon8/0#";////蓝指标
var yun8 ="#fUI/UIWindow/MonsterBook/arrowLeft/normal/0#";////金左指标
var yun9 ="#fUI/UIWindow/MonsterBook/arrowRight/normal/0#";////金右指标
var yun4 ="#fUI/UIWindow/Quest/reward#";////奖励
var ttt ="#fUI/UIWindow/Quest/icon2/7#";//"+ttt+"//美化1
var ttt2 ="#fUI/UIWindow/Quest/icon6/7#";////美化2
var ttt3 ="#fUI/UIWindow/Quest/icon3/6#";//"+ttt3+"//美化圆
var ttt4 ="#fUI/UIWindow/Quest/icon5/1#";//"+ttt4+"//美化New
var ttt5 ="#fUI/UIWindow/Quest/icon0#";////美化!
var ttt7 ="#fUI/Basic/BtHide3/mouseOver/0#";//"+ttt6+"//美化会员
var ttt6 ="#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var epp = "#fEffect/CharacterEff/1082312/0/0#";  //彩光
var eff = "#fCharacter/Weapon/01702523.img/48/straight/0/effect#"; //彩虹带
var eff = "#fEffect/CharacterEff/1112905/0/1#"; //
var epp = "#fEffect/CharacterEff/1082312/0/0#";  //彩光
var epp1 = "#fEffect/CharacterEff/1082312/2/0#"; //彩光1
var axx = "#fEffect/CharacterEff/1051294/0/0#";  //爱心
var xxx = "#fEffect/CharacterEff/1082565/2/0#"; //星系
var ppp = "#fEffect/CharacterEff/1112907/4/0#"; //泡炮 
var epp3 = "#fEffect/CharacterEff/1112908/0/1#";  //彩光3
var axx1 = "#fEffect/CharacterEff/1062114/1/0#";  //爱心
var zs = "#fEffect/CharacterEff/1112946/2/0#";  //砖石粉
var zs1 = "#fEffect/CharacterEff/1112946/1/1#";  //砖石蓝
var dxxx = "#fEffect/CharacterEff/1102232/2/0#"; //星系
var tz = "#fEffect/CharacterEff/1082565/2/0#";  //兔子蓝
var tz1 = "#fEffect/CharacterEff/1082565/4/0#";  //兔子粉
var tz7 = "#fEffect/CharacterEff/1112900/3/1#";  //音符红
var tz8 = "#fEffect/CharacterEff/1112900/4/1#";  //音符绿
var tz88 = "#fEffect/CharacterEff/1112900/5/1#";  //音符绿!
var yun1 ="#fUI/UIWindow/Quest/icon7/10#";////红色圆
var tz9 = "#fEffect/CharacterEff/1112902/0/0#";  //蓝心
var tz10 = "#fEffect/CharacterEff/1112903/0/0#";  //红心
var tz11 = "#fEffect/CharacterEff/1112904/0/0#";  //彩心
var tz12 = "#fEffect/CharacterEff/1112924/0/0#";  //黄星
var tz13 = "#fEffect/CharacterEff/1112925/0/0#";  //蓝星
var tz14 = "#fEffect/CharacterEff/1112926/0/0#";  //红星
var tz15 = "#fEffect/CharacterEff/1112949/0/0#";  //花样音符
var tz16 = "#fEffect/CharacterEff/1112949/1/0#";  //花样音符
var tz17 = "#fEffect/CharacterEff/1112949/2/0#";  //花样音符
var tz18 = "#fEffect/CharacterEff/1112949/3/0#";  //花样音符
var tz19 = "#fEffect/CharacterEff/1112949/4/0#";  //花样音符
var tz20 = "#fEffect/CharacterEff/1114000/1/0#";  //红星花
var p3 = "#fUI/UIToolTip.img/Item/Equip/Star/Star#";
var p4 ="#fUI/StarCityUI.img/GradeInfo/icon_ss/7#"
var p1 ="#fUI/SoulUI.img/DungeonMap/icon/soulTrap/0#"
var p ="#fUI/StarCityUI.img/GradeInfo/icon_ss/2#"
var q6 ="#fUI/RunnerGame.img/RunnerGameUI/UI/Point/2#"
var p2 ="#fUI/SoulUI.img/DungeonMap/icon/dungeonItem/0#"
var e2 ="#fUI/Basic.img/HScr7/enabled/base#"
var e1 ="#fUI/Basic.img/HScr7/enabled/next0#"
var e3 ="#fUI/Basic.img/HScr7/enabled/prev0#"
var icon2 = "#fUI/UIToolTip.img/Item/Equip/Star/Star#"
var itemList2 = Array(
//------药水------
Array(2000004, 500, 20, 0), //特殊药水
Array(2000005, 500, 20, 0), //超级药水
Array(1492047, 100, 1, 1), //幽暗鸦之铳	
Array(2000005, 500, 30, 0), //超级药水
Array(2022245, 500, 5, 0), //心跳停止糖
Array(2049004, 200, 1, 1), //白医卷轴10%
Array(2049005, 100, 1, 1), //白医卷轴20%
Array(1382013, 200, 1, 1), //烈焰之杖
Array(1382015, 100, 1, 1), //毒牛牛
Array(1382037, 140, 1, 1), //偃月之杖		
Array(1472072, 140, 1, 1), //幽暗鸦之爪
Array(1462053, 140, 1, 1), //幽暗鸦之瞳
Array(1402049, 140, 1, 1), //幽暗鸦之翼
Array(1332077, 140, 1, 1), //幽暗鸦之喙
Array(1002894, 100, 1, 1), //粉色编织发带
Array(1002895, 100, 1, 1), //红色编织发带
Array(1002896, 30, 1, 1), //紫色编织发带
Array(1002897, 140, 1, 1), //橙色编织发带
Array(1002898, 140, 1, 1), //绿色编织发带
Array(1002899, 140, 1, 1), //黄色编织发带
Array(1002900, 140, 1, 1), //蓝色编织发带
Array(1002914, 100, 1, 1), //盖福克斯的帽子(力量)
Array(1002915, 100, 1, 1), //盖福克斯的帽子(敏捷)
Array(1002916, 100, 1, 1), //盖福克斯的帽子(智力)
Array(1002917, 100, 1, 1), //盖福克斯的帽子(幸运)
Array(1132004, 250, 1, 1), //黑贺腰带
Array(1132010, 200, 1, 1), //黄金猪猪腰带
Array(1132011, 100, 1, 1), //黄金猪猪腰带
Array(1132012, 100, 1, 1), //法老的腰带
Array(1132013, 100, 1, 1), //不灭的法老腰带
Array(1012011, 100, 1, 1), //圣诞鹿的鼻子
Array(1012012, 100, 1, 1), //圣诞鹿的鼻子
Array(1012013, 100, 1, 1), //圣诞鹿的鼻子
Array(1012019, 100, 1, 1), //圣诞鹿的鼻子
Array(1012020, 100, 1, 1), //圣诞鹿的鼻子
Array(1012056, 100, 1, 1), //狗狗鼻
Array(1012058, 100, 1, 1), //匹诺曹的鼻子
Array(1012059, 100, 1, 1), //匹诺曹的鼻子
Array(1012060, 100, 1, 1), //匹诺曹的鼻子
Array(1012061, 100, 1, 1), //匹诺曹的鼻子
Array(2101001, 100, 1, 1), //蝙蝠魔召唤
Array(2100902, 100, 1, 1), //神秘召唤包
Array(2101001, 500, 1, 1), //蝙蝠魔召唤
Array(2100902, 500, 1, 1), //神秘召唤包
Array(2101004, 500, 1, 1), //绿水灵王召唤
Array(1012011, 500, 1, 1), //圣诞鹿的鼻子
Array(1012012, 500, 1, 1), //圣诞鹿的鼻子
Array(1012013, 500, 1, 1), //圣诞鹿的鼻子
Array(1012018, 500, 1, 1), //圣诞鹿的鼻子
Array(1012019, 500, 1, 1), //圣诞鹿的鼻子
Array(1012020, 500, 1, 1), //圣诞鹿的鼻子
Array(1012056, 500, 1, 1), //狗狗鼻
Array(1012058, 500, 1, 1), //匹诺曹的鼻子
Array(1012061, 500, 1, 1), //匹诺曹的鼻子
Array(1032030, 200, 1, 1), //勇气耳环
Array(1032031, 200, 1, 1), //永恒金盾坠
Array(1032032, 500, 1, 1), //秋叶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 500, 1, 1), //枫叶型耳环,800,1,0), //初
Array(1032041, 500, 1, 1), //枫叶型耳环,800,1,0), //庆
Array(1032042, 500, 1, 1), //枫叶型耳环,800,1,0), //盛
Array(1032055, 500, 1, 1), //工作人员C的旧收信机
Array(1032056, 500, 1, 1), //工作人员C的旧收信机
Array(1032057, 500, 1, 0), //工作人员C的旧收信机
Array(1032058, 500, 1, 0), //工作人员C钛质收信机
Array(1122001, 500, 1, 1), //绿色蝶形领结
Array(1122002, 500, 1, 1), //红色蝶形领结
Array(1122003, 500, 1, 1), //黄色蝶形领结
Array(1122004, 500, 1, 1), //粉红蝶形领结
Array(1122005, 500, 1, 1), //黑色蝶形领结
Array(1122006, 500, 1, 1), //蓝色蝶形领结
Array(1122015, 500, 1, 1), //枫叶围巾
Array(1122058, 100, 1, 1), //休彼德蔓的混沌项链
Array(1132000, 500, 1, 1), //白色腰带
Array(1132001, 500, 1, 1), //黄色腰带
Array(1132002, 500, 1, 1), //蓝色腰带
Array(1132003, 500, 1, 1), //红色腰带
Array(1132004, 450, 1, 1), //黑贺腰带
Array(1132010, 500, 1, 1), //黄金猪猪腰带
Array(1132011, 500, 1, 1), //黄金猪猪腰带
Array(1132012, 500, 1, 1), //法老的腰带
Array(1132013, 500, 1, 1), //不灭的法老腰带
Array(1122074, 500, 1, 1), //枫叶吊坠
Array(1122075, 500, 1, 1), //黄金枫叶魔法吊坠
Array(1002390, 500, 1, 1), //真扎昆头盔
Array(1002391, 500, 1, 0), //海盗头巾(绿)
//-----椅子-----
Array(3013008, 350, 1, 1), //悠长假期
Array(3010013, 250, 1, 1), //悠长假期
Array(3010014, 250, 1, 1), //月亮弯
Array(3010018, 250, 1, 1), //椰子树沙滩椅
Array(3010019, 250, 1, 1), //寿司椅
Array(3010021, 250, 1, 1), //暖暖桌
Array(3010025, 250, 1, 1), //枫叶纪念凳
Array(3010028, 250, 1, 1), //海盗的俘虏
Array(3010029, 250, 1, 1), //蓝环凳
Array(3010030, 250, 1, 1), //黑环凳
Array(3010031, 250, 1, 1), //红环凳
Array(3010032, 250, 1, 1), //黄环凳
Array(3010033, 250, 1, 1), //绿环凳
Array(3010037, 250, 1, 1), //猪猪凳
Array(3010044, 100, 1, 1), //同一红伞下
Array(3012001, 150, 1, 1), //篝火
Array(3012002, 150, 1, 1), //浴桶
Array(3010073, 150, 1, 1), //PB克缤
Array(3012003, 150, 1, 1), //爱心椅子
Array(3010012, 150, 1, 1), //剑士 宝座
Array(3010025, 50, 1, 1), //枫叶纪念凳
Array(3010037, 150, 1, 1), //猪猪凳
Array(3010038, 150, 1, 1), //爱心椅子
Array(3010040, 50, 1, 1), //蝙蝠椅
Array(3010041, 150, 1, 1), //骷髅王座
Array(3010043, 150, 1, 1), //魔女的飞扫把
Array(3010044, 150, 1, 1), //同一红伞下
Array(3010045, 150, 1, 1), //寒冰椅子
Array(3010046, 150, 1, 1), //红龙椅
Array(3010047, 100, 1, 1), //蓝龙椅
Array(3010048, 100, 1, 1), //圣诞树椅子
Array(3010049, 100, 1, 1), //雪房子
Array(3010050, 100, 1, 1), //公主凳
Array(3010057, 100, 1, 1), //血色玫瑰
Array(3010058, 100, 1, 1), //世界末日
Array(3010068, 100, 1, 1), //露水椅子
Array(3010070, 150, 1, 1), //巨无霸品克缤
Array(3010071, 125, 1, 1), //神兽椅
Array(3010077, 125, 1, 1), //猫头鹰椅子
Array(3010085, 125, 1, 1), //鬼娃娃椅子
Array(3010096, 125, 1, 1), //恐龙化石宝座
Array(3010095, 125, 1, 1), //石头人座椅
Array(3010094, 115, 1, 1), //漂漂猪椅子
Array(3010098, 125, 1, 1), //电视宅人
Array(3010106, 125, 1, 1), //雪狼战椅
Array(3010112, 125, 1, 1), //情书柜子
Array(3010117, 125, 1, 1), //魔法书椅子
Array(3010119, 125, 1, 1), //羊羊椅子
Array(3010120, 125, 1, 1), //彩蛋篮子
Array(3010123, 125, 1, 1), //夏日花朵
Array(3010124, 125, 1, 1), //都纳斯喷气椅子
Array(3010125, 125, 1, 1), //尼贝隆战舰椅
Array(3010127, 125, 1, 1), //扎昆宝座
Array(3012001, 125, 1, 0), //篝火
Array(3010136, 150, 1, 1), //6周年怪物王座
Array(3010155, 150 * 2, 1, 1), //暗影双刀的猫头鹰椅子
Array(3010144, 150 * 2, 1, 1), //七夕椅子
Array(3010149, 150 * 2, 1, 1), //牛牛风扇椅
Array(3010129, 150 * 2, 1, 1), //酋长宝座
Array(3010131, 150 * 2, 1, 1), //贪吃牛牛椅
Array(3010132, 150 * 2, 1, 1), //撒娇喵咪椅
Array(3010133, 150 * 2, 1, 1), //帐篷椅
Array(3010163, 150 * 2, 1, 1), //满月椅
// ------ 特殊奖品 --------------
//Array(4000385, 900, 1, 1), //心灯
//Array(4001465, 800, 20, 1), //爱心宝石
//Array(4110000, 700, 1, 1), //迷你抽奖用
// ------ 086添加 ------
Array(1112915, 100, 1, 1), //蓝调戒指
Array(2041120, 200, 1, 1), //欢乐力量卷轴30%
Array(2041124, 500, 1, 1), //欢乐卷轴
Array(2041131, 500, 1, 1), //欢乐卷轴
Array(5150040, 300, 1, 1), //特别美容券
Array(2049401, 500, 1, 1), //潜能附加卷轴
Array(2049301, 500, 1, 1), //装备强化卷轴
Array(4001839, 500, 1, 1),
Array(3994417, 40, 1, 1), //红蜡笔
Array(3994418, 20, 1, 1), //蜡笔
Array(3994419, 15, 1, 1), //蜡笔
Array(3994420, 10, 1, 1), //蜡笔
Array(3994421, 10, 1, 1), //蜡笔
Array(3994422, 10, 1, 1), //蜡笔
Array(1102730, 100, 1, 1), //浓翅膀
Array(1012172, 100, 1, 1), //娃娃脸
Array(1402014, 100, 1, 1), //温度计
Array(4000313, 200, 1, 1), //黄金叶子
Array(2431926, 30, 1, 1), //150
Array(2431792, 30, 1, 1), //150
Array(4000313, 150, 1, 1), //黄金叶子
Array(2430144, 300, 1, 1) //秘密能手册
// ------ 特殊奖品 --------------
);
var itemList = Array(
//-------耳环-------
Array(1032019, 500, 1, 1), //水仙耳环
Array(1032041, 500, 1, 1), //枫叶型耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 500, 1, 1), //可乐耳环
Array(1032055, 500, 1, 1), //工作人员C的旧收信机
Array(1032056, 500, 1, 1), //工作人员C的旧收信机
Array(1032057, 500, 1, 1), //工作人员C的旧收信机
Array(1032058, 500, 1, 1), //工作人员C钛质收信机
//-------帽子-------
Array(1002677, 50, 1, 1), //玩具匠人帽
Array(1002699, 50, 1, 1), //南瓜帽子
Array(1002773, 150, 1, 1), //金龙头盔
Array(1002776, 120, 1, 1), //永恒冠军盔
Array(1002777, 120, 1, 1), //永恒玄妙帽
Array(1002778, 120, 1, 1), //永恒霓翎帽
Array(1002779, 120, 1, 1), //永恒迷踪帽
Array(1002780, 120, 1, 1), //永恒海王星
Array(1002790, 120, 1, 1), //重生冠军盔
Array(1002791, 120, 1, 1), //重生玄妙帽
Array(1002792, 120, 1, 1), //重生霓翎帽
Array(1002793, 120, 1, 1), //重生迷踪帽
Array(1002794, 120, 1, 1), //重生海王星
//------披风------
Array(1102047, 100, 1, 1), //伯爵披风
Array(1102048, 100, 1, 1), //公爵披风
Array(1102140, 100, 1, 1), //卡帕莱特披风
Array(1102147, 220, 1, 1), //玩具匠人披风
Array(1102172, 30, 1, 1), //永恒不灭披风
Array(1102174, 400, 1, 1), //工作人员披风
Array(1102168, 400, 1, 1), //枫叶披风
//------手套------
Array(1082002, 300, 1, 1), //工地手套
Array(1082003, 300, 1, 1), //腕甲
Array(1082144, 300, 1, 1), //幻光手套(红)
Array(1082145, 100, 1, 1), //工地手套(黄)
Array(1082146, 100, 1, 1), //工地手套(红)
Array(1082147, 100, 1, 1), //工地手套(蓝)
Array(1082148, 100, 1, 1), //工地手套(紫)
Array(1082149, 100, 1, 1), //工地手套(褐)
Array(1082150, 100, 1, 1), //工地手套(灰)
Array(1082151, 350, 1, 0), //幻魔手套(绿)
Array(1082159, 300, 1, 0), //蓝色条纹手套
Array(1082160, 300, 1, 0), //绿色条纹手套
Array(1082178, 300, 1, 0), //马绍尔手套(桃)
Array(1082179, 300, 1, 0), //马绍尔手套(黄)
Array(1082234, 120, 1, 1), //永恒定边手套
Array(1082235, 120, 1, 1), //永恒逍遥手套
Array(1082236, 120, 1, 1), //永恒白云手套
Array(1082237, 120, 1, 1), //永恒探云手套
Array(1082238, 120, 1, 1), //永恒抚浪手套
Array(1082239, 120, 1, 1), //重生定边手套
Array(1082240, 120, 1, 1), //重生逍遥手套
Array(1082241, 120, 1, 1), //重生白云手套
Array(1082242, 120, 1, 1), //重生探云手套
Array(1082243, 120, 1, 1), //重生抚浪手套
//-------武器------
Array(1302021, 300, 1, 1), //橡皮榔头
Array(1302022, 300, 1, 1), //竹刀
Array(1302024, 300, 1, 1), //废报纸卷
Array(1302025, 300, 1, 1), //红雨伞
Array(1302026, 300, 1, 1), //黑雨伞
Array(1302027, 300, 1, 1), //绿雨伞
Array(1302028, 300, 1, 1), //紫雨伞
Array(1302029, 300, 1, 1), //褐雨伞
Array(1302058, 300, 1, 1), //冒险岛伞
Array(1302059, 300, 1, 1), //狂龙闪电剑
Array(1302061, 300, 1, 1), //蔓藤鞭子
Array(1302063, 300, 1, 1), //燃烧的火焰刀
Array(1302064, 300, 1, 1), //枫叶突击剑
Array(1302066, 300, 1, 1), //枫叶3年旗
Array(1302067, 300, 1, 1), //枫叶庆典旗
Array(1302068, 300, 1, 1), //薄光刃
Array(1302071, 300, 1, 1), //粉色花边游泳圈
Array(1302080, 300, 1, 1), //七彩霓虹灯泡
Array(1302081, 120, 1, 1), //永恒破甲剑
Array(1302084, 240, 1, 1), //火柴
Array(1302085, 240, 1, 1), //叉子
Array(1302087, 300, 1, 1), //火炬
Array(1302104, 300, 1, 1), //鱿鱼剑
Array(1302105, 100, 1, 0), //圣诞六翼天使武器(单手剑)
Array(1312012, 300, 1, 1), //乾坤圈
Array(1312013, 300, 1, 1), //判官笔
Array(1312014, 300, 1, 1), //阎王笔
Array(1312029, 300, 1, 1), //花灵之斧
Array(1312030, 300, 1, 1), //烛影摇红
Array(1312031, 300, 1, 1), //狂龙怒斩
Array(1312032, 300, 1, 1), //枫叶破击斧
Array(1312033, 300, 1, 1), //枫叶3年旗
Array(1312034, 300, 1, 1), //粉色花边游泳圈
Array(1312037, 100, 1, 1), //永恒断蚺斧
Array(1312038, 100, 1, 1), //重生断蚺斧
Array(1312039, 100, 1, 1), //圣诞六翼天使武器(单手斧)
Array(1322006, 300, 1, 1), //钢管
Array(1322020, 300, 1, 1), //黄金暴风锤
Array(1322021, 300, 1, 1), //黑游泳圈
Array(1322022, 300, 1, 1), //红花纹游泳圈
Array(1322023, 300, 1, 1), //蓝花纹游泳圈
Array(1322024, 300, 1, 1), //紫游泳圈
Array(1322025, 300, 1, 1), //救命游泳圈
Array(1322026, 300, 1, 1), //彩虹游泳圈
Array(1322027, 100, 1, 1), //米伽勒的平底锅
Array(1322051, 300, 1, 1), //七夕
Array(1322052, 300, 1, 1), //狂龙地锤
Array(1322055, 300, 1, 1), //枫叶3年旗
Array(1322056, 300, 1, 1), //粉色花边游泳圈
Array(1322060, 100, 1, 1), //永恒惊破天
Array(1322061, 100, 1, 1), //重生惊破天
Array(1322065, 100, 1, 1), //圣诞六翼天使武器(单手钝器)
Array(1322071, 300, 1, 1), //采矿铁锹
Array(1332052, 300, 1, 1), //阴风碎魂刃
Array(1332053, 300, 1, 1), //野外烧烤串
Array(1332057, 300, 1, 1), //枫叶3年旗
Array(1332059, 300, 1, 1), //粉色花边游泳圈
Array(1332063, 300, 1, 1), //初级盗贼的短剑
Array(1332066, 300, 1, 1), //新手刮胡刀
Array(1332073, 100, 1, 1), //永恒狂鲨锯
Array(1332074, 100, 1, 1), //永恒断首刃
Array(1332075, 100, 1, 1), //重生狂鲨锯
Array(1332076, 100, 1, 1), //重生断首刃
Array(1382015, 50, 1, 1), //毒牛牛
Array(1382016, 50, 1, 1), //香菇
Array(1382042, 300, 1, 0), //粉色花边游泳圈
Array(1382049, 100, 1, 1), //朱雀长杖
Array(1382050, 100, 1, 1), //玄武长杖
Array(1382051, 100, 1, 1), //白虎长杖
Array(1382052, 100, 1, 1), //青龙长杖
Array(1382057, 100, 1, 1), //永恒冰轮杖
Array(1382059, 100, 1, 1), //重生冰轮杖
Array(1382062, 100, 1, 1), //圣诞六翼天使武器(长杖)
Array(1402013, 300, 1, 1), //白日剑
Array(1402014, 50, 1, 1), //温度计
Array(1402035, 300, 1, 1), //斩天刀
Array(1402036, 300, 1, 1), //飞龙巨剑
Array(1402037, 100, 1, 1), //龙背刃
Array(1402039, 300, 1, 1), //枫叶枭首剑
Array(1402040, 300, 1, 1), //枫叶3年旗
Array(1402044, 300, 1, 1), //南瓜灯笼
Array(1022047, 600, 1, 1),
Array(1402046, 100, 1, 1), //永恒玄冥剑
Array(1412035, 100, 1, 1), //圣诞六翼天使武器(双手斧)
Array(1422033, 300, 1, 1), //粉色花边游泳圈
Array(1422036, 300, 1, 1), //玩具匠人的锤子
Array(1432009, 300, 1, 1), //木精灵枪
Array(1432010, 300, 1, 1), //奥丁手戟
Array(1432014, 300, 1, 1), //海神叉
Array(1432015, 300, 1, 1), //红色滑雪板
Array(1432016, 300, 1, 1), //橙色滑雪板
Array(1432017, 300, 1, 1), //绿色滑雪板
Array(1432018, 300, 1, 1), //蓝色滑雪板
Array(1432028, 300, 1, 1), //奥丁手戟
Array(1432030, 300, 1, 1), //红莲落神枪
Array(1432037, 300, 1, 1), //枫叶大将旗
Array(1432038, 30, 1, 1), //盘龙七冲枪
Array(1432039, 300, 1, 1), //钓鱼竿
Array(1482025, 300, 1, 1), //粉色花边游泳圈
Array(1482029, 50, 1, 1), //圣诞六翼天使武器(指节)
Array(1492026, 300, 1, 1), //粉色花边游泳圈
Array(1492030, 50, 1, 0), //圣诞六翼天使武器(手枪)
Array(1492034, 300, 1, 0), //枫叶3年旗
Array(1302073, 300, 1, 1), //新加坡国旗（初学者）
Array(1302074, 300, 1, 1), //马来西亚国旗（初学者）
Array(1302075, 300, 1, 1), //新加坡国旗（单手剑）
Array(1302076, 300, 1, 1), //马来西亚国旗（单手剑）
Array(1312035, 300, 1, 1), //新加坡国旗（单手斧）
Array(1312036, 300, 1, 1), //马来西亚国旗（单手斧）
Array(1322057, 300, 1, 1), //新加坡国旗（单手杖）
Array(1322058, 300, 1, 1), //马来西亚国旗（单手杖）
Array(1332060, 300, 1, 1), //新加坡国旗（短剑）
Array(1332061, 300, 1, 1), //马来西亚国旗（短剑）
Array(1382043, 300, 1, 1), //新加坡国旗（长杖）
Array(1382044, 300, 1, 1), //马来西亚国旗（长杖）
Array(1402042, 300, 1, 1), //新加坡国旗（双手剑）
Array(1412030, 300, 1, 1), //新加坡国旗（双手斧）
Array(1412031, 300, 1, 1), //马来西亚国旗（双手斧）
Array(1422034, 300, 1, 1), //新加坡国旗（双手杖）
Array(1432043, 300, 1, 1), //新加坡国旗（枪）
Array(1432044, 300, 1, 1), //马来西亚国旗（枪）
Array(1442058, 300, 1, 1), //新加坡国旗（矛）
Array(1452049, 300, 1, 1), //新加坡国旗（弓）
Array(1452050, 300, 1, 1), //马来西亚国旗（弓）
Array(1462044, 300, 1, 1), //新加坡国旗（弩）
Array(1462045, 300, 1, 1), //马来西亚国旗（弩）
Array(1472059, 300, 1, 1), //新加坡国旗（指节）
Array(1472060, 300, 1, 1), //马来西亚国旗（指节）
Array(1402224, 300, 1, 1) //柳德之劍

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4310143, 10)) {
            cm.askYesNo("#e#r┄┄┄┅═☆ "+q6+" BOSS抽奖机 "+q6+" ☆═┅┄┄┄\r\n\r\n"+" "+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+"\r\n\t\t\t"+"抽奖要求：【#b10个#v4310143#】\r\n\t\t\t"+"抽奖的材料获取途径，在各大BOSS小怪（掉落几率低）获取，各种极品装备等抽取\r\n\r\n"+" "+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+"\r\n\r\n\t  "+p1+"#e#r┄┄┄┅═☆ 奖品展示 ☆═┅┄┄┄"+p1+"\r\n"+"#v1132215##v1132214##v1132213##v1132212##v1132211##v1402224##v1152124##v1152123##v1152122##v1152121##v1152120##v1082489##v1082488##v4033602##v4033603##v4033604##v4033605##v3016000##v3015133##v3015089##v3015108##v3014009##v3015131##v3015027##v3994417# #v3994418# #v3994419# #v3994420# #v3994421# #v3994422# #v4001839# #v1102730#  #v1012172#  #v1402014#  #v4000313# #v2432069# #v2431926#"+" "+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+"\r\n");
        } else {
            cm.sendOk("#e#r┄┄┄┅═☆ "+q6+" BOSS抽奖机 "+q6+" ☆═┅┄┄┄\r\n\r\n"+" "+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+"\r\n\t\t\t"+"抽奖要求：【#b10个#v4310143#】\r\n"+"抽奖的材料获取途径，在各大BOSS小怪（掉落几率低）获取，各种极品装备等抽取\r\n\r\n"+" "+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+"\r\n\r\n\t  "+p1+"#e#r┄┄┄┅═☆奖品展示☆═┅┄┄┄"+p1+"\r\n"+"#v1132215##v1132214##v1132213##v1132212##v1132211##v1402224##v1152124##v1152123##v1152122##v1152121##v1152120##v1082489##v1082488##v4033602##v4033603##v4033604##v4033605##v3016000##v3015133##v3015089##v3015108##v3014009##v3015131##v3015027##v3994417# #v3994418# #v3994419# #v3994420# #v3994421# #v3994422# #v4001839# #v1102730# #v1012172# #v1402014# #v2432069# #v2431926#"+" "+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+""+tz13+""+tz14+""+tz12+"\r\n");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
		for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "BOSS币抽奖活动", notice);
            if (item != -1) {
                cm.gainItem(4310143, -10);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4310143##k吗？如果是，请你确认在背包的装备，消耗，#b其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("#r(获得了安慰奖：#b#t4001839##k 250个。)\r\n今天的运气可真差，什么都没有拿到。");
            cm.gainItem(4310143, -10);
            cm.gainItem(4001839, 250);
            cm.safeDispose();
        }
    }
}
